/*!
 * =====================================================
 * SUI Mobile - http://m.sui.taobao.org/
 *
 * =====================================================
 */
// jshint ignore: start
+function($){

$.smConfig.rawCitiesData = [
    {
        "id": 2,
        "name": "北京",
        "sub": [
            {
                "id": 52,
                "name": "北京",
                "sub": [
                    {
                        "id": 500,
                        "name": "东城区",
                        "sub": []
                    },
                    {
                        "id": 501,
                        "name": "西城区",
                        "sub": []
                    },
                    {
                        "id": 502,
                        "name": "海淀区",
                        "sub": []
                    },
                    {
                        "id": 503,
                        "name": "朝阳区",
                        "sub": []
                    },
                    {
                        "id": 504,
                        "name": "崇文区",
                        "sub": []
                    },
                    {
                        "id": 505,
                        "name": "宣武区",
                        "sub": []
                    },
                    {
                        "id": 506,
                        "name": "丰台区",
                        "sub": []
                    },
                    {
                        "id": 507,
                        "name": "石景山区",
                        "sub": []
                    },
                    {
                        "id": 508,
                        "name": "房山区",
                        "sub": []
                    },
                    {
                        "id": 509,
                        "name": "门头沟区",
                        "sub": []
                    },
                    {
                        "id": 510,
                        "name": "通州区",
                        "sub": []
                    },
                    {
                        "id": 511,
                        "name": "顺义区",
                        "sub": []
                    },
                    {
                        "id": 512,
                        "name": "昌平区",
                        "sub": []
                    },
                    {
                        "id": 513,
                        "name": "怀柔区",
                        "sub": []
                    },
                    {
                        "id": 514,
                        "name": "平谷区",
                        "sub": []
                    },
                    {
                        "id": 515,
                        "name": "大兴区",
                        "sub": []
                    },
                    {
                        "id": 516,
                        "name": "密云县",
                        "sub": []
                    },
                    {
                        "id": 517,
                        "name": "延庆县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 3,
        "name": "安徽",
        "sub": [
            {
                "id": 36,
                "name": "安庆",
                "sub": [
                    {
                        "id": 398,
                        "name": "迎江区",
                        "sub": []
                    },
                    {
                        "id": 399,
                        "name": "大观区",
                        "sub": []
                    },
                    {
                        "id": 400,
                        "name": "宜秀区",
                        "sub": []
                    },
                    {
                        "id": 401,
                        "name": "桐城市",
                        "sub": []
                    },
                    {
                        "id": 402,
                        "name": "怀宁县",
                        "sub": []
                    },
                    {
                        "id": 403,
                        "name": "枞阳县",
                        "sub": []
                    },
                    {
                        "id": 404,
                        "name": "潜山县",
                        "sub": []
                    },
                    {
                        "id": 405,
                        "name": "太湖县",
                        "sub": []
                    },
                    {
                        "id": 406,
                        "name": "宿松县",
                        "sub": []
                    },
                    {
                        "id": 407,
                        "name": "望江县",
                        "sub": []
                    },
                    {
                        "id": 408,
                        "name": "岳西县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 37,
                "name": "蚌埠",
                "sub": [
                    {
                        "id": 409,
                        "name": "中市区",
                        "sub": []
                    },
                    {
                        "id": 410,
                        "name": "东市区",
                        "sub": []
                    },
                    {
                        "id": 411,
                        "name": "西市区",
                        "sub": []
                    },
                    {
                        "id": 412,
                        "name": "郊区",
                        "sub": []
                    },
                    {
                        "id": 413,
                        "name": "怀远县",
                        "sub": []
                    },
                    {
                        "id": 414,
                        "name": "五河县",
                        "sub": []
                    },
                    {
                        "id": 415,
                        "name": "固镇县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 38,
                "name": "巢湖",
                "sub": [
                    {
                        "id": 416,
                        "name": "居巢区",
                        "sub": []
                    },
                    {
                        "id": 417,
                        "name": "庐江县",
                        "sub": []
                    },
                    {
                        "id": 418,
                        "name": "无为县",
                        "sub": []
                    },
                    {
                        "id": 419,
                        "name": "含山县",
                        "sub": []
                    },
                    {
                        "id": 420,
                        "name": "和县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 39,
                "name": "池州",
                "sub": [
                    {
                        "id": 421,
                        "name": "贵池区",
                        "sub": []
                    },
                    {
                        "id": 422,
                        "name": "东至县",
                        "sub": []
                    },
                    {
                        "id": 423,
                        "name": "石台县",
                        "sub": []
                    },
                    {
                        "id": 424,
                        "name": "青阳县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 40,
                "name": "滁州",
                "sub": [
                    {
                        "id": 425,
                        "name": "琅琊区",
                        "sub": []
                    },
                    {
                        "id": 426,
                        "name": "南谯区",
                        "sub": []
                    },
                    {
                        "id": 427,
                        "name": "天长市",
                        "sub": []
                    },
                    {
                        "id": 428,
                        "name": "明光市",
                        "sub": []
                    },
                    {
                        "id": 429,
                        "name": "来安县",
                        "sub": []
                    },
                    {
                        "id": 430,
                        "name": "全椒县",
                        "sub": []
                    },
                    {
                        "id": 431,
                        "name": "定远县",
                        "sub": []
                    },
                    {
                        "id": 432,
                        "name": "凤阳县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 41,
                "name": "阜阳",
                "sub": [
                    {
                        "id": 433,
                        "name": "蚌山区",
                        "sub": []
                    },
                    {
                        "id": 434,
                        "name": "龙子湖区",
                        "sub": []
                    },
                    {
                        "id": 435,
                        "name": "禹会区",
                        "sub": []
                    },
                    {
                        "id": 436,
                        "name": "淮上区",
                        "sub": []
                    },
                    {
                        "id": 437,
                        "name": "颍州区",
                        "sub": []
                    },
                    {
                        "id": 438,
                        "name": "颍东区",
                        "sub": []
                    },
                    {
                        "id": 439,
                        "name": "颍泉区",
                        "sub": []
                    },
                    {
                        "id": 440,
                        "name": "界首市",
                        "sub": []
                    },
                    {
                        "id": 441,
                        "name": "临泉县",
                        "sub": []
                    },
                    {
                        "id": 442,
                        "name": "太和县",
                        "sub": []
                    },
                    {
                        "id": 443,
                        "name": "阜南县",
                        "sub": []
                    },
                    {
                        "id": 444,
                        "name": "颖上县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 42,
                "name": "淮北",
                "sub": [
                    {
                        "id": 445,
                        "name": "相山区",
                        "sub": []
                    },
                    {
                        "id": 446,
                        "name": "杜集区",
                        "sub": []
                    },
                    {
                        "id": 447,
                        "name": "烈山区",
                        "sub": []
                    },
                    {
                        "id": 448,
                        "name": "濉溪县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 43,
                "name": "淮南",
                "sub": [
                    {
                        "id": 449,
                        "name": "田家庵区",
                        "sub": []
                    },
                    {
                        "id": 450,
                        "name": "大通区",
                        "sub": []
                    },
                    {
                        "id": 451,
                        "name": "谢家集区",
                        "sub": []
                    },
                    {
                        "id": 452,
                        "name": "八公山区",
                        "sub": []
                    },
                    {
                        "id": 453,
                        "name": "潘集区",
                        "sub": []
                    },
                    {
                        "id": 454,
                        "name": "凤台县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 44,
                "name": "黄山",
                "sub": [
                    {
                        "id": 455,
                        "name": "屯溪区",
                        "sub": []
                    },
                    {
                        "id": 456,
                        "name": "黄山区",
                        "sub": []
                    },
                    {
                        "id": 457,
                        "name": "徽州区",
                        "sub": []
                    },
                    {
                        "id": 458,
                        "name": "歙县",
                        "sub": []
                    },
                    {
                        "id": 459,
                        "name": "休宁县",
                        "sub": []
                    },
                    {
                        "id": 460,
                        "name": "黟县",
                        "sub": []
                    },
                    {
                        "id": 461,
                        "name": "祁门县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 45,
                "name": "六安",
                "sub": [
                    {
                        "id": 462,
                        "name": "金安区",
                        "sub": []
                    },
                    {
                        "id": 463,
                        "name": "裕安区",
                        "sub": []
                    },
                    {
                        "id": 464,
                        "name": "寿县",
                        "sub": []
                    },
                    {
                        "id": 465,
                        "name": "霍邱县",
                        "sub": []
                    },
                    {
                        "id": 466,
                        "name": "舒城县",
                        "sub": []
                    },
                    {
                        "id": 467,
                        "name": "金寨县",
                        "sub": []
                    },
                    {
                        "id": 468,
                        "name": "霍山县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 46,
                "name": "马鞍山",
                "sub": [
                    {
                        "id": 469,
                        "name": "雨山区",
                        "sub": []
                    },
                    {
                        "id": 470,
                        "name": "花山区",
                        "sub": []
                    },
                    {
                        "id": 471,
                        "name": "金家庄区",
                        "sub": []
                    },
                    {
                        "id": 472,
                        "name": "当涂县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 47,
                "name": "宿州",
                "sub": [
                    {
                        "id": 473,
                        "name": "埇桥区",
                        "sub": []
                    },
                    {
                        "id": 474,
                        "name": "砀山县",
                        "sub": []
                    },
                    {
                        "id": 475,
                        "name": "萧县",
                        "sub": []
                    },
                    {
                        "id": 476,
                        "name": "灵璧县",
                        "sub": []
                    },
                    {
                        "id": 477,
                        "name": "泗县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 48,
                "name": "铜陵",
                "sub": [
                    {
                        "id": 478,
                        "name": "铜官山区",
                        "sub": []
                    },
                    {
                        "id": 479,
                        "name": "狮子山区",
                        "sub": []
                    },
                    {
                        "id": 480,
                        "name": "郊区",
                        "sub": []
                    },
                    {
                        "id": 481,
                        "name": "铜陵县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 49,
                "name": "芜湖",
                "sub": [
                    {
                        "id": 482,
                        "name": "镜湖区",
                        "sub": []
                    },
                    {
                        "id": 483,
                        "name": "弋江区",
                        "sub": []
                    },
                    {
                        "id": 484,
                        "name": "鸠江区",
                        "sub": []
                    },
                    {
                        "id": 485,
                        "name": "三山区",
                        "sub": []
                    },
                    {
                        "id": 486,
                        "name": "芜湖县",
                        "sub": []
                    },
                    {
                        "id": 487,
                        "name": "繁昌县",
                        "sub": []
                    },
                    {
                        "id": 488,
                        "name": "南陵县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 50,
                "name": "宣城",
                "sub": [
                    {
                        "id": 489,
                        "name": "宣州区",
                        "sub": []
                    },
                    {
                        "id": 490,
                        "name": "宁国市",
                        "sub": []
                    },
                    {
                        "id": 491,
                        "name": "郎溪县",
                        "sub": []
                    },
                    {
                        "id": 492,
                        "name": "广德县",
                        "sub": []
                    },
                    {
                        "id": 493,
                        "name": "泾县",
                        "sub": []
                    },
                    {
                        "id": 494,
                        "name": "绩溪县",
                        "sub": []
                    },
                    {
                        "id": 495,
                        "name": "旌德县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 51,
                "name": "亳州",
                "sub": [
                    {
                        "id": 496,
                        "name": "涡阳县",
                        "sub": []
                    },
                    {
                        "id": 497,
                        "name": "蒙城县",
                        "sub": []
                    },
                    {
                        "id": 498,
                        "name": "利辛县",
                        "sub": []
                    },
                    {
                        "id": 499,
                        "name": "谯城区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 3401,
                "name": "合肥",
                "sub": [
                    {
                        "id": 3402,
                        "name": "庐阳区",
                        "sub": []
                    },
                    {
                        "id": 3403,
                        "name": "瑶海区",
                        "sub": []
                    },
                    {
                        "id": 3404,
                        "name": "蜀山区",
                        "sub": []
                    },
                    {
                        "id": 3405,
                        "name": "包河区",
                        "sub": []
                    },
                    {
                        "id": 3406,
                        "name": "长丰县",
                        "sub": []
                    },
                    {
                        "id": 3407,
                        "name": "肥东县",
                        "sub": []
                    },
                    {
                        "id": 3408,
                        "name": "肥西县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 4,
        "name": "福建",
        "sub": [
            {
                "id": 53,
                "name": "福州",
                "sub": [
                    {
                        "id": 518,
                        "name": "鼓楼区",
                        "sub": []
                    },
                    {
                        "id": 519,
                        "name": "台江区",
                        "sub": []
                    },
                    {
                        "id": 520,
                        "name": "仓山区",
                        "sub": []
                    },
                    {
                        "id": 521,
                        "name": "马尾区",
                        "sub": []
                    },
                    {
                        "id": 522,
                        "name": "晋安区",
                        "sub": []
                    },
                    {
                        "id": 523,
                        "name": "福清市",
                        "sub": []
                    },
                    {
                        "id": 524,
                        "name": "长乐市",
                        "sub": []
                    },
                    {
                        "id": 525,
                        "name": "闽侯县",
                        "sub": []
                    },
                    {
                        "id": 526,
                        "name": "连江县",
                        "sub": []
                    },
                    {
                        "id": 527,
                        "name": "罗源县",
                        "sub": []
                    },
                    {
                        "id": 528,
                        "name": "闽清县",
                        "sub": []
                    },
                    {
                        "id": 529,
                        "name": "永泰县",
                        "sub": []
                    },
                    {
                        "id": 530,
                        "name": "平潭县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 54,
                "name": "龙岩",
                "sub": [
                    {
                        "id": 531,
                        "name": "新罗区",
                        "sub": []
                    },
                    {
                        "id": 532,
                        "name": "漳平市",
                        "sub": []
                    },
                    {
                        "id": 533,
                        "name": "长汀县",
                        "sub": []
                    },
                    {
                        "id": 534,
                        "name": "永定县",
                        "sub": []
                    },
                    {
                        "id": 535,
                        "name": "上杭县",
                        "sub": []
                    },
                    {
                        "id": 536,
                        "name": "武平县",
                        "sub": []
                    },
                    {
                        "id": 537,
                        "name": "连城县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 55,
                "name": "南平",
                "sub": [
                    {
                        "id": 538,
                        "name": "延平区",
                        "sub": []
                    },
                    {
                        "id": 539,
                        "name": "邵武市",
                        "sub": []
                    },
                    {
                        "id": 540,
                        "name": "武夷山市",
                        "sub": []
                    },
                    {
                        "id": 541,
                        "name": "建瓯市",
                        "sub": []
                    },
                    {
                        "id": 542,
                        "name": "建阳市",
                        "sub": []
                    },
                    {
                        "id": 543,
                        "name": "顺昌县",
                        "sub": []
                    },
                    {
                        "id": 544,
                        "name": "浦城县",
                        "sub": []
                    },
                    {
                        "id": 545,
                        "name": "光泽县",
                        "sub": []
                    },
                    {
                        "id": 546,
                        "name": "松溪县",
                        "sub": []
                    },
                    {
                        "id": 547,
                        "name": "政和县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 56,
                "name": "宁德",
                "sub": [
                    {
                        "id": 548,
                        "name": "蕉城区",
                        "sub": []
                    },
                    {
                        "id": 549,
                        "name": "福安市",
                        "sub": []
                    },
                    {
                        "id": 550,
                        "name": "福鼎市",
                        "sub": []
                    },
                    {
                        "id": 551,
                        "name": "霞浦县",
                        "sub": []
                    },
                    {
                        "id": 552,
                        "name": "古田县",
                        "sub": []
                    },
                    {
                        "id": 553,
                        "name": "屏南县",
                        "sub": []
                    },
                    {
                        "id": 554,
                        "name": "寿宁县",
                        "sub": []
                    },
                    {
                        "id": 555,
                        "name": "周宁县",
                        "sub": []
                    },
                    {
                        "id": 556,
                        "name": "柘荣县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 57,
                "name": "莆田",
                "sub": [
                    {
                        "id": 557,
                        "name": "城厢区",
                        "sub": []
                    },
                    {
                        "id": 558,
                        "name": "涵江区",
                        "sub": []
                    },
                    {
                        "id": 559,
                        "name": "荔城区",
                        "sub": []
                    },
                    {
                        "id": 560,
                        "name": "秀屿区",
                        "sub": []
                    },
                    {
                        "id": 561,
                        "name": "仙游县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 58,
                "name": "泉州",
                "sub": [
                    {
                        "id": 562,
                        "name": "鲤城区",
                        "sub": []
                    },
                    {
                        "id": 563,
                        "name": "丰泽区",
                        "sub": []
                    },
                    {
                        "id": 564,
                        "name": "洛江区",
                        "sub": []
                    },
                    {
                        "id": 565,
                        "name": "清濛开发区",
                        "sub": []
                    },
                    {
                        "id": 566,
                        "name": "泉港区",
                        "sub": []
                    },
                    {
                        "id": 567,
                        "name": "石狮市",
                        "sub": []
                    },
                    {
                        "id": 568,
                        "name": "晋江市",
                        "sub": []
                    },
                    {
                        "id": 569,
                        "name": "南安市",
                        "sub": []
                    },
                    {
                        "id": 570,
                        "name": "惠安县",
                        "sub": []
                    },
                    {
                        "id": 571,
                        "name": "安溪县",
                        "sub": []
                    },
                    {
                        "id": 572,
                        "name": "永春县",
                        "sub": []
                    },
                    {
                        "id": 573,
                        "name": "德化县",
                        "sub": []
                    },
                    {
                        "id": 574,
                        "name": "金门县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 59,
                "name": "三明",
                "sub": [
                    {
                        "id": 575,
                        "name": "梅列区",
                        "sub": []
                    },
                    {
                        "id": 576,
                        "name": "三元区",
                        "sub": []
                    },
                    {
                        "id": 577,
                        "name": "永安市",
                        "sub": []
                    },
                    {
                        "id": 578,
                        "name": "明溪县",
                        "sub": []
                    },
                    {
                        "id": 579,
                        "name": "清流县",
                        "sub": []
                    },
                    {
                        "id": 580,
                        "name": "宁化县",
                        "sub": []
                    },
                    {
                        "id": 581,
                        "name": "大田县",
                        "sub": []
                    },
                    {
                        "id": 582,
                        "name": "尤溪县",
                        "sub": []
                    },
                    {
                        "id": 583,
                        "name": "沙县",
                        "sub": []
                    },
                    {
                        "id": 584,
                        "name": "将乐县",
                        "sub": []
                    },
                    {
                        "id": 585,
                        "name": "泰宁县",
                        "sub": []
                    },
                    {
                        "id": 586,
                        "name": "建宁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 60,
                "name": "厦门",
                "sub": [
                    {
                        "id": 587,
                        "name": "思明区",
                        "sub": []
                    },
                    {
                        "id": 588,
                        "name": "海沧区",
                        "sub": []
                    },
                    {
                        "id": 589,
                        "name": "湖里区",
                        "sub": []
                    },
                    {
                        "id": 590,
                        "name": "集美区",
                        "sub": []
                    },
                    {
                        "id": 591,
                        "name": "同安区",
                        "sub": []
                    },
                    {
                        "id": 592,
                        "name": "翔安区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 61,
                "name": "漳州",
                "sub": [
                    {
                        "id": 593,
                        "name": "芗城区",
                        "sub": []
                    },
                    {
                        "id": 594,
                        "name": "龙文区",
                        "sub": []
                    },
                    {
                        "id": 595,
                        "name": "龙海市",
                        "sub": []
                    },
                    {
                        "id": 596,
                        "name": "云霄县",
                        "sub": []
                    },
                    {
                        "id": 597,
                        "name": "漳浦县",
                        "sub": []
                    },
                    {
                        "id": 598,
                        "name": "诏安县",
                        "sub": []
                    },
                    {
                        "id": 599,
                        "name": "长泰县",
                        "sub": []
                    },
                    {
                        "id": 600,
                        "name": "东山县",
                        "sub": []
                    },
                    {
                        "id": 601,
                        "name": "南靖县",
                        "sub": []
                    },
                    {
                        "id": 602,
                        "name": "平和县",
                        "sub": []
                    },
                    {
                        "id": 603,
                        "name": "华安县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 5,
        "name": "甘肃",
        "sub": [
            {
                "id": 62,
                "name": "兰州",
                "sub": [
                    {
                        "id": 604,
                        "name": "皋兰县",
                        "sub": []
                    },
                    {
                        "id": 605,
                        "name": "城关区",
                        "sub": []
                    },
                    {
                        "id": 606,
                        "name": "七里河区",
                        "sub": []
                    },
                    {
                        "id": 607,
                        "name": "西固区",
                        "sub": []
                    },
                    {
                        "id": 608,
                        "name": "安宁区",
                        "sub": []
                    },
                    {
                        "id": 609,
                        "name": "红古区",
                        "sub": []
                    },
                    {
                        "id": 610,
                        "name": "永登县",
                        "sub": []
                    },
                    {
                        "id": 611,
                        "name": "榆中县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 63,
                "name": "白银",
                "sub": [
                    {
                        "id": 612,
                        "name": "白银区",
                        "sub": []
                    },
                    {
                        "id": 613,
                        "name": "平川区",
                        "sub": []
                    },
                    {
                        "id": 614,
                        "name": "会宁县",
                        "sub": []
                    },
                    {
                        "id": 615,
                        "name": "景泰县",
                        "sub": []
                    },
                    {
                        "id": 616,
                        "name": "靖远县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 64,
                "name": "定西",
                "sub": [
                    {
                        "id": 617,
                        "name": "临洮县",
                        "sub": []
                    },
                    {
                        "id": 618,
                        "name": "陇西县",
                        "sub": []
                    },
                    {
                        "id": 619,
                        "name": "通渭县",
                        "sub": []
                    },
                    {
                        "id": 620,
                        "name": "渭源县",
                        "sub": []
                    },
                    {
                        "id": 621,
                        "name": "漳县",
                        "sub": []
                    },
                    {
                        "id": 622,
                        "name": "岷县",
                        "sub": []
                    },
                    {
                        "id": 623,
                        "name": "安定区",
                        "sub": []
                    },
                    {
                        "id": 624,
                        "name": "安定区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 65,
                "name": "甘南",
                "sub": [
                    {
                        "id": 625,
                        "name": "合作市",
                        "sub": []
                    },
                    {
                        "id": 626,
                        "name": "临潭县",
                        "sub": []
                    },
                    {
                        "id": 627,
                        "name": "卓尼县",
                        "sub": []
                    },
                    {
                        "id": 628,
                        "name": "舟曲县",
                        "sub": []
                    },
                    {
                        "id": 629,
                        "name": "迭部县",
                        "sub": []
                    },
                    {
                        "id": 630,
                        "name": "玛曲县",
                        "sub": []
                    },
                    {
                        "id": 631,
                        "name": "碌曲县",
                        "sub": []
                    },
                    {
                        "id": 632,
                        "name": "夏河县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 66,
                "name": "嘉峪关",
                "sub": [
                    {
                        "id": 633,
                        "name": "嘉峪关市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 67,
                "name": "金昌",
                "sub": [
                    {
                        "id": 634,
                        "name": "金川区",
                        "sub": []
                    },
                    {
                        "id": 635,
                        "name": "永昌县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 68,
                "name": "酒泉",
                "sub": [
                    {
                        "id": 636,
                        "name": "肃州区",
                        "sub": []
                    },
                    {
                        "id": 637,
                        "name": "玉门市",
                        "sub": []
                    },
                    {
                        "id": 638,
                        "name": "敦煌市",
                        "sub": []
                    },
                    {
                        "id": 639,
                        "name": "金塔县",
                        "sub": []
                    },
                    {
                        "id": 640,
                        "name": "瓜州县",
                        "sub": []
                    },
                    {
                        "id": 641,
                        "name": "肃北",
                        "sub": []
                    },
                    {
                        "id": 642,
                        "name": "阿克塞",
                        "sub": []
                    }
                ]
            },
            {
                "id": 69,
                "name": "临夏",
                "sub": [
                    {
                        "id": 643,
                        "name": "临夏市",
                        "sub": []
                    },
                    {
                        "id": 644,
                        "name": "临夏县",
                        "sub": []
                    },
                    {
                        "id": 645,
                        "name": "康乐县",
                        "sub": []
                    },
                    {
                        "id": 646,
                        "name": "永靖县",
                        "sub": []
                    },
                    {
                        "id": 647,
                        "name": "广河县",
                        "sub": []
                    },
                    {
                        "id": 648,
                        "name": "和政县",
                        "sub": []
                    },
                    {
                        "id": 649,
                        "name": "东乡族自治县",
                        "sub": []
                    },
                    {
                        "id": 650,
                        "name": "积石山",
                        "sub": []
                    }
                ]
            },
            {
                "id": 70,
                "name": "陇南",
                "sub": [
                    {
                        "id": 651,
                        "name": "成县",
                        "sub": []
                    },
                    {
                        "id": 652,
                        "name": "徽县",
                        "sub": []
                    },
                    {
                        "id": 653,
                        "name": "康县",
                        "sub": []
                    },
                    {
                        "id": 654,
                        "name": "礼县",
                        "sub": []
                    },
                    {
                        "id": 655,
                        "name": "两当县",
                        "sub": []
                    },
                    {
                        "id": 656,
                        "name": "文县",
                        "sub": []
                    },
                    {
                        "id": 657,
                        "name": "西和县",
                        "sub": []
                    },
                    {
                        "id": 658,
                        "name": "宕昌县",
                        "sub": []
                    },
                    {
                        "id": 659,
                        "name": "武都区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 71,
                "name": "平凉",
                "sub": [
                    {
                        "id": 660,
                        "name": "崇信县",
                        "sub": []
                    },
                    {
                        "id": 661,
                        "name": "华亭县",
                        "sub": []
                    },
                    {
                        "id": 662,
                        "name": "静宁县",
                        "sub": []
                    },
                    {
                        "id": 663,
                        "name": "灵台县",
                        "sub": []
                    },
                    {
                        "id": 664,
                        "name": "崆峒区",
                        "sub": []
                    },
                    {
                        "id": 665,
                        "name": "庄浪县",
                        "sub": []
                    },
                    {
                        "id": 666,
                        "name": "泾川县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 72,
                "name": "庆阳",
                "sub": [
                    {
                        "id": 667,
                        "name": "合水县",
                        "sub": []
                    },
                    {
                        "id": 668,
                        "name": "华池县",
                        "sub": []
                    },
                    {
                        "id": 669,
                        "name": "环县",
                        "sub": []
                    },
                    {
                        "id": 670,
                        "name": "宁县",
                        "sub": []
                    },
                    {
                        "id": 671,
                        "name": "庆城县",
                        "sub": []
                    },
                    {
                        "id": 672,
                        "name": "西峰区",
                        "sub": []
                    },
                    {
                        "id": 673,
                        "name": "镇原县",
                        "sub": []
                    },
                    {
                        "id": 674,
                        "name": "正宁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 73,
                "name": "天水",
                "sub": [
                    {
                        "id": 675,
                        "name": "甘谷县",
                        "sub": []
                    },
                    {
                        "id": 676,
                        "name": "秦安县",
                        "sub": []
                    },
                    {
                        "id": 677,
                        "name": "清水县",
                        "sub": []
                    },
                    {
                        "id": 678,
                        "name": "秦州区",
                        "sub": []
                    },
                    {
                        "id": 679,
                        "name": "麦积区",
                        "sub": []
                    },
                    {
                        "id": 680,
                        "name": "武山县",
                        "sub": []
                    },
                    {
                        "id": 681,
                        "name": "张家川",
                        "sub": []
                    }
                ]
            },
            {
                "id": 74,
                "name": "武威",
                "sub": [
                    {
                        "id": 682,
                        "name": "古浪县",
                        "sub": []
                    },
                    {
                        "id": 683,
                        "name": "民勤县",
                        "sub": []
                    },
                    {
                        "id": 684,
                        "name": "天祝",
                        "sub": []
                    },
                    {
                        "id": 685,
                        "name": "凉州区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 75,
                "name": "张掖",
                "sub": [
                    {
                        "id": 686,
                        "name": "高台县",
                        "sub": []
                    },
                    {
                        "id": 687,
                        "name": "临泽县",
                        "sub": []
                    },
                    {
                        "id": 688,
                        "name": "民乐县",
                        "sub": []
                    },
                    {
                        "id": 689,
                        "name": "山丹县",
                        "sub": []
                    },
                    {
                        "id": 690,
                        "name": "肃南",
                        "sub": []
                    },
                    {
                        "id": 691,
                        "name": "甘州区",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 6,
        "name": "广东",
        "sub": [
            {
                "id": 76,
                "name": "广州",
                "sub": [
                    {
                        "id": 692,
                        "name": "从化市",
                        "sub": []
                    },
                    {
                        "id": 693,
                        "name": "天河区",
                        "sub": []
                    },
                    {
                        "id": 694,
                        "name": "东山区",
                        "sub": []
                    },
                    {
                        "id": 695,
                        "name": "白云区",
                        "sub": []
                    },
                    {
                        "id": 696,
                        "name": "海珠区",
                        "sub": []
                    },
                    {
                        "id": 697,
                        "name": "荔湾区",
                        "sub": []
                    },
                    {
                        "id": 698,
                        "name": "越秀区",
                        "sub": []
                    },
                    {
                        "id": 699,
                        "name": "黄埔区",
                        "sub": []
                    },
                    {
                        "id": 700,
                        "name": "番禺区",
                        "sub": []
                    },
                    {
                        "id": 701,
                        "name": "花都区",
                        "sub": []
                    },
                    {
                        "id": 702,
                        "name": "增城区",
                        "sub": []
                    },
                    {
                        "id": 703,
                        "name": "从化区",
                        "sub": []
                    },
                    {
                        "id": 704,
                        "name": "市郊",
                        "sub": []
                    }
                ]
            },
            {
                "id": 77,
                "name": "深圳",
                "sub": [
                    {
                        "id": 705,
                        "name": "福田区",
                        "sub": []
                    },
                    {
                        "id": 706,
                        "name": "罗湖区",
                        "sub": []
                    },
                    {
                        "id": 707,
                        "name": "南山区",
                        "sub": []
                    },
                    {
                        "id": 708,
                        "name": "宝安区",
                        "sub": []
                    },
                    {
                        "id": 709,
                        "name": "龙岗区",
                        "sub": []
                    },
                    {
                        "id": 710,
                        "name": "盐田区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 78,
                "name": "潮州",
                "sub": [
                    {
                        "id": 711,
                        "name": "湘桥区",
                        "sub": []
                    },
                    {
                        "id": 712,
                        "name": "潮安县",
                        "sub": []
                    },
                    {
                        "id": 713,
                        "name": "饶平县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 79,
                "name": "东莞",
                "sub": [
                    {
                        "id": 714,
                        "name": "南城区",
                        "sub": []
                    },
                    {
                        "id": 715,
                        "name": "东城区",
                        "sub": []
                    },
                    {
                        "id": 716,
                        "name": "万江区",
                        "sub": []
                    },
                    {
                        "id": 717,
                        "name": "莞城区",
                        "sub": []
                    },
                    {
                        "id": 718,
                        "name": "石龙镇",
                        "sub": []
                    },
                    {
                        "id": 719,
                        "name": "虎门镇",
                        "sub": []
                    },
                    {
                        "id": 720,
                        "name": "麻涌镇",
                        "sub": []
                    },
                    {
                        "id": 721,
                        "name": "道滘镇",
                        "sub": []
                    },
                    {
                        "id": 722,
                        "name": "石碣镇",
                        "sub": []
                    },
                    {
                        "id": 723,
                        "name": "沙田镇",
                        "sub": []
                    },
                    {
                        "id": 724,
                        "name": "望牛墩镇",
                        "sub": []
                    },
                    {
                        "id": 725,
                        "name": "洪梅镇",
                        "sub": []
                    },
                    {
                        "id": 726,
                        "name": "茶山镇",
                        "sub": []
                    },
                    {
                        "id": 727,
                        "name": "寮步镇",
                        "sub": []
                    },
                    {
                        "id": 728,
                        "name": "大岭山镇",
                        "sub": []
                    },
                    {
                        "id": 729,
                        "name": "大朗镇",
                        "sub": []
                    },
                    {
                        "id": 730,
                        "name": "黄江镇",
                        "sub": []
                    },
                    {
                        "id": 731,
                        "name": "樟木头",
                        "sub": []
                    },
                    {
                        "id": 732,
                        "name": "凤岗镇",
                        "sub": []
                    },
                    {
                        "id": 733,
                        "name": "塘厦镇",
                        "sub": []
                    },
                    {
                        "id": 734,
                        "name": "谢岗镇",
                        "sub": []
                    },
                    {
                        "id": 735,
                        "name": "厚街镇",
                        "sub": []
                    },
                    {
                        "id": 736,
                        "name": "清溪镇",
                        "sub": []
                    },
                    {
                        "id": 737,
                        "name": "常平镇",
                        "sub": []
                    },
                    {
                        "id": 738,
                        "name": "桥头镇",
                        "sub": []
                    },
                    {
                        "id": 739,
                        "name": "横沥镇",
                        "sub": []
                    },
                    {
                        "id": 740,
                        "name": "东坑镇",
                        "sub": []
                    },
                    {
                        "id": 741,
                        "name": "企石镇",
                        "sub": []
                    },
                    {
                        "id": 742,
                        "name": "石排镇",
                        "sub": []
                    },
                    {
                        "id": 743,
                        "name": "长安镇",
                        "sub": []
                    },
                    {
                        "id": 744,
                        "name": "中堂镇",
                        "sub": []
                    },
                    {
                        "id": 745,
                        "name": "高埗镇",
                        "sub": []
                    }
                ]
            },
            {
                "id": 80,
                "name": "佛山",
                "sub": [
                    {
                        "id": 746,
                        "name": "禅城区",
                        "sub": []
                    },
                    {
                        "id": 747,
                        "name": "南海区",
                        "sub": []
                    },
                    {
                        "id": 748,
                        "name": "顺德区",
                        "sub": []
                    },
                    {
                        "id": 749,
                        "name": "三水区",
                        "sub": []
                    },
                    {
                        "id": 750,
                        "name": "高明区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 81,
                "name": "河源",
                "sub": [
                    {
                        "id": 751,
                        "name": "东源县",
                        "sub": []
                    },
                    {
                        "id": 752,
                        "name": "和平县",
                        "sub": []
                    },
                    {
                        "id": 753,
                        "name": "源城区",
                        "sub": []
                    },
                    {
                        "id": 754,
                        "name": "连平县",
                        "sub": []
                    },
                    {
                        "id": 755,
                        "name": "龙川县",
                        "sub": []
                    },
                    {
                        "id": 756,
                        "name": "紫金县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 82,
                "name": "惠州",
                "sub": [
                    {
                        "id": 757,
                        "name": "惠阳区",
                        "sub": []
                    },
                    {
                        "id": 758,
                        "name": "惠城区",
                        "sub": []
                    },
                    {
                        "id": 759,
                        "name": "大亚湾",
                        "sub": []
                    },
                    {
                        "id": 760,
                        "name": "博罗县",
                        "sub": []
                    },
                    {
                        "id": 761,
                        "name": "惠东县",
                        "sub": []
                    },
                    {
                        "id": 762,
                        "name": "龙门县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 83,
                "name": "江门",
                "sub": [
                    {
                        "id": 763,
                        "name": "江海区",
                        "sub": []
                    },
                    {
                        "id": 764,
                        "name": "蓬江区",
                        "sub": []
                    },
                    {
                        "id": 765,
                        "name": "新会区",
                        "sub": []
                    },
                    {
                        "id": 766,
                        "name": "台山市",
                        "sub": []
                    },
                    {
                        "id": 767,
                        "name": "开平市",
                        "sub": []
                    },
                    {
                        "id": 768,
                        "name": "鹤山市",
                        "sub": []
                    },
                    {
                        "id": 769,
                        "name": "恩平市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 84,
                "name": "揭阳",
                "sub": [
                    {
                        "id": 770,
                        "name": "榕城区",
                        "sub": []
                    },
                    {
                        "id": 771,
                        "name": "普宁市",
                        "sub": []
                    },
                    {
                        "id": 772,
                        "name": "揭东县",
                        "sub": []
                    },
                    {
                        "id": 773,
                        "name": "揭西县",
                        "sub": []
                    },
                    {
                        "id": 774,
                        "name": "惠来县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 85,
                "name": "茂名",
                "sub": [
                    {
                        "id": 775,
                        "name": "茂南区",
                        "sub": []
                    },
                    {
                        "id": 776,
                        "name": "茂港区",
                        "sub": []
                    },
                    {
                        "id": 777,
                        "name": "高州市",
                        "sub": []
                    },
                    {
                        "id": 778,
                        "name": "化州市",
                        "sub": []
                    },
                    {
                        "id": 779,
                        "name": "信宜市",
                        "sub": []
                    },
                    {
                        "id": 780,
                        "name": "电白县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 86,
                "name": "梅州",
                "sub": [
                    {
                        "id": 781,
                        "name": "梅县",
                        "sub": []
                    },
                    {
                        "id": 782,
                        "name": "梅江区",
                        "sub": []
                    },
                    {
                        "id": 783,
                        "name": "兴宁市",
                        "sub": []
                    },
                    {
                        "id": 784,
                        "name": "大埔县",
                        "sub": []
                    },
                    {
                        "id": 785,
                        "name": "丰顺县",
                        "sub": []
                    },
                    {
                        "id": 786,
                        "name": "五华县",
                        "sub": []
                    },
                    {
                        "id": 787,
                        "name": "平远县",
                        "sub": []
                    },
                    {
                        "id": 788,
                        "name": "蕉岭县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 87,
                "name": "清远",
                "sub": [
                    {
                        "id": 789,
                        "name": "清城区",
                        "sub": []
                    },
                    {
                        "id": 790,
                        "name": "英德市",
                        "sub": []
                    },
                    {
                        "id": 791,
                        "name": "连州市",
                        "sub": []
                    },
                    {
                        "id": 792,
                        "name": "佛冈县",
                        "sub": []
                    },
                    {
                        "id": 793,
                        "name": "阳山县",
                        "sub": []
                    },
                    {
                        "id": 794,
                        "name": "清新县",
                        "sub": []
                    },
                    {
                        "id": 795,
                        "name": "连山",
                        "sub": []
                    },
                    {
                        "id": 796,
                        "name": "连南",
                        "sub": []
                    }
                ]
            },
            {
                "id": 88,
                "name": "汕头",
                "sub": [
                    {
                        "id": 797,
                        "name": "南澳县",
                        "sub": []
                    },
                    {
                        "id": 798,
                        "name": "潮阳区",
                        "sub": []
                    },
                    {
                        "id": 799,
                        "name": "澄海区",
                        "sub": []
                    },
                    {
                        "id": 800,
                        "name": "龙湖区",
                        "sub": []
                    },
                    {
                        "id": 801,
                        "name": "金平区",
                        "sub": []
                    },
                    {
                        "id": 802,
                        "name": "濠江区",
                        "sub": []
                    },
                    {
                        "id": 803,
                        "name": "潮南区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 89,
                "name": "汕尾",
                "sub": [
                    {
                        "id": 804,
                        "name": "城区",
                        "sub": []
                    },
                    {
                        "id": 805,
                        "name": "陆丰市",
                        "sub": []
                    },
                    {
                        "id": 806,
                        "name": "海丰县",
                        "sub": []
                    },
                    {
                        "id": 807,
                        "name": "陆河县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 90,
                "name": "韶关",
                "sub": [
                    {
                        "id": 808,
                        "name": "曲江县",
                        "sub": []
                    },
                    {
                        "id": 809,
                        "name": "浈江区",
                        "sub": []
                    },
                    {
                        "id": 810,
                        "name": "武江区",
                        "sub": []
                    },
                    {
                        "id": 811,
                        "name": "曲江区",
                        "sub": []
                    },
                    {
                        "id": 812,
                        "name": "乐昌市",
                        "sub": []
                    },
                    {
                        "id": 813,
                        "name": "南雄市",
                        "sub": []
                    },
                    {
                        "id": 814,
                        "name": "始兴县",
                        "sub": []
                    },
                    {
                        "id": 815,
                        "name": "仁化县",
                        "sub": []
                    },
                    {
                        "id": 816,
                        "name": "翁源县",
                        "sub": []
                    },
                    {
                        "id": 817,
                        "name": "新丰县",
                        "sub": []
                    },
                    {
                        "id": 818,
                        "name": "乳源",
                        "sub": []
                    }
                ]
            },
            {
                "id": 91,
                "name": "阳江",
                "sub": [
                    {
                        "id": 819,
                        "name": "江城区",
                        "sub": []
                    },
                    {
                        "id": 820,
                        "name": "阳春市",
                        "sub": []
                    },
                    {
                        "id": 821,
                        "name": "阳西县",
                        "sub": []
                    },
                    {
                        "id": 822,
                        "name": "阳东县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 92,
                "name": "云浮",
                "sub": [
                    {
                        "id": 823,
                        "name": "云城区",
                        "sub": []
                    },
                    {
                        "id": 824,
                        "name": "罗定市",
                        "sub": []
                    },
                    {
                        "id": 825,
                        "name": "新兴县",
                        "sub": []
                    },
                    {
                        "id": 826,
                        "name": "郁南县",
                        "sub": []
                    },
                    {
                        "id": 827,
                        "name": "云安县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 93,
                "name": "湛江",
                "sub": [
                    {
                        "id": 828,
                        "name": "赤坎区",
                        "sub": []
                    },
                    {
                        "id": 829,
                        "name": "霞山区",
                        "sub": []
                    },
                    {
                        "id": 830,
                        "name": "坡头区",
                        "sub": []
                    },
                    {
                        "id": 831,
                        "name": "麻章区",
                        "sub": []
                    },
                    {
                        "id": 832,
                        "name": "廉江市",
                        "sub": []
                    },
                    {
                        "id": 833,
                        "name": "雷州市",
                        "sub": []
                    },
                    {
                        "id": 834,
                        "name": "吴川市",
                        "sub": []
                    },
                    {
                        "id": 835,
                        "name": "遂溪县",
                        "sub": []
                    },
                    {
                        "id": 836,
                        "name": "徐闻县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 94,
                "name": "肇庆",
                "sub": [
                    {
                        "id": 837,
                        "name": "肇庆市",
                        "sub": []
                    },
                    {
                        "id": 838,
                        "name": "高要市",
                        "sub": []
                    },
                    {
                        "id": 839,
                        "name": "四会市",
                        "sub": []
                    },
                    {
                        "id": 840,
                        "name": "广宁县",
                        "sub": []
                    },
                    {
                        "id": 841,
                        "name": "怀集县",
                        "sub": []
                    },
                    {
                        "id": 842,
                        "name": "封开县",
                        "sub": []
                    },
                    {
                        "id": 843,
                        "name": "德庆县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 95,
                "name": "中山",
                "sub": [
                    {
                        "id": 844,
                        "name": "石岐街道",
                        "sub": []
                    },
                    {
                        "id": 845,
                        "name": "东区街道",
                        "sub": []
                    },
                    {
                        "id": 846,
                        "name": "西区街道",
                        "sub": []
                    },
                    {
                        "id": 847,
                        "name": "环城街道",
                        "sub": []
                    },
                    {
                        "id": 848,
                        "name": "中山港街道",
                        "sub": []
                    },
                    {
                        "id": 849,
                        "name": "五桂山街道",
                        "sub": []
                    }
                ]
            },
            {
                "id": 96,
                "name": "珠海",
                "sub": [
                    {
                        "id": 850,
                        "name": "香洲区",
                        "sub": []
                    },
                    {
                        "id": 851,
                        "name": "斗门区",
                        "sub": []
                    },
                    {
                        "id": 852,
                        "name": "金湾区",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 7,
        "name": "广西",
        "sub": [
            {
                "id": 97,
                "name": "南宁",
                "sub": [
                    {
                        "id": 853,
                        "name": "邕宁区",
                        "sub": []
                    },
                    {
                        "id": 854,
                        "name": "青秀区",
                        "sub": []
                    },
                    {
                        "id": 855,
                        "name": "兴宁区",
                        "sub": []
                    },
                    {
                        "id": 856,
                        "name": "良庆区",
                        "sub": []
                    },
                    {
                        "id": 857,
                        "name": "西乡塘区",
                        "sub": []
                    },
                    {
                        "id": 858,
                        "name": "江南区",
                        "sub": []
                    },
                    {
                        "id": 859,
                        "name": "武鸣县",
                        "sub": []
                    },
                    {
                        "id": 860,
                        "name": "隆安县",
                        "sub": []
                    },
                    {
                        "id": 861,
                        "name": "马山县",
                        "sub": []
                    },
                    {
                        "id": 862,
                        "name": "上林县",
                        "sub": []
                    },
                    {
                        "id": 863,
                        "name": "宾阳县",
                        "sub": []
                    },
                    {
                        "id": 864,
                        "name": "横县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 98,
                "name": "桂林",
                "sub": [
                    {
                        "id": 865,
                        "name": "秀峰区",
                        "sub": []
                    },
                    {
                        "id": 866,
                        "name": "叠彩区",
                        "sub": []
                    },
                    {
                        "id": 867,
                        "name": "象山区",
                        "sub": []
                    },
                    {
                        "id": 868,
                        "name": "七星区",
                        "sub": []
                    },
                    {
                        "id": 869,
                        "name": "雁山区",
                        "sub": []
                    },
                    {
                        "id": 870,
                        "name": "阳朔县",
                        "sub": []
                    },
                    {
                        "id": 871,
                        "name": "临桂县",
                        "sub": []
                    },
                    {
                        "id": 872,
                        "name": "灵川县",
                        "sub": []
                    },
                    {
                        "id": 873,
                        "name": "全州县",
                        "sub": []
                    },
                    {
                        "id": 874,
                        "name": "平乐县",
                        "sub": []
                    },
                    {
                        "id": 875,
                        "name": "兴安县",
                        "sub": []
                    },
                    {
                        "id": 876,
                        "name": "灌阳县",
                        "sub": []
                    },
                    {
                        "id": 877,
                        "name": "荔浦县",
                        "sub": []
                    },
                    {
                        "id": 878,
                        "name": "资源县",
                        "sub": []
                    },
                    {
                        "id": 879,
                        "name": "永福县",
                        "sub": []
                    },
                    {
                        "id": 880,
                        "name": "龙胜",
                        "sub": []
                    },
                    {
                        "id": 881,
                        "name": "恭城",
                        "sub": []
                    }
                ]
            },
            {
                "id": 99,
                "name": "百色",
                "sub": [
                    {
                        "id": 882,
                        "name": "右江区",
                        "sub": []
                    },
                    {
                        "id": 883,
                        "name": "凌云县",
                        "sub": []
                    },
                    {
                        "id": 884,
                        "name": "平果县",
                        "sub": []
                    },
                    {
                        "id": 885,
                        "name": "西林县",
                        "sub": []
                    },
                    {
                        "id": 886,
                        "name": "乐业县",
                        "sub": []
                    },
                    {
                        "id": 887,
                        "name": "德保县",
                        "sub": []
                    },
                    {
                        "id": 888,
                        "name": "田林县",
                        "sub": []
                    },
                    {
                        "id": 889,
                        "name": "田阳县",
                        "sub": []
                    },
                    {
                        "id": 890,
                        "name": "靖西县",
                        "sub": []
                    },
                    {
                        "id": 891,
                        "name": "田东县",
                        "sub": []
                    },
                    {
                        "id": 892,
                        "name": "那坡县",
                        "sub": []
                    },
                    {
                        "id": 893,
                        "name": "隆林",
                        "sub": []
                    }
                ]
            },
            {
                "id": 100,
                "name": "北海",
                "sub": [
                    {
                        "id": 894,
                        "name": "海城区",
                        "sub": []
                    },
                    {
                        "id": 895,
                        "name": "银海区",
                        "sub": []
                    },
                    {
                        "id": 896,
                        "name": "铁山港区",
                        "sub": []
                    },
                    {
                        "id": 897,
                        "name": "合浦县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 101,
                "name": "崇左",
                "sub": [
                    {
                        "id": 898,
                        "name": "江州区",
                        "sub": []
                    },
                    {
                        "id": 899,
                        "name": "凭祥市",
                        "sub": []
                    },
                    {
                        "id": 900,
                        "name": "宁明县",
                        "sub": []
                    },
                    {
                        "id": 901,
                        "name": "扶绥县",
                        "sub": []
                    },
                    {
                        "id": 902,
                        "name": "龙州县",
                        "sub": []
                    },
                    {
                        "id": 903,
                        "name": "大新县",
                        "sub": []
                    },
                    {
                        "id": 904,
                        "name": "天等县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 102,
                "name": "防城港",
                "sub": [
                    {
                        "id": 905,
                        "name": "港口区",
                        "sub": []
                    },
                    {
                        "id": 906,
                        "name": "防城区",
                        "sub": []
                    },
                    {
                        "id": 907,
                        "name": "东兴市",
                        "sub": []
                    },
                    {
                        "id": 908,
                        "name": "上思县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 103,
                "name": "贵港",
                "sub": [
                    {
                        "id": 909,
                        "name": "港北区",
                        "sub": []
                    },
                    {
                        "id": 910,
                        "name": "港南区",
                        "sub": []
                    },
                    {
                        "id": 911,
                        "name": "覃塘区",
                        "sub": []
                    },
                    {
                        "id": 912,
                        "name": "桂平市",
                        "sub": []
                    },
                    {
                        "id": 913,
                        "name": "平南县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 104,
                "name": "河池",
                "sub": [
                    {
                        "id": 914,
                        "name": "金城江区",
                        "sub": []
                    },
                    {
                        "id": 915,
                        "name": "宜州市",
                        "sub": []
                    },
                    {
                        "id": 916,
                        "name": "天峨县",
                        "sub": []
                    },
                    {
                        "id": 917,
                        "name": "凤山县",
                        "sub": []
                    },
                    {
                        "id": 918,
                        "name": "南丹县",
                        "sub": []
                    },
                    {
                        "id": 919,
                        "name": "东兰县",
                        "sub": []
                    },
                    {
                        "id": 920,
                        "name": "都安",
                        "sub": []
                    },
                    {
                        "id": 921,
                        "name": "罗城",
                        "sub": []
                    },
                    {
                        "id": 922,
                        "name": "巴马",
                        "sub": []
                    },
                    {
                        "id": 923,
                        "name": "环江",
                        "sub": []
                    },
                    {
                        "id": 924,
                        "name": "大化",
                        "sub": []
                    }
                ]
            },
            {
                "id": 105,
                "name": "贺州",
                "sub": [
                    {
                        "id": 925,
                        "name": "八步区",
                        "sub": []
                    },
                    {
                        "id": 926,
                        "name": "钟山县",
                        "sub": []
                    },
                    {
                        "id": 927,
                        "name": "昭平县",
                        "sub": []
                    },
                    {
                        "id": 928,
                        "name": "富川",
                        "sub": []
                    }
                ]
            },
            {
                "id": 106,
                "name": "来宾",
                "sub": [
                    {
                        "id": 929,
                        "name": "兴宾区",
                        "sub": []
                    },
                    {
                        "id": 930,
                        "name": "合山市",
                        "sub": []
                    },
                    {
                        "id": 931,
                        "name": "象州县",
                        "sub": []
                    },
                    {
                        "id": 932,
                        "name": "武宣县",
                        "sub": []
                    },
                    {
                        "id": 933,
                        "name": "忻城县",
                        "sub": []
                    },
                    {
                        "id": 934,
                        "name": "金秀",
                        "sub": []
                    }
                ]
            },
            {
                "id": 107,
                "name": "柳州",
                "sub": [
                    {
                        "id": 935,
                        "name": "城中区",
                        "sub": []
                    },
                    {
                        "id": 936,
                        "name": "鱼峰区",
                        "sub": []
                    },
                    {
                        "id": 937,
                        "name": "柳北区",
                        "sub": []
                    },
                    {
                        "id": 938,
                        "name": "柳南区",
                        "sub": []
                    },
                    {
                        "id": 939,
                        "name": "柳江县",
                        "sub": []
                    },
                    {
                        "id": 940,
                        "name": "柳城县",
                        "sub": []
                    },
                    {
                        "id": 941,
                        "name": "鹿寨县",
                        "sub": []
                    },
                    {
                        "id": 942,
                        "name": "融安县",
                        "sub": []
                    },
                    {
                        "id": 943,
                        "name": "融水",
                        "sub": []
                    },
                    {
                        "id": 944,
                        "name": "三江",
                        "sub": []
                    }
                ]
            },
            {
                "id": 108,
                "name": "钦州",
                "sub": [
                    {
                        "id": 945,
                        "name": "钦南区",
                        "sub": []
                    },
                    {
                        "id": 946,
                        "name": "钦北区",
                        "sub": []
                    },
                    {
                        "id": 947,
                        "name": "灵山县",
                        "sub": []
                    },
                    {
                        "id": 948,
                        "name": "浦北县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 109,
                "name": "梧州",
                "sub": [
                    {
                        "id": 949,
                        "name": "万秀区",
                        "sub": []
                    },
                    {
                        "id": 950,
                        "name": "蝶山区",
                        "sub": []
                    },
                    {
                        "id": 951,
                        "name": "长洲区",
                        "sub": []
                    },
                    {
                        "id": 952,
                        "name": "岑溪市",
                        "sub": []
                    },
                    {
                        "id": 953,
                        "name": "苍梧县",
                        "sub": []
                    },
                    {
                        "id": 954,
                        "name": "藤县",
                        "sub": []
                    },
                    {
                        "id": 955,
                        "name": "蒙山县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 110,
                "name": "玉林",
                "sub": [
                    {
                        "id": 956,
                        "name": "玉州区",
                        "sub": []
                    },
                    {
                        "id": 957,
                        "name": "北流市",
                        "sub": []
                    },
                    {
                        "id": 958,
                        "name": "容县",
                        "sub": []
                    },
                    {
                        "id": 959,
                        "name": "陆川县",
                        "sub": []
                    },
                    {
                        "id": 960,
                        "name": "博白县",
                        "sub": []
                    },
                    {
                        "id": 961,
                        "name": "兴业县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 8,
        "name": "贵州",
        "sub": [
            {
                "id": 111,
                "name": "贵阳",
                "sub": [
                    {
                        "id": 962,
                        "name": "南明区",
                        "sub": []
                    },
                    {
                        "id": 963,
                        "name": "云岩区",
                        "sub": []
                    },
                    {
                        "id": 964,
                        "name": "花溪区",
                        "sub": []
                    },
                    {
                        "id": 965,
                        "name": "乌当区",
                        "sub": []
                    },
                    {
                        "id": 966,
                        "name": "白云区",
                        "sub": []
                    },
                    {
                        "id": 967,
                        "name": "小河区",
                        "sub": []
                    },
                    {
                        "id": 968,
                        "name": "金阳新区",
                        "sub": []
                    },
                    {
                        "id": 969,
                        "name": "新天园区",
                        "sub": []
                    },
                    {
                        "id": 970,
                        "name": "清镇市",
                        "sub": []
                    },
                    {
                        "id": 971,
                        "name": "开阳县",
                        "sub": []
                    },
                    {
                        "id": 972,
                        "name": "修文县",
                        "sub": []
                    },
                    {
                        "id": 973,
                        "name": "息烽县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 112,
                "name": "安顺",
                "sub": [
                    {
                        "id": 974,
                        "name": "西秀区",
                        "sub": []
                    },
                    {
                        "id": 975,
                        "name": "关岭",
                        "sub": []
                    },
                    {
                        "id": 976,
                        "name": "镇宁",
                        "sub": []
                    },
                    {
                        "id": 977,
                        "name": "紫云",
                        "sub": []
                    },
                    {
                        "id": 978,
                        "name": "平坝县",
                        "sub": []
                    },
                    {
                        "id": 979,
                        "name": "普定县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 113,
                "name": "毕节",
                "sub": [
                    {
                        "id": 980,
                        "name": "毕节市",
                        "sub": []
                    },
                    {
                        "id": 981,
                        "name": "大方县",
                        "sub": []
                    },
                    {
                        "id": 982,
                        "name": "黔西县",
                        "sub": []
                    },
                    {
                        "id": 983,
                        "name": "金沙县",
                        "sub": []
                    },
                    {
                        "id": 984,
                        "name": "织金县",
                        "sub": []
                    },
                    {
                        "id": 985,
                        "name": "纳雍县",
                        "sub": []
                    },
                    {
                        "id": 986,
                        "name": "赫章县",
                        "sub": []
                    },
                    {
                        "id": 987,
                        "name": "威宁",
                        "sub": []
                    }
                ]
            },
            {
                "id": 114,
                "name": "六盘水",
                "sub": [
                    {
                        "id": 988,
                        "name": "钟山区",
                        "sub": []
                    },
                    {
                        "id": 989,
                        "name": "六枝特区",
                        "sub": []
                    },
                    {
                        "id": 990,
                        "name": "水城县",
                        "sub": []
                    },
                    {
                        "id": 991,
                        "name": "盘县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 115,
                "name": "黔东南",
                "sub": [
                    {
                        "id": 992,
                        "name": "凯里市",
                        "sub": []
                    },
                    {
                        "id": 993,
                        "name": "黄平县",
                        "sub": []
                    },
                    {
                        "id": 994,
                        "name": "施秉县",
                        "sub": []
                    },
                    {
                        "id": 995,
                        "name": "三穗县",
                        "sub": []
                    },
                    {
                        "id": 996,
                        "name": "镇远县",
                        "sub": []
                    },
                    {
                        "id": 997,
                        "name": "岑巩县",
                        "sub": []
                    },
                    {
                        "id": 998,
                        "name": "天柱县",
                        "sub": []
                    },
                    {
                        "id": 999,
                        "name": "锦屏县",
                        "sub": []
                    },
                    {
                        "id": 1000,
                        "name": "剑河县",
                        "sub": []
                    },
                    {
                        "id": 1001,
                        "name": "台江县",
                        "sub": []
                    },
                    {
                        "id": 1002,
                        "name": "黎平县",
                        "sub": []
                    },
                    {
                        "id": 1003,
                        "name": "榕江县",
                        "sub": []
                    },
                    {
                        "id": 1004,
                        "name": "从江县",
                        "sub": []
                    },
                    {
                        "id": 1005,
                        "name": "雷山县",
                        "sub": []
                    },
                    {
                        "id": 1006,
                        "name": "麻江县",
                        "sub": []
                    },
                    {
                        "id": 1007,
                        "name": "丹寨县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 116,
                "name": "黔南",
                "sub": [
                    {
                        "id": 1008,
                        "name": "都匀市",
                        "sub": []
                    },
                    {
                        "id": 1009,
                        "name": "福泉市",
                        "sub": []
                    },
                    {
                        "id": 1010,
                        "name": "荔波县",
                        "sub": []
                    },
                    {
                        "id": 1011,
                        "name": "贵定县",
                        "sub": []
                    },
                    {
                        "id": 1012,
                        "name": "瓮安县",
                        "sub": []
                    },
                    {
                        "id": 1013,
                        "name": "独山县",
                        "sub": []
                    },
                    {
                        "id": 1014,
                        "name": "平塘县",
                        "sub": []
                    },
                    {
                        "id": 1015,
                        "name": "罗甸县",
                        "sub": []
                    },
                    {
                        "id": 1016,
                        "name": "长顺县",
                        "sub": []
                    },
                    {
                        "id": 1017,
                        "name": "龙里县",
                        "sub": []
                    },
                    {
                        "id": 1018,
                        "name": "惠水县",
                        "sub": []
                    },
                    {
                        "id": 1019,
                        "name": "三都",
                        "sub": []
                    }
                ]
            },
            {
                "id": 117,
                "name": "黔西南",
                "sub": [
                    {
                        "id": 1020,
                        "name": "兴义市",
                        "sub": []
                    },
                    {
                        "id": 1021,
                        "name": "兴仁县",
                        "sub": []
                    },
                    {
                        "id": 1022,
                        "name": "普安县",
                        "sub": []
                    },
                    {
                        "id": 1023,
                        "name": "晴隆县",
                        "sub": []
                    },
                    {
                        "id": 1024,
                        "name": "贞丰县",
                        "sub": []
                    },
                    {
                        "id": 1025,
                        "name": "望谟县",
                        "sub": []
                    },
                    {
                        "id": 1026,
                        "name": "册亨县",
                        "sub": []
                    },
                    {
                        "id": 1027,
                        "name": "安龙县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 118,
                "name": "铜仁",
                "sub": [
                    {
                        "id": 1028,
                        "name": "铜仁市",
                        "sub": []
                    },
                    {
                        "id": 1029,
                        "name": "江口县",
                        "sub": []
                    },
                    {
                        "id": 1030,
                        "name": "石阡县",
                        "sub": []
                    },
                    {
                        "id": 1031,
                        "name": "思南县",
                        "sub": []
                    },
                    {
                        "id": 1032,
                        "name": "德江县",
                        "sub": []
                    },
                    {
                        "id": 1033,
                        "name": "玉屏",
                        "sub": []
                    },
                    {
                        "id": 1034,
                        "name": "印江",
                        "sub": []
                    },
                    {
                        "id": 1035,
                        "name": "沿河",
                        "sub": []
                    },
                    {
                        "id": 1036,
                        "name": "松桃",
                        "sub": []
                    },
                    {
                        "id": 1037,
                        "name": "万山特区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 119,
                "name": "遵义",
                "sub": [
                    {
                        "id": 1038,
                        "name": "红花岗区",
                        "sub": []
                    },
                    {
                        "id": 1039,
                        "name": "务川县",
                        "sub": []
                    },
                    {
                        "id": 1040,
                        "name": "道真县",
                        "sub": []
                    },
                    {
                        "id": 1041,
                        "name": "汇川区",
                        "sub": []
                    },
                    {
                        "id": 1042,
                        "name": "赤水市",
                        "sub": []
                    },
                    {
                        "id": 1043,
                        "name": "仁怀市",
                        "sub": []
                    },
                    {
                        "id": 1044,
                        "name": "遵义县",
                        "sub": []
                    },
                    {
                        "id": 1045,
                        "name": "桐梓县",
                        "sub": []
                    },
                    {
                        "id": 1046,
                        "name": "绥阳县",
                        "sub": []
                    },
                    {
                        "id": 1047,
                        "name": "正安县",
                        "sub": []
                    },
                    {
                        "id": 1048,
                        "name": "凤冈县",
                        "sub": []
                    },
                    {
                        "id": 1049,
                        "name": "湄潭县",
                        "sub": []
                    },
                    {
                        "id": 1050,
                        "name": "余庆县",
                        "sub": []
                    },
                    {
                        "id": 1051,
                        "name": "习水县",
                        "sub": []
                    },
                    {
                        "id": 1052,
                        "name": "道真",
                        "sub": []
                    },
                    {
                        "id": 1053,
                        "name": "务川",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 9,
        "name": "海南",
        "sub": [
            {
                "id": 120,
                "name": "海口",
                "sub": [
                    {
                        "id": 1054,
                        "name": "秀英区",
                        "sub": []
                    },
                    {
                        "id": 1055,
                        "name": "龙华区",
                        "sub": []
                    },
                    {
                        "id": 1056,
                        "name": "琼山区",
                        "sub": []
                    },
                    {
                        "id": 1057,
                        "name": "美兰区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 121,
                "name": "三亚",
                "sub": []
            },
            {
                "id": 122,
                "name": "白沙",
                "sub": []
            },
            {
                "id": 123,
                "name": "保亭",
                "sub": []
            },
            {
                "id": 124,
                "name": "昌江",
                "sub": []
            },
            {
                "id": 125,
                "name": "澄迈县",
                "sub": []
            },
            {
                "id": 126,
                "name": "定安县",
                "sub": []
            },
            {
                "id": 127,
                "name": "东方",
                "sub": []
            },
            {
                "id": 128,
                "name": "乐东",
                "sub": []
            },
            {
                "id": 129,
                "name": "临高县",
                "sub": []
            },
            {
                "id": 130,
                "name": "陵水",
                "sub": []
            },
            {
                "id": 131,
                "name": "琼海",
                "sub": []
            },
            {
                "id": 132,
                "name": "琼中",
                "sub": []
            },
            {
                "id": 133,
                "name": "屯昌县",
                "sub": []
            },
            {
                "id": 134,
                "name": "万宁",
                "sub": []
            },
            {
                "id": 135,
                "name": "文昌",
                "sub": []
            },
            {
                "id": 136,
                "name": "五指山",
                "sub": []
            },
            {
                "id": 137,
                "name": "儋州",
                "sub": [
                    {
                        "id": 1058,
                        "name": "市区",
                        "sub": []
                    },
                    {
                        "id": 1059,
                        "name": "洋浦开发区",
                        "sub": []
                    },
                    {
                        "id": 1060,
                        "name": "那大镇",
                        "sub": []
                    },
                    {
                        "id": 1061,
                        "name": "王五镇",
                        "sub": []
                    },
                    {
                        "id": 1062,
                        "name": "雅星镇",
                        "sub": []
                    },
                    {
                        "id": 1063,
                        "name": "大成镇",
                        "sub": []
                    },
                    {
                        "id": 1064,
                        "name": "中和镇",
                        "sub": []
                    },
                    {
                        "id": 1065,
                        "name": "峨蔓镇",
                        "sub": []
                    },
                    {
                        "id": 1066,
                        "name": "南丰镇",
                        "sub": []
                    },
                    {
                        "id": 1067,
                        "name": "白马井镇",
                        "sub": []
                    },
                    {
                        "id": 1068,
                        "name": "兰洋镇",
                        "sub": []
                    },
                    {
                        "id": 1069,
                        "name": "和庆镇",
                        "sub": []
                    },
                    {
                        "id": 1070,
                        "name": "海头镇",
                        "sub": []
                    },
                    {
                        "id": 1071,
                        "name": "排浦镇",
                        "sub": []
                    },
                    {
                        "id": 1072,
                        "name": "东成镇",
                        "sub": []
                    },
                    {
                        "id": 1073,
                        "name": "光村镇",
                        "sub": []
                    },
                    {
                        "id": 1074,
                        "name": "木棠镇",
                        "sub": []
                    },
                    {
                        "id": 1075,
                        "name": "新州镇",
                        "sub": []
                    },
                    {
                        "id": 1076,
                        "name": "三都镇",
                        "sub": []
                    },
                    {
                        "id": 1077,
                        "name": "其他",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 10,
        "name": "河北",
        "sub": [
            {
                "id": 138,
                "name": "石家庄",
                "sub": [
                    {
                        "id": 1078,
                        "name": "长安区",
                        "sub": []
                    },
                    {
                        "id": 1079,
                        "name": "桥东区",
                        "sub": []
                    },
                    {
                        "id": 1080,
                        "name": "桥西区",
                        "sub": []
                    },
                    {
                        "id": 1081,
                        "name": "新华区",
                        "sub": []
                    },
                    {
                        "id": 1082,
                        "name": "裕华区",
                        "sub": []
                    },
                    {
                        "id": 1083,
                        "name": "井陉矿区",
                        "sub": []
                    },
                    {
                        "id": 1084,
                        "name": "高新区",
                        "sub": []
                    },
                    {
                        "id": 1085,
                        "name": "辛集市",
                        "sub": []
                    },
                    {
                        "id": 1086,
                        "name": "藁城市",
                        "sub": []
                    },
                    {
                        "id": 1087,
                        "name": "晋州市",
                        "sub": []
                    },
                    {
                        "id": 1088,
                        "name": "新乐市",
                        "sub": []
                    },
                    {
                        "id": 1089,
                        "name": "鹿泉市",
                        "sub": []
                    },
                    {
                        "id": 1090,
                        "name": "井陉县",
                        "sub": []
                    },
                    {
                        "id": 1091,
                        "name": "正定县",
                        "sub": []
                    },
                    {
                        "id": 1092,
                        "name": "栾城县",
                        "sub": []
                    },
                    {
                        "id": 1093,
                        "name": "行唐县",
                        "sub": []
                    },
                    {
                        "id": 1094,
                        "name": "灵寿县",
                        "sub": []
                    },
                    {
                        "id": 1095,
                        "name": "高邑县",
                        "sub": []
                    },
                    {
                        "id": 1096,
                        "name": "深泽县",
                        "sub": []
                    },
                    {
                        "id": 1097,
                        "name": "赞皇县",
                        "sub": []
                    },
                    {
                        "id": 1098,
                        "name": "无极县",
                        "sub": []
                    },
                    {
                        "id": 1099,
                        "name": "平山县",
                        "sub": []
                    },
                    {
                        "id": 1100,
                        "name": "元氏县",
                        "sub": []
                    },
                    {
                        "id": 1101,
                        "name": "赵县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 139,
                "name": "保定",
                "sub": [
                    {
                        "id": 1102,
                        "name": "新市区",
                        "sub": []
                    },
                    {
                        "id": 1103,
                        "name": "南市区",
                        "sub": []
                    },
                    {
                        "id": 1104,
                        "name": "北市区",
                        "sub": []
                    },
                    {
                        "id": 1105,
                        "name": "涿州市",
                        "sub": []
                    },
                    {
                        "id": 1106,
                        "name": "定州市",
                        "sub": []
                    },
                    {
                        "id": 1107,
                        "name": "安国市",
                        "sub": []
                    },
                    {
                        "id": 1108,
                        "name": "高碑店市",
                        "sub": []
                    },
                    {
                        "id": 1109,
                        "name": "满城县",
                        "sub": []
                    },
                    {
                        "id": 1110,
                        "name": "清苑县",
                        "sub": []
                    },
                    {
                        "id": 1111,
                        "name": "涞水县",
                        "sub": []
                    },
                    {
                        "id": 1112,
                        "name": "阜平县",
                        "sub": []
                    },
                    {
                        "id": 1113,
                        "name": "徐水县",
                        "sub": []
                    },
                    {
                        "id": 1114,
                        "name": "定兴县",
                        "sub": []
                    },
                    {
                        "id": 1115,
                        "name": "唐县",
                        "sub": []
                    },
                    {
                        "id": 1116,
                        "name": "高阳县",
                        "sub": []
                    },
                    {
                        "id": 1117,
                        "name": "容城县",
                        "sub": []
                    },
                    {
                        "id": 1118,
                        "name": "涞源县",
                        "sub": []
                    },
                    {
                        "id": 1119,
                        "name": "望都县",
                        "sub": []
                    },
                    {
                        "id": 1120,
                        "name": "安新县",
                        "sub": []
                    },
                    {
                        "id": 1121,
                        "name": "易县",
                        "sub": []
                    },
                    {
                        "id": 1122,
                        "name": "曲阳县",
                        "sub": []
                    },
                    {
                        "id": 1123,
                        "name": "蠡县",
                        "sub": []
                    },
                    {
                        "id": 1124,
                        "name": "顺平县",
                        "sub": []
                    },
                    {
                        "id": 1125,
                        "name": "博野县",
                        "sub": []
                    },
                    {
                        "id": 1126,
                        "name": "雄县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 140,
                "name": "沧州",
                "sub": [
                    {
                        "id": 1127,
                        "name": "运河区",
                        "sub": []
                    },
                    {
                        "id": 1128,
                        "name": "新华区",
                        "sub": []
                    },
                    {
                        "id": 1129,
                        "name": "泊头市",
                        "sub": []
                    },
                    {
                        "id": 1130,
                        "name": "任丘市",
                        "sub": []
                    },
                    {
                        "id": 1131,
                        "name": "黄骅市",
                        "sub": []
                    },
                    {
                        "id": 1132,
                        "name": "河间市",
                        "sub": []
                    },
                    {
                        "id": 1133,
                        "name": "沧县",
                        "sub": []
                    },
                    {
                        "id": 1134,
                        "name": "青县",
                        "sub": []
                    },
                    {
                        "id": 1135,
                        "name": "东光县",
                        "sub": []
                    },
                    {
                        "id": 1136,
                        "name": "海兴县",
                        "sub": []
                    },
                    {
                        "id": 1137,
                        "name": "盐山县",
                        "sub": []
                    },
                    {
                        "id": 1138,
                        "name": "肃宁县",
                        "sub": []
                    },
                    {
                        "id": 1139,
                        "name": "南皮县",
                        "sub": []
                    },
                    {
                        "id": 1140,
                        "name": "吴桥县",
                        "sub": []
                    },
                    {
                        "id": 1141,
                        "name": "献县",
                        "sub": []
                    },
                    {
                        "id": 1142,
                        "name": "孟村",
                        "sub": []
                    }
                ]
            },
            {
                "id": 141,
                "name": "承德",
                "sub": [
                    {
                        "id": 1143,
                        "name": "双桥区",
                        "sub": []
                    },
                    {
                        "id": 1144,
                        "name": "双滦区",
                        "sub": []
                    },
                    {
                        "id": 1145,
                        "name": "鹰手营子矿区",
                        "sub": []
                    },
                    {
                        "id": 1146,
                        "name": "承德县",
                        "sub": []
                    },
                    {
                        "id": 1147,
                        "name": "兴隆县",
                        "sub": []
                    },
                    {
                        "id": 1148,
                        "name": "平泉县",
                        "sub": []
                    },
                    {
                        "id": 1149,
                        "name": "滦平县",
                        "sub": []
                    },
                    {
                        "id": 1150,
                        "name": "隆化县",
                        "sub": []
                    },
                    {
                        "id": 1151,
                        "name": "丰宁",
                        "sub": []
                    },
                    {
                        "id": 1152,
                        "name": "宽城",
                        "sub": []
                    },
                    {
                        "id": 1153,
                        "name": "围场",
                        "sub": []
                    }
                ]
            },
            {
                "id": 142,
                "name": "邯郸",
                "sub": [
                    {
                        "id": 1154,
                        "name": "从台区",
                        "sub": []
                    },
                    {
                        "id": 1155,
                        "name": "复兴区",
                        "sub": []
                    },
                    {
                        "id": 1156,
                        "name": "邯山区",
                        "sub": []
                    },
                    {
                        "id": 1157,
                        "name": "峰峰矿区",
                        "sub": []
                    },
                    {
                        "id": 1158,
                        "name": "武安市",
                        "sub": []
                    },
                    {
                        "id": 1159,
                        "name": "邯郸县",
                        "sub": []
                    },
                    {
                        "id": 1160,
                        "name": "临漳县",
                        "sub": []
                    },
                    {
                        "id": 1161,
                        "name": "成安县",
                        "sub": []
                    },
                    {
                        "id": 1162,
                        "name": "大名县",
                        "sub": []
                    },
                    {
                        "id": 1163,
                        "name": "涉县",
                        "sub": []
                    },
                    {
                        "id": 1164,
                        "name": "磁县",
                        "sub": []
                    },
                    {
                        "id": 1165,
                        "name": "肥乡县",
                        "sub": []
                    },
                    {
                        "id": 1166,
                        "name": "永年县",
                        "sub": []
                    },
                    {
                        "id": 1167,
                        "name": "邱县",
                        "sub": []
                    },
                    {
                        "id": 1168,
                        "name": "鸡泽县",
                        "sub": []
                    },
                    {
                        "id": 1169,
                        "name": "广平县",
                        "sub": []
                    },
                    {
                        "id": 1170,
                        "name": "馆陶县",
                        "sub": []
                    },
                    {
                        "id": 1171,
                        "name": "魏县",
                        "sub": []
                    },
                    {
                        "id": 1172,
                        "name": "曲周县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 143,
                "name": "衡水",
                "sub": [
                    {
                        "id": 1173,
                        "name": "桃城区",
                        "sub": []
                    },
                    {
                        "id": 1174,
                        "name": "冀州市",
                        "sub": []
                    },
                    {
                        "id": 1175,
                        "name": "深州市",
                        "sub": []
                    },
                    {
                        "id": 1176,
                        "name": "枣强县",
                        "sub": []
                    },
                    {
                        "id": 1177,
                        "name": "武邑县",
                        "sub": []
                    },
                    {
                        "id": 1178,
                        "name": "武强县",
                        "sub": []
                    },
                    {
                        "id": 1179,
                        "name": "饶阳县",
                        "sub": []
                    },
                    {
                        "id": 1180,
                        "name": "安平县",
                        "sub": []
                    },
                    {
                        "id": 1181,
                        "name": "故城县",
                        "sub": []
                    },
                    {
                        "id": 1182,
                        "name": "景县",
                        "sub": []
                    },
                    {
                        "id": 1183,
                        "name": "阜城县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 144,
                "name": "廊坊",
                "sub": [
                    {
                        "id": 1184,
                        "name": "安次区",
                        "sub": []
                    },
                    {
                        "id": 1185,
                        "name": "广阳区",
                        "sub": []
                    },
                    {
                        "id": 1186,
                        "name": "霸州市",
                        "sub": []
                    },
                    {
                        "id": 1187,
                        "name": "三河市",
                        "sub": []
                    },
                    {
                        "id": 1188,
                        "name": "固安县",
                        "sub": []
                    },
                    {
                        "id": 1189,
                        "name": "永清县",
                        "sub": []
                    },
                    {
                        "id": 1190,
                        "name": "香河县",
                        "sub": []
                    },
                    {
                        "id": 1191,
                        "name": "大城县",
                        "sub": []
                    },
                    {
                        "id": 1192,
                        "name": "文安县",
                        "sub": []
                    },
                    {
                        "id": 1193,
                        "name": "大厂",
                        "sub": []
                    }
                ]
            },
            {
                "id": 145,
                "name": "秦皇岛",
                "sub": [
                    {
                        "id": 1194,
                        "name": "海港区",
                        "sub": []
                    },
                    {
                        "id": 1195,
                        "name": "山海关区",
                        "sub": []
                    },
                    {
                        "id": 1196,
                        "name": "北戴河区",
                        "sub": []
                    },
                    {
                        "id": 1197,
                        "name": "昌黎县",
                        "sub": []
                    },
                    {
                        "id": 1198,
                        "name": "抚宁县",
                        "sub": []
                    },
                    {
                        "id": 1199,
                        "name": "卢龙县",
                        "sub": []
                    },
                    {
                        "id": 1200,
                        "name": "青龙",
                        "sub": []
                    }
                ]
            },
            {
                "id": 146,
                "name": "唐山",
                "sub": [
                    {
                        "id": 1201,
                        "name": "路北区",
                        "sub": []
                    },
                    {
                        "id": 1202,
                        "name": "路南区",
                        "sub": []
                    },
                    {
                        "id": 1203,
                        "name": "古冶区",
                        "sub": []
                    },
                    {
                        "id": 1204,
                        "name": "开平区",
                        "sub": []
                    },
                    {
                        "id": 1205,
                        "name": "丰南区",
                        "sub": []
                    },
                    {
                        "id": 1206,
                        "name": "丰润区",
                        "sub": []
                    },
                    {
                        "id": 1207,
                        "name": "遵化市",
                        "sub": []
                    },
                    {
                        "id": 1208,
                        "name": "迁安市",
                        "sub": []
                    },
                    {
                        "id": 1209,
                        "name": "滦县",
                        "sub": []
                    },
                    {
                        "id": 1210,
                        "name": "滦南县",
                        "sub": []
                    },
                    {
                        "id": 1211,
                        "name": "乐亭县",
                        "sub": []
                    },
                    {
                        "id": 1212,
                        "name": "迁西县",
                        "sub": []
                    },
                    {
                        "id": 1213,
                        "name": "玉田县",
                        "sub": []
                    },
                    {
                        "id": 1214,
                        "name": "唐海县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 147,
                "name": "邢台",
                "sub": [
                    {
                        "id": 1215,
                        "name": "桥东区",
                        "sub": []
                    },
                    {
                        "id": 1216,
                        "name": "桥西区",
                        "sub": []
                    },
                    {
                        "id": 1217,
                        "name": "南宫市",
                        "sub": []
                    },
                    {
                        "id": 1218,
                        "name": "沙河市",
                        "sub": []
                    },
                    {
                        "id": 1219,
                        "name": "邢台县",
                        "sub": []
                    },
                    {
                        "id": 1220,
                        "name": "临城县",
                        "sub": []
                    },
                    {
                        "id": 1221,
                        "name": "内丘县",
                        "sub": []
                    },
                    {
                        "id": 1222,
                        "name": "柏乡县",
                        "sub": []
                    },
                    {
                        "id": 1223,
                        "name": "隆尧县",
                        "sub": []
                    },
                    {
                        "id": 1224,
                        "name": "任县",
                        "sub": []
                    },
                    {
                        "id": 1225,
                        "name": "南和县",
                        "sub": []
                    },
                    {
                        "id": 1226,
                        "name": "宁晋县",
                        "sub": []
                    },
                    {
                        "id": 1227,
                        "name": "巨鹿县",
                        "sub": []
                    },
                    {
                        "id": 1228,
                        "name": "新河县",
                        "sub": []
                    },
                    {
                        "id": 1229,
                        "name": "广宗县",
                        "sub": []
                    },
                    {
                        "id": 1230,
                        "name": "平乡县",
                        "sub": []
                    },
                    {
                        "id": 1231,
                        "name": "威县",
                        "sub": []
                    },
                    {
                        "id": 1232,
                        "name": "清河县",
                        "sub": []
                    },
                    {
                        "id": 1233,
                        "name": "临西县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 148,
                "name": "张家口",
                "sub": [
                    {
                        "id": 1234,
                        "name": "桥西区",
                        "sub": []
                    },
                    {
                        "id": 1235,
                        "name": "桥东区",
                        "sub": []
                    },
                    {
                        "id": 1236,
                        "name": "宣化区",
                        "sub": []
                    },
                    {
                        "id": 1237,
                        "name": "下花园区",
                        "sub": []
                    },
                    {
                        "id": 1238,
                        "name": "宣化县",
                        "sub": []
                    },
                    {
                        "id": 1239,
                        "name": "张北县",
                        "sub": []
                    },
                    {
                        "id": 1240,
                        "name": "康保县",
                        "sub": []
                    },
                    {
                        "id": 1241,
                        "name": "沽源县",
                        "sub": []
                    },
                    {
                        "id": 1242,
                        "name": "尚义县",
                        "sub": []
                    },
                    {
                        "id": 1243,
                        "name": "蔚县",
                        "sub": []
                    },
                    {
                        "id": 1244,
                        "name": "阳原县",
                        "sub": []
                    },
                    {
                        "id": 1245,
                        "name": "怀安县",
                        "sub": []
                    },
                    {
                        "id": 1246,
                        "name": "万全县",
                        "sub": []
                    },
                    {
                        "id": 1247,
                        "name": "怀来县",
                        "sub": []
                    },
                    {
                        "id": 1248,
                        "name": "涿鹿县",
                        "sub": []
                    },
                    {
                        "id": 1249,
                        "name": "赤城县",
                        "sub": []
                    },
                    {
                        "id": 1250,
                        "name": "崇礼县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 11,
        "name": "河南",
        "sub": [
            {
                "id": 149,
                "name": "郑州",
                "sub": [
                    {
                        "id": 1251,
                        "name": "金水区",
                        "sub": []
                    },
                    {
                        "id": 1252,
                        "name": "邙山区",
                        "sub": []
                    },
                    {
                        "id": 1253,
                        "name": "二七区",
                        "sub": []
                    },
                    {
                        "id": 1254,
                        "name": "管城区",
                        "sub": []
                    },
                    {
                        "id": 1255,
                        "name": "中原区",
                        "sub": []
                    },
                    {
                        "id": 1256,
                        "name": "上街区",
                        "sub": []
                    },
                    {
                        "id": 1257,
                        "name": "惠济区",
                        "sub": []
                    },
                    {
                        "id": 1258,
                        "name": "郑东新区",
                        "sub": []
                    },
                    {
                        "id": 1259,
                        "name": "经济技术开发区",
                        "sub": []
                    },
                    {
                        "id": 1260,
                        "name": "高新开发区",
                        "sub": []
                    },
                    {
                        "id": 1261,
                        "name": "出口加工区",
                        "sub": []
                    },
                    {
                        "id": 1262,
                        "name": "巩义市",
                        "sub": []
                    },
                    {
                        "id": 1263,
                        "name": "荥阳市",
                        "sub": []
                    },
                    {
                        "id": 1264,
                        "name": "新密市",
                        "sub": []
                    },
                    {
                        "id": 1265,
                        "name": "新郑市",
                        "sub": []
                    },
                    {
                        "id": 1266,
                        "name": "登封市",
                        "sub": []
                    },
                    {
                        "id": 1267,
                        "name": "中牟县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 150,
                "name": "洛阳",
                "sub": [
                    {
                        "id": 1268,
                        "name": "西工区",
                        "sub": []
                    },
                    {
                        "id": 1269,
                        "name": "老城区",
                        "sub": []
                    },
                    {
                        "id": 1270,
                        "name": "涧西区",
                        "sub": []
                    },
                    {
                        "id": 1271,
                        "name": "瀍河回族区",
                        "sub": []
                    },
                    {
                        "id": 1272,
                        "name": "洛龙区",
                        "sub": []
                    },
                    {
                        "id": 1273,
                        "name": "吉利区",
                        "sub": []
                    },
                    {
                        "id": 1274,
                        "name": "偃师市",
                        "sub": []
                    },
                    {
                        "id": 1275,
                        "name": "孟津县",
                        "sub": []
                    },
                    {
                        "id": 1276,
                        "name": "新安县",
                        "sub": []
                    },
                    {
                        "id": 1277,
                        "name": "栾川县",
                        "sub": []
                    },
                    {
                        "id": 1278,
                        "name": "嵩县",
                        "sub": []
                    },
                    {
                        "id": 1279,
                        "name": "汝阳县",
                        "sub": []
                    },
                    {
                        "id": 1280,
                        "name": "宜阳县",
                        "sub": []
                    },
                    {
                        "id": 1281,
                        "name": "洛宁县",
                        "sub": []
                    },
                    {
                        "id": 1282,
                        "name": "伊川县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 151,
                "name": "开封",
                "sub": [
                    {
                        "id": 1283,
                        "name": "鼓楼区",
                        "sub": []
                    },
                    {
                        "id": 1284,
                        "name": "龙亭区",
                        "sub": []
                    },
                    {
                        "id": 1285,
                        "name": "顺河回族区",
                        "sub": []
                    },
                    {
                        "id": 1286,
                        "name": "金明区",
                        "sub": []
                    },
                    {
                        "id": 1287,
                        "name": "禹王台区",
                        "sub": []
                    },
                    {
                        "id": 1288,
                        "name": "杞县",
                        "sub": []
                    },
                    {
                        "id": 1289,
                        "name": "通许县",
                        "sub": []
                    },
                    {
                        "id": 1290,
                        "name": "尉氏县",
                        "sub": []
                    },
                    {
                        "id": 1291,
                        "name": "开封县",
                        "sub": []
                    },
                    {
                        "id": 1292,
                        "name": "兰考县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 152,
                "name": "安阳",
                "sub": [
                    {
                        "id": 1293,
                        "name": "北关区",
                        "sub": []
                    },
                    {
                        "id": 1294,
                        "name": "文峰区",
                        "sub": []
                    },
                    {
                        "id": 1295,
                        "name": "殷都区",
                        "sub": []
                    },
                    {
                        "id": 1296,
                        "name": "龙安区",
                        "sub": []
                    },
                    {
                        "id": 1297,
                        "name": "林州市",
                        "sub": []
                    },
                    {
                        "id": 1298,
                        "name": "安阳县",
                        "sub": []
                    },
                    {
                        "id": 1299,
                        "name": "汤阴县",
                        "sub": []
                    },
                    {
                        "id": 1300,
                        "name": "滑县",
                        "sub": []
                    },
                    {
                        "id": 1301,
                        "name": "内黄县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 153,
                "name": "鹤壁",
                "sub": [
                    {
                        "id": 1302,
                        "name": "淇滨区",
                        "sub": []
                    },
                    {
                        "id": 1303,
                        "name": "山城区",
                        "sub": []
                    },
                    {
                        "id": 1304,
                        "name": "鹤山区",
                        "sub": []
                    },
                    {
                        "id": 1305,
                        "name": "浚县",
                        "sub": []
                    },
                    {
                        "id": 1306,
                        "name": "淇县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 154,
                "name": "济源",
                "sub": [
                    {
                        "id": 1307,
                        "name": "济源市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 155,
                "name": "焦作",
                "sub": [
                    {
                        "id": 1308,
                        "name": "解放区",
                        "sub": []
                    },
                    {
                        "id": 1309,
                        "name": "中站区",
                        "sub": []
                    },
                    {
                        "id": 1310,
                        "name": "马村区",
                        "sub": []
                    },
                    {
                        "id": 1311,
                        "name": "山阳区",
                        "sub": []
                    },
                    {
                        "id": 1312,
                        "name": "沁阳市",
                        "sub": []
                    },
                    {
                        "id": 1313,
                        "name": "孟州市",
                        "sub": []
                    },
                    {
                        "id": 1314,
                        "name": "修武县",
                        "sub": []
                    },
                    {
                        "id": 1315,
                        "name": "博爱县",
                        "sub": []
                    },
                    {
                        "id": 1316,
                        "name": "武陟县",
                        "sub": []
                    },
                    {
                        "id": 1317,
                        "name": "温县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 156,
                "name": "南阳",
                "sub": [
                    {
                        "id": 1318,
                        "name": "卧龙区",
                        "sub": []
                    },
                    {
                        "id": 1319,
                        "name": "宛城区",
                        "sub": []
                    },
                    {
                        "id": 1320,
                        "name": "邓州市",
                        "sub": []
                    },
                    {
                        "id": 1321,
                        "name": "南召县",
                        "sub": []
                    },
                    {
                        "id": 1322,
                        "name": "方城县",
                        "sub": []
                    },
                    {
                        "id": 1323,
                        "name": "西峡县",
                        "sub": []
                    },
                    {
                        "id": 1324,
                        "name": "镇平县",
                        "sub": []
                    },
                    {
                        "id": 1325,
                        "name": "内乡县",
                        "sub": []
                    },
                    {
                        "id": 1326,
                        "name": "淅川县",
                        "sub": []
                    },
                    {
                        "id": 1327,
                        "name": "社旗县",
                        "sub": []
                    },
                    {
                        "id": 1328,
                        "name": "唐河县",
                        "sub": []
                    },
                    {
                        "id": 1329,
                        "name": "新野县",
                        "sub": []
                    },
                    {
                        "id": 1330,
                        "name": "桐柏县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 157,
                "name": "平顶山",
                "sub": [
                    {
                        "id": 1331,
                        "name": "新华区",
                        "sub": []
                    },
                    {
                        "id": 1332,
                        "name": "卫东区",
                        "sub": []
                    },
                    {
                        "id": 1333,
                        "name": "湛河区",
                        "sub": []
                    },
                    {
                        "id": 1334,
                        "name": "石龙区",
                        "sub": []
                    },
                    {
                        "id": 1335,
                        "name": "舞钢市",
                        "sub": []
                    },
                    {
                        "id": 1336,
                        "name": "汝州市",
                        "sub": []
                    },
                    {
                        "id": 1337,
                        "name": "宝丰县",
                        "sub": []
                    },
                    {
                        "id": 1338,
                        "name": "叶县",
                        "sub": []
                    },
                    {
                        "id": 1339,
                        "name": "鲁山县",
                        "sub": []
                    },
                    {
                        "id": 1340,
                        "name": "郏县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 158,
                "name": "三门峡",
                "sub": [
                    {
                        "id": 1341,
                        "name": "湖滨区",
                        "sub": []
                    },
                    {
                        "id": 1342,
                        "name": "义马市",
                        "sub": []
                    },
                    {
                        "id": 1343,
                        "name": "灵宝市",
                        "sub": []
                    },
                    {
                        "id": 1344,
                        "name": "渑池县",
                        "sub": []
                    },
                    {
                        "id": 1345,
                        "name": "陕县",
                        "sub": []
                    },
                    {
                        "id": 1346,
                        "name": "卢氏县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 159,
                "name": "商丘",
                "sub": [
                    {
                        "id": 1347,
                        "name": "梁园区",
                        "sub": []
                    },
                    {
                        "id": 1348,
                        "name": "睢阳区",
                        "sub": []
                    },
                    {
                        "id": 1349,
                        "name": "永城市",
                        "sub": []
                    },
                    {
                        "id": 1350,
                        "name": "民权县",
                        "sub": []
                    },
                    {
                        "id": 1351,
                        "name": "睢县",
                        "sub": []
                    },
                    {
                        "id": 1352,
                        "name": "宁陵县",
                        "sub": []
                    },
                    {
                        "id": 1353,
                        "name": "虞城县",
                        "sub": []
                    },
                    {
                        "id": 1354,
                        "name": "柘城县",
                        "sub": []
                    },
                    {
                        "id": 1355,
                        "name": "夏邑县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 160,
                "name": "新乡",
                "sub": [
                    {
                        "id": 1356,
                        "name": "卫滨区",
                        "sub": []
                    },
                    {
                        "id": 1357,
                        "name": "红旗区",
                        "sub": []
                    },
                    {
                        "id": 1358,
                        "name": "凤泉区",
                        "sub": []
                    },
                    {
                        "id": 1359,
                        "name": "牧野区",
                        "sub": []
                    },
                    {
                        "id": 1360,
                        "name": "卫辉市",
                        "sub": []
                    },
                    {
                        "id": 1361,
                        "name": "辉县市",
                        "sub": []
                    },
                    {
                        "id": 1362,
                        "name": "新乡县",
                        "sub": []
                    },
                    {
                        "id": 1363,
                        "name": "获嘉县",
                        "sub": []
                    },
                    {
                        "id": 1364,
                        "name": "原阳县",
                        "sub": []
                    },
                    {
                        "id": 1365,
                        "name": "延津县",
                        "sub": []
                    },
                    {
                        "id": 1366,
                        "name": "封丘县",
                        "sub": []
                    },
                    {
                        "id": 1367,
                        "name": "长垣县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 161,
                "name": "信阳",
                "sub": [
                    {
                        "id": 1368,
                        "name": "浉河区",
                        "sub": []
                    },
                    {
                        "id": 1369,
                        "name": "平桥区",
                        "sub": []
                    },
                    {
                        "id": 1370,
                        "name": "罗山县",
                        "sub": []
                    },
                    {
                        "id": 1371,
                        "name": "光山县",
                        "sub": []
                    },
                    {
                        "id": 1372,
                        "name": "新县",
                        "sub": []
                    },
                    {
                        "id": 1373,
                        "name": "商城县",
                        "sub": []
                    },
                    {
                        "id": 1374,
                        "name": "固始县",
                        "sub": []
                    },
                    {
                        "id": 1375,
                        "name": "潢川县",
                        "sub": []
                    },
                    {
                        "id": 1376,
                        "name": "淮滨县",
                        "sub": []
                    },
                    {
                        "id": 1377,
                        "name": "息县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 162,
                "name": "许昌",
                "sub": [
                    {
                        "id": 1378,
                        "name": "魏都区",
                        "sub": []
                    },
                    {
                        "id": 1379,
                        "name": "禹州市",
                        "sub": []
                    },
                    {
                        "id": 1380,
                        "name": "长葛市",
                        "sub": []
                    },
                    {
                        "id": 1381,
                        "name": "许昌县",
                        "sub": []
                    },
                    {
                        "id": 1382,
                        "name": "鄢陵县",
                        "sub": []
                    },
                    {
                        "id": 1383,
                        "name": "襄城县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 163,
                "name": "周口",
                "sub": [
                    {
                        "id": 1384,
                        "name": "川汇区",
                        "sub": []
                    },
                    {
                        "id": 1385,
                        "name": "项城市",
                        "sub": []
                    },
                    {
                        "id": 1386,
                        "name": "扶沟县",
                        "sub": []
                    },
                    {
                        "id": 1387,
                        "name": "西华县",
                        "sub": []
                    },
                    {
                        "id": 1388,
                        "name": "商水县",
                        "sub": []
                    },
                    {
                        "id": 1389,
                        "name": "沈丘县",
                        "sub": []
                    },
                    {
                        "id": 1390,
                        "name": "郸城县",
                        "sub": []
                    },
                    {
                        "id": 1391,
                        "name": "淮阳县",
                        "sub": []
                    },
                    {
                        "id": 1392,
                        "name": "太康县",
                        "sub": []
                    },
                    {
                        "id": 1393,
                        "name": "鹿邑县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 164,
                "name": "驻马店",
                "sub": [
                    {
                        "id": 1394,
                        "name": "驿城区",
                        "sub": []
                    },
                    {
                        "id": 1395,
                        "name": "西平县",
                        "sub": []
                    },
                    {
                        "id": 1396,
                        "name": "上蔡县",
                        "sub": []
                    },
                    {
                        "id": 1397,
                        "name": "平舆县",
                        "sub": []
                    },
                    {
                        "id": 1398,
                        "name": "正阳县",
                        "sub": []
                    },
                    {
                        "id": 1399,
                        "name": "确山县",
                        "sub": []
                    },
                    {
                        "id": 1400,
                        "name": "泌阳县",
                        "sub": []
                    },
                    {
                        "id": 1401,
                        "name": "汝南县",
                        "sub": []
                    },
                    {
                        "id": 1402,
                        "name": "遂平县",
                        "sub": []
                    },
                    {
                        "id": 1403,
                        "name": "新蔡县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 165,
                "name": "漯河",
                "sub": [
                    {
                        "id": 1404,
                        "name": "郾城区",
                        "sub": []
                    },
                    {
                        "id": 1405,
                        "name": "源汇区",
                        "sub": []
                    },
                    {
                        "id": 1406,
                        "name": "召陵区",
                        "sub": []
                    },
                    {
                        "id": 1407,
                        "name": "舞阳县",
                        "sub": []
                    },
                    {
                        "id": 1408,
                        "name": "临颍县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 166,
                "name": "濮阳",
                "sub": [
                    {
                        "id": 1409,
                        "name": "华龙区",
                        "sub": []
                    },
                    {
                        "id": 1410,
                        "name": "清丰县",
                        "sub": []
                    },
                    {
                        "id": 1411,
                        "name": "南乐县",
                        "sub": []
                    },
                    {
                        "id": 1412,
                        "name": "范县",
                        "sub": []
                    },
                    {
                        "id": 1413,
                        "name": "台前县",
                        "sub": []
                    },
                    {
                        "id": 1414,
                        "name": "濮阳县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 12,
        "name": "黑龙江",
        "sub": [
            {
                "id": 167,
                "name": "哈尔滨",
                "sub": [
                    {
                        "id": 1415,
                        "name": "道里区",
                        "sub": []
                    },
                    {
                        "id": 1416,
                        "name": "南岗区",
                        "sub": []
                    },
                    {
                        "id": 1417,
                        "name": "动力区",
                        "sub": []
                    },
                    {
                        "id": 1418,
                        "name": "平房区",
                        "sub": []
                    },
                    {
                        "id": 1419,
                        "name": "香坊区",
                        "sub": []
                    },
                    {
                        "id": 1420,
                        "name": "太平区",
                        "sub": []
                    },
                    {
                        "id": 1421,
                        "name": "道外区",
                        "sub": []
                    },
                    {
                        "id": 1422,
                        "name": "阿城区",
                        "sub": []
                    },
                    {
                        "id": 1423,
                        "name": "呼兰区",
                        "sub": []
                    },
                    {
                        "id": 1424,
                        "name": "松北区",
                        "sub": []
                    },
                    {
                        "id": 1425,
                        "name": "尚志市",
                        "sub": []
                    },
                    {
                        "id": 1426,
                        "name": "双城市",
                        "sub": []
                    },
                    {
                        "id": 1427,
                        "name": "五常市",
                        "sub": []
                    },
                    {
                        "id": 1428,
                        "name": "方正县",
                        "sub": []
                    },
                    {
                        "id": 1429,
                        "name": "宾县",
                        "sub": []
                    },
                    {
                        "id": 1430,
                        "name": "依兰县",
                        "sub": []
                    },
                    {
                        "id": 1431,
                        "name": "巴彦县",
                        "sub": []
                    },
                    {
                        "id": 1432,
                        "name": "通河县",
                        "sub": []
                    },
                    {
                        "id": 1433,
                        "name": "木兰县",
                        "sub": []
                    },
                    {
                        "id": 1434,
                        "name": "延寿县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 168,
                "name": "大庆",
                "sub": [
                    {
                        "id": 1435,
                        "name": "萨尔图区",
                        "sub": []
                    },
                    {
                        "id": 1436,
                        "name": "红岗区",
                        "sub": []
                    },
                    {
                        "id": 1437,
                        "name": "龙凤区",
                        "sub": []
                    },
                    {
                        "id": 1438,
                        "name": "让胡路区",
                        "sub": []
                    },
                    {
                        "id": 1439,
                        "name": "大同区",
                        "sub": []
                    },
                    {
                        "id": 1440,
                        "name": "肇州县",
                        "sub": []
                    },
                    {
                        "id": 1441,
                        "name": "肇源县",
                        "sub": []
                    },
                    {
                        "id": 1442,
                        "name": "林甸县",
                        "sub": []
                    },
                    {
                        "id": 1443,
                        "name": "杜尔伯特",
                        "sub": []
                    }
                ]
            },
            {
                "id": 169,
                "name": "大兴安岭",
                "sub": [
                    {
                        "id": 1444,
                        "name": "呼玛县",
                        "sub": []
                    },
                    {
                        "id": 1445,
                        "name": "漠河县",
                        "sub": []
                    },
                    {
                        "id": 1446,
                        "name": "塔河县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 170,
                "name": "鹤岗",
                "sub": [
                    {
                        "id": 1447,
                        "name": "兴山区",
                        "sub": []
                    },
                    {
                        "id": 1448,
                        "name": "工农区",
                        "sub": []
                    },
                    {
                        "id": 1449,
                        "name": "南山区",
                        "sub": []
                    },
                    {
                        "id": 1450,
                        "name": "兴安区",
                        "sub": []
                    },
                    {
                        "id": 1451,
                        "name": "向阳区",
                        "sub": []
                    },
                    {
                        "id": 1452,
                        "name": "东山区",
                        "sub": []
                    },
                    {
                        "id": 1453,
                        "name": "萝北县",
                        "sub": []
                    },
                    {
                        "id": 1454,
                        "name": "绥滨县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 171,
                "name": "黑河",
                "sub": [
                    {
                        "id": 1455,
                        "name": "爱辉区",
                        "sub": []
                    },
                    {
                        "id": 1456,
                        "name": "五大连池市",
                        "sub": []
                    },
                    {
                        "id": 1457,
                        "name": "北安市",
                        "sub": []
                    },
                    {
                        "id": 1458,
                        "name": "嫩江县",
                        "sub": []
                    },
                    {
                        "id": 1459,
                        "name": "逊克县",
                        "sub": []
                    },
                    {
                        "id": 1460,
                        "name": "孙吴县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 172,
                "name": "鸡西",
                "sub": [
                    {
                        "id": 1461,
                        "name": "鸡冠区",
                        "sub": []
                    },
                    {
                        "id": 1462,
                        "name": "恒山区",
                        "sub": []
                    },
                    {
                        "id": 1463,
                        "name": "城子河区",
                        "sub": []
                    },
                    {
                        "id": 1464,
                        "name": "滴道区",
                        "sub": []
                    },
                    {
                        "id": 1465,
                        "name": "梨树区",
                        "sub": []
                    },
                    {
                        "id": 1466,
                        "name": "虎林市",
                        "sub": []
                    },
                    {
                        "id": 1467,
                        "name": "密山市",
                        "sub": []
                    },
                    {
                        "id": 1468,
                        "name": "鸡东县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 173,
                "name": "佳木斯",
                "sub": [
                    {
                        "id": 1469,
                        "name": "前进区",
                        "sub": []
                    },
                    {
                        "id": 1470,
                        "name": "郊区",
                        "sub": []
                    },
                    {
                        "id": 1471,
                        "name": "向阳区",
                        "sub": []
                    },
                    {
                        "id": 1472,
                        "name": "东风区",
                        "sub": []
                    },
                    {
                        "id": 1473,
                        "name": "同江市",
                        "sub": []
                    },
                    {
                        "id": 1474,
                        "name": "富锦市",
                        "sub": []
                    },
                    {
                        "id": 1475,
                        "name": "桦南县",
                        "sub": []
                    },
                    {
                        "id": 1476,
                        "name": "桦川县",
                        "sub": []
                    },
                    {
                        "id": 1477,
                        "name": "汤原县",
                        "sub": []
                    },
                    {
                        "id": 1478,
                        "name": "抚远县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 174,
                "name": "牡丹江",
                "sub": [
                    {
                        "id": 1479,
                        "name": "爱民区",
                        "sub": []
                    },
                    {
                        "id": 1480,
                        "name": "东安区",
                        "sub": []
                    },
                    {
                        "id": 1481,
                        "name": "阳明区",
                        "sub": []
                    },
                    {
                        "id": 1482,
                        "name": "西安区",
                        "sub": []
                    },
                    {
                        "id": 1483,
                        "name": "绥芬河市",
                        "sub": []
                    },
                    {
                        "id": 1484,
                        "name": "海林市",
                        "sub": []
                    },
                    {
                        "id": 1485,
                        "name": "宁安市",
                        "sub": []
                    },
                    {
                        "id": 1486,
                        "name": "穆棱市",
                        "sub": []
                    },
                    {
                        "id": 1487,
                        "name": "东宁县",
                        "sub": []
                    },
                    {
                        "id": 1488,
                        "name": "林口县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 175,
                "name": "七台河",
                "sub": [
                    {
                        "id": 1489,
                        "name": "桃山区",
                        "sub": []
                    },
                    {
                        "id": 1490,
                        "name": "新兴区",
                        "sub": []
                    },
                    {
                        "id": 1491,
                        "name": "茄子河区",
                        "sub": []
                    },
                    {
                        "id": 1492,
                        "name": "勃利县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 176,
                "name": "齐齐哈尔",
                "sub": [
                    {
                        "id": 1493,
                        "name": "龙沙区",
                        "sub": []
                    },
                    {
                        "id": 1494,
                        "name": "昂昂溪区",
                        "sub": []
                    },
                    {
                        "id": 1495,
                        "name": "铁峰区",
                        "sub": []
                    },
                    {
                        "id": 1496,
                        "name": "建华区",
                        "sub": []
                    },
                    {
                        "id": 1497,
                        "name": "富拉尔基区",
                        "sub": []
                    },
                    {
                        "id": 1498,
                        "name": "碾子山区",
                        "sub": []
                    },
                    {
                        "id": 1499,
                        "name": "梅里斯达斡尔区",
                        "sub": []
                    },
                    {
                        "id": 1500,
                        "name": "讷河市",
                        "sub": []
                    },
                    {
                        "id": 1501,
                        "name": "龙江县",
                        "sub": []
                    },
                    {
                        "id": 1502,
                        "name": "依安县",
                        "sub": []
                    },
                    {
                        "id": 1503,
                        "name": "泰来县",
                        "sub": []
                    },
                    {
                        "id": 1504,
                        "name": "甘南县",
                        "sub": []
                    },
                    {
                        "id": 1505,
                        "name": "富裕县",
                        "sub": []
                    },
                    {
                        "id": 1506,
                        "name": "克山县",
                        "sub": []
                    },
                    {
                        "id": 1507,
                        "name": "克东县",
                        "sub": []
                    },
                    {
                        "id": 1508,
                        "name": "拜泉县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 177,
                "name": "双鸭山",
                "sub": [
                    {
                        "id": 1509,
                        "name": "尖山区",
                        "sub": []
                    },
                    {
                        "id": 1510,
                        "name": "岭东区",
                        "sub": []
                    },
                    {
                        "id": 1511,
                        "name": "四方台区",
                        "sub": []
                    },
                    {
                        "id": 1512,
                        "name": "宝山区",
                        "sub": []
                    },
                    {
                        "id": 1513,
                        "name": "集贤县",
                        "sub": []
                    },
                    {
                        "id": 1514,
                        "name": "友谊县",
                        "sub": []
                    },
                    {
                        "id": 1515,
                        "name": "宝清县",
                        "sub": []
                    },
                    {
                        "id": 1516,
                        "name": "饶河县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 178,
                "name": "绥化",
                "sub": [
                    {
                        "id": 1517,
                        "name": "北林区",
                        "sub": []
                    },
                    {
                        "id": 1518,
                        "name": "安达市",
                        "sub": []
                    },
                    {
                        "id": 1519,
                        "name": "肇东市",
                        "sub": []
                    },
                    {
                        "id": 1520,
                        "name": "海伦市",
                        "sub": []
                    },
                    {
                        "id": 1521,
                        "name": "望奎县",
                        "sub": []
                    },
                    {
                        "id": 1522,
                        "name": "兰西县",
                        "sub": []
                    },
                    {
                        "id": 1523,
                        "name": "青冈县",
                        "sub": []
                    },
                    {
                        "id": 1524,
                        "name": "庆安县",
                        "sub": []
                    },
                    {
                        "id": 1525,
                        "name": "明水县",
                        "sub": []
                    },
                    {
                        "id": 1526,
                        "name": "绥棱县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 179,
                "name": "伊春",
                "sub": [
                    {
                        "id": 1527,
                        "name": "伊春区",
                        "sub": []
                    },
                    {
                        "id": 1528,
                        "name": "带岭区",
                        "sub": []
                    },
                    {
                        "id": 1529,
                        "name": "南岔区",
                        "sub": []
                    },
                    {
                        "id": 1530,
                        "name": "金山屯区",
                        "sub": []
                    },
                    {
                        "id": 1531,
                        "name": "西林区",
                        "sub": []
                    },
                    {
                        "id": 1532,
                        "name": "美溪区",
                        "sub": []
                    },
                    {
                        "id": 1533,
                        "name": "乌马河区",
                        "sub": []
                    },
                    {
                        "id": 1534,
                        "name": "翠峦区",
                        "sub": []
                    },
                    {
                        "id": 1535,
                        "name": "友好区",
                        "sub": []
                    },
                    {
                        "id": 1536,
                        "name": "上甘岭区",
                        "sub": []
                    },
                    {
                        "id": 1537,
                        "name": "五营区",
                        "sub": []
                    },
                    {
                        "id": 1538,
                        "name": "红星区",
                        "sub": []
                    },
                    {
                        "id": 1539,
                        "name": "新青区",
                        "sub": []
                    },
                    {
                        "id": 1540,
                        "name": "汤旺河区",
                        "sub": []
                    },
                    {
                        "id": 1541,
                        "name": "乌伊岭区",
                        "sub": []
                    },
                    {
                        "id": 1542,
                        "name": "铁力市",
                        "sub": []
                    },
                    {
                        "id": 1543,
                        "name": "嘉荫县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 13,
        "name": "湖北",
        "sub": [
            {
                "id": 180,
                "name": "武汉",
                "sub": [
                    {
                        "id": 1544,
                        "name": "江岸区",
                        "sub": []
                    },
                    {
                        "id": 1545,
                        "name": "武昌区",
                        "sub": []
                    },
                    {
                        "id": 1546,
                        "name": "江汉区",
                        "sub": []
                    },
                    {
                        "id": 1547,
                        "name": "硚口区",
                        "sub": []
                    },
                    {
                        "id": 1548,
                        "name": "汉阳区",
                        "sub": []
                    },
                    {
                        "id": 1549,
                        "name": "青山区",
                        "sub": []
                    },
                    {
                        "id": 1550,
                        "name": "洪山区",
                        "sub": []
                    },
                    {
                        "id": 1551,
                        "name": "东西湖区",
                        "sub": []
                    },
                    {
                        "id": 1552,
                        "name": "汉南区",
                        "sub": []
                    },
                    {
                        "id": 1553,
                        "name": "蔡甸区",
                        "sub": []
                    },
                    {
                        "id": 1554,
                        "name": "江夏区",
                        "sub": []
                    },
                    {
                        "id": 1555,
                        "name": "黄陂区",
                        "sub": []
                    },
                    {
                        "id": 1556,
                        "name": "新洲区",
                        "sub": []
                    },
                    {
                        "id": 1557,
                        "name": "经济开发区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 181,
                "name": "仙桃",
                "sub": [
                    {
                        "id": 1558,
                        "name": "仙桃市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 182,
                "name": "鄂州",
                "sub": [
                    {
                        "id": 1559,
                        "name": "鄂城区",
                        "sub": []
                    },
                    {
                        "id": 1560,
                        "name": "华容区",
                        "sub": []
                    },
                    {
                        "id": 1561,
                        "name": "梁子湖区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 183,
                "name": "黄冈",
                "sub": [
                    {
                        "id": 1562,
                        "name": "黄州区",
                        "sub": []
                    },
                    {
                        "id": 1563,
                        "name": "麻城市",
                        "sub": []
                    },
                    {
                        "id": 1564,
                        "name": "武穴市",
                        "sub": []
                    },
                    {
                        "id": 1565,
                        "name": "团风县",
                        "sub": []
                    },
                    {
                        "id": 1566,
                        "name": "红安县",
                        "sub": []
                    },
                    {
                        "id": 1567,
                        "name": "罗田县",
                        "sub": []
                    },
                    {
                        "id": 1568,
                        "name": "英山县",
                        "sub": []
                    },
                    {
                        "id": 1569,
                        "name": "浠水县",
                        "sub": []
                    },
                    {
                        "id": 1570,
                        "name": "蕲春县",
                        "sub": []
                    },
                    {
                        "id": 1571,
                        "name": "黄梅县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 184,
                "name": "黄石",
                "sub": [
                    {
                        "id": 1572,
                        "name": "黄石港区",
                        "sub": []
                    },
                    {
                        "id": 1573,
                        "name": "西塞山区",
                        "sub": []
                    },
                    {
                        "id": 1574,
                        "name": "下陆区",
                        "sub": []
                    },
                    {
                        "id": 1575,
                        "name": "铁山区",
                        "sub": []
                    },
                    {
                        "id": 1576,
                        "name": "大冶市",
                        "sub": []
                    },
                    {
                        "id": 1577,
                        "name": "阳新县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 185,
                "name": "荆门",
                "sub": [
                    {
                        "id": 1578,
                        "name": "东宝区",
                        "sub": []
                    },
                    {
                        "id": 1579,
                        "name": "掇刀区",
                        "sub": []
                    },
                    {
                        "id": 1580,
                        "name": "钟祥市",
                        "sub": []
                    },
                    {
                        "id": 1581,
                        "name": "京山县",
                        "sub": []
                    },
                    {
                        "id": 1582,
                        "name": "沙洋县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 186,
                "name": "荆州",
                "sub": [
                    {
                        "id": 1583,
                        "name": "沙市区",
                        "sub": []
                    },
                    {
                        "id": 1584,
                        "name": "荆州区",
                        "sub": []
                    },
                    {
                        "id": 1585,
                        "name": "石首市",
                        "sub": []
                    },
                    {
                        "id": 1586,
                        "name": "洪湖市",
                        "sub": []
                    },
                    {
                        "id": 1587,
                        "name": "松滋市",
                        "sub": []
                    },
                    {
                        "id": 1588,
                        "name": "公安县",
                        "sub": []
                    },
                    {
                        "id": 1589,
                        "name": "监利县",
                        "sub": []
                    },
                    {
                        "id": 1590,
                        "name": "江陵县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 187,
                "name": "潜江",
                "sub": [
                    {
                        "id": 1591,
                        "name": "潜江市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 188,
                "name": "神农架林区",
                "sub": [
                    {
                        "id": 1592,
                        "name": "神农架林区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 189,
                "name": "十堰",
                "sub": [
                    {
                        "id": 1593,
                        "name": "张湾区",
                        "sub": []
                    },
                    {
                        "id": 1594,
                        "name": "茅箭区",
                        "sub": []
                    },
                    {
                        "id": 1595,
                        "name": "丹江口市",
                        "sub": []
                    },
                    {
                        "id": 1596,
                        "name": "郧县",
                        "sub": []
                    },
                    {
                        "id": 1597,
                        "name": "郧西县",
                        "sub": []
                    },
                    {
                        "id": 1598,
                        "name": "竹山县",
                        "sub": []
                    },
                    {
                        "id": 1599,
                        "name": "竹溪县",
                        "sub": []
                    },
                    {
                        "id": 1600,
                        "name": "房县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 190,
                "name": "随州",
                "sub": [
                    {
                        "id": 1601,
                        "name": "曾都区",
                        "sub": []
                    },
                    {
                        "id": 1602,
                        "name": "广水市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 191,
                "name": "天门",
                "sub": [
                    {
                        "id": 1603,
                        "name": "天门市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 192,
                "name": "咸宁",
                "sub": [
                    {
                        "id": 1604,
                        "name": "咸安区",
                        "sub": []
                    },
                    {
                        "id": 1605,
                        "name": "赤壁市",
                        "sub": []
                    },
                    {
                        "id": 1606,
                        "name": "嘉鱼县",
                        "sub": []
                    },
                    {
                        "id": 1607,
                        "name": "通城县",
                        "sub": []
                    },
                    {
                        "id": 1608,
                        "name": "崇阳县",
                        "sub": []
                    },
                    {
                        "id": 1609,
                        "name": "通山县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 193,
                "name": "襄樊",
                "sub": [
                    {
                        "id": 1610,
                        "name": "襄城区",
                        "sub": []
                    },
                    {
                        "id": 1611,
                        "name": "樊城区",
                        "sub": []
                    },
                    {
                        "id": 1612,
                        "name": "襄阳区",
                        "sub": []
                    },
                    {
                        "id": 1613,
                        "name": "老河口市",
                        "sub": []
                    },
                    {
                        "id": 1614,
                        "name": "枣阳市",
                        "sub": []
                    },
                    {
                        "id": 1615,
                        "name": "宜城市",
                        "sub": []
                    },
                    {
                        "id": 1616,
                        "name": "南漳县",
                        "sub": []
                    },
                    {
                        "id": 1617,
                        "name": "谷城县",
                        "sub": []
                    },
                    {
                        "id": 1618,
                        "name": "保康县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 194,
                "name": "孝感",
                "sub": [
                    {
                        "id": 1619,
                        "name": "孝南区",
                        "sub": []
                    },
                    {
                        "id": 1620,
                        "name": "应城市",
                        "sub": []
                    },
                    {
                        "id": 1621,
                        "name": "安陆市",
                        "sub": []
                    },
                    {
                        "id": 1622,
                        "name": "汉川市",
                        "sub": []
                    },
                    {
                        "id": 1623,
                        "name": "孝昌县",
                        "sub": []
                    },
                    {
                        "id": 1624,
                        "name": "大悟县",
                        "sub": []
                    },
                    {
                        "id": 1625,
                        "name": "云梦县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 195,
                "name": "宜昌",
                "sub": [
                    {
                        "id": 1626,
                        "name": "长阳",
                        "sub": []
                    },
                    {
                        "id": 1627,
                        "name": "五峰",
                        "sub": []
                    },
                    {
                        "id": 1628,
                        "name": "西陵区",
                        "sub": []
                    },
                    {
                        "id": 1629,
                        "name": "伍家岗区",
                        "sub": []
                    },
                    {
                        "id": 1630,
                        "name": "点军区",
                        "sub": []
                    },
                    {
                        "id": 1631,
                        "name": "猇亭区",
                        "sub": []
                    },
                    {
                        "id": 1632,
                        "name": "夷陵区",
                        "sub": []
                    },
                    {
                        "id": 1633,
                        "name": "宜都市",
                        "sub": []
                    },
                    {
                        "id": 1634,
                        "name": "当阳市",
                        "sub": []
                    },
                    {
                        "id": 1635,
                        "name": "枝江市",
                        "sub": []
                    },
                    {
                        "id": 1636,
                        "name": "远安县",
                        "sub": []
                    },
                    {
                        "id": 1637,
                        "name": "兴山县",
                        "sub": []
                    },
                    {
                        "id": 1638,
                        "name": "秭归县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 196,
                "name": "恩施",
                "sub": [
                    {
                        "id": 1639,
                        "name": "恩施市",
                        "sub": []
                    },
                    {
                        "id": 1640,
                        "name": "利川市",
                        "sub": []
                    },
                    {
                        "id": 1641,
                        "name": "建始县",
                        "sub": []
                    },
                    {
                        "id": 1642,
                        "name": "巴东县",
                        "sub": []
                    },
                    {
                        "id": 1643,
                        "name": "宣恩县",
                        "sub": []
                    },
                    {
                        "id": 1644,
                        "name": "咸丰县",
                        "sub": []
                    },
                    {
                        "id": 1645,
                        "name": "来凤县",
                        "sub": []
                    },
                    {
                        "id": 1646,
                        "name": "鹤峰县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 14,
        "name": "湖南",
        "sub": [
            {
                "id": 197,
                "name": "长沙",
                "sub": [
                    {
                        "id": 1647,
                        "name": "岳麓区",
                        "sub": []
                    },
                    {
                        "id": 1648,
                        "name": "芙蓉区",
                        "sub": []
                    },
                    {
                        "id": 1649,
                        "name": "天心区",
                        "sub": []
                    },
                    {
                        "id": 1650,
                        "name": "开福区",
                        "sub": []
                    },
                    {
                        "id": 1651,
                        "name": "雨花区",
                        "sub": []
                    },
                    {
                        "id": 1652,
                        "name": "开发区",
                        "sub": []
                    },
                    {
                        "id": 1653,
                        "name": "浏阳市",
                        "sub": []
                    },
                    {
                        "id": 1654,
                        "name": "长沙县",
                        "sub": []
                    },
                    {
                        "id": 1655,
                        "name": "望城县",
                        "sub": []
                    },
                    {
                        "id": 1656,
                        "name": "宁乡县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 198,
                "name": "张家界",
                "sub": [
                    {
                        "id": 1657,
                        "name": "永定区",
                        "sub": []
                    },
                    {
                        "id": 1658,
                        "name": "武陵源区",
                        "sub": []
                    },
                    {
                        "id": 1659,
                        "name": "慈利县",
                        "sub": []
                    },
                    {
                        "id": 1660,
                        "name": "桑植县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 199,
                "name": "常德",
                "sub": [
                    {
                        "id": 1661,
                        "name": "武陵区",
                        "sub": []
                    },
                    {
                        "id": 1662,
                        "name": "鼎城区",
                        "sub": []
                    },
                    {
                        "id": 1663,
                        "name": "津市市",
                        "sub": []
                    },
                    {
                        "id": 1664,
                        "name": "安乡县",
                        "sub": []
                    },
                    {
                        "id": 1665,
                        "name": "汉寿县",
                        "sub": []
                    },
                    {
                        "id": 1666,
                        "name": "澧县",
                        "sub": []
                    },
                    {
                        "id": 1667,
                        "name": "临澧县",
                        "sub": []
                    },
                    {
                        "id": 1668,
                        "name": "桃源县",
                        "sub": []
                    },
                    {
                        "id": 1669,
                        "name": "石门县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 200,
                "name": "郴州",
                "sub": [
                    {
                        "id": 1670,
                        "name": "北湖区",
                        "sub": []
                    },
                    {
                        "id": 1671,
                        "name": "苏仙区",
                        "sub": []
                    },
                    {
                        "id": 1672,
                        "name": "资兴市",
                        "sub": []
                    },
                    {
                        "id": 1673,
                        "name": "桂阳县",
                        "sub": []
                    },
                    {
                        "id": 1674,
                        "name": "宜章县",
                        "sub": []
                    },
                    {
                        "id": 1675,
                        "name": "永兴县",
                        "sub": []
                    },
                    {
                        "id": 1676,
                        "name": "嘉禾县",
                        "sub": []
                    },
                    {
                        "id": 1677,
                        "name": "临武县",
                        "sub": []
                    },
                    {
                        "id": 1678,
                        "name": "汝城县",
                        "sub": []
                    },
                    {
                        "id": 1679,
                        "name": "桂东县",
                        "sub": []
                    },
                    {
                        "id": 1680,
                        "name": "安仁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 201,
                "name": "衡阳",
                "sub": [
                    {
                        "id": 1681,
                        "name": "雁峰区",
                        "sub": []
                    },
                    {
                        "id": 1682,
                        "name": "珠晖区",
                        "sub": []
                    },
                    {
                        "id": 1683,
                        "name": "石鼓区",
                        "sub": []
                    },
                    {
                        "id": 1684,
                        "name": "蒸湘区",
                        "sub": []
                    },
                    {
                        "id": 1685,
                        "name": "南岳区",
                        "sub": []
                    },
                    {
                        "id": 1686,
                        "name": "耒阳市",
                        "sub": []
                    },
                    {
                        "id": 1687,
                        "name": "常宁市",
                        "sub": []
                    },
                    {
                        "id": 1688,
                        "name": "衡阳县",
                        "sub": []
                    },
                    {
                        "id": 1689,
                        "name": "衡南县",
                        "sub": []
                    },
                    {
                        "id": 1690,
                        "name": "衡山县",
                        "sub": []
                    },
                    {
                        "id": 1691,
                        "name": "衡东县",
                        "sub": []
                    },
                    {
                        "id": 1692,
                        "name": "祁东县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 202,
                "name": "怀化",
                "sub": [
                    {
                        "id": 1693,
                        "name": "鹤城区",
                        "sub": []
                    },
                    {
                        "id": 1694,
                        "name": "靖州",
                        "sub": []
                    },
                    {
                        "id": 1695,
                        "name": "麻阳",
                        "sub": []
                    },
                    {
                        "id": 1696,
                        "name": "通道",
                        "sub": []
                    },
                    {
                        "id": 1697,
                        "name": "新晃",
                        "sub": []
                    },
                    {
                        "id": 1698,
                        "name": "芷江",
                        "sub": []
                    },
                    {
                        "id": 1699,
                        "name": "沅陵县",
                        "sub": []
                    },
                    {
                        "id": 1700,
                        "name": "辰溪县",
                        "sub": []
                    },
                    {
                        "id": 1701,
                        "name": "溆浦县",
                        "sub": []
                    },
                    {
                        "id": 1702,
                        "name": "中方县",
                        "sub": []
                    },
                    {
                        "id": 1703,
                        "name": "会同县",
                        "sub": []
                    },
                    {
                        "id": 1704,
                        "name": "洪江市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 203,
                "name": "娄底",
                "sub": [
                    {
                        "id": 1705,
                        "name": "娄星区",
                        "sub": []
                    },
                    {
                        "id": 1706,
                        "name": "冷水江市",
                        "sub": []
                    },
                    {
                        "id": 1707,
                        "name": "涟源市",
                        "sub": []
                    },
                    {
                        "id": 1708,
                        "name": "双峰县",
                        "sub": []
                    },
                    {
                        "id": 1709,
                        "name": "新化县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 204,
                "name": "邵阳",
                "sub": [
                    {
                        "id": 1710,
                        "name": "城步",
                        "sub": []
                    },
                    {
                        "id": 1711,
                        "name": "双清区",
                        "sub": []
                    },
                    {
                        "id": 1712,
                        "name": "大祥区",
                        "sub": []
                    },
                    {
                        "id": 1713,
                        "name": "北塔区",
                        "sub": []
                    },
                    {
                        "id": 1714,
                        "name": "武冈市",
                        "sub": []
                    },
                    {
                        "id": 1715,
                        "name": "邵东县",
                        "sub": []
                    },
                    {
                        "id": 1716,
                        "name": "新邵县",
                        "sub": []
                    },
                    {
                        "id": 1717,
                        "name": "邵阳县",
                        "sub": []
                    },
                    {
                        "id": 1718,
                        "name": "隆回县",
                        "sub": []
                    },
                    {
                        "id": 1719,
                        "name": "洞口县",
                        "sub": []
                    },
                    {
                        "id": 1720,
                        "name": "绥宁县",
                        "sub": []
                    },
                    {
                        "id": 1721,
                        "name": "新宁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 205,
                "name": "湘潭",
                "sub": [
                    {
                        "id": 1722,
                        "name": "岳塘区",
                        "sub": []
                    },
                    {
                        "id": 1723,
                        "name": "雨湖区",
                        "sub": []
                    },
                    {
                        "id": 1724,
                        "name": "湘乡市",
                        "sub": []
                    },
                    {
                        "id": 1725,
                        "name": "韶山市",
                        "sub": []
                    },
                    {
                        "id": 1726,
                        "name": "湘潭县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 206,
                "name": "湘西",
                "sub": [
                    {
                        "id": 1727,
                        "name": "吉首市",
                        "sub": []
                    },
                    {
                        "id": 1728,
                        "name": "泸溪县",
                        "sub": []
                    },
                    {
                        "id": 1729,
                        "name": "凤凰县",
                        "sub": []
                    },
                    {
                        "id": 1730,
                        "name": "花垣县",
                        "sub": []
                    },
                    {
                        "id": 1731,
                        "name": "保靖县",
                        "sub": []
                    },
                    {
                        "id": 1732,
                        "name": "古丈县",
                        "sub": []
                    },
                    {
                        "id": 1733,
                        "name": "永顺县",
                        "sub": []
                    },
                    {
                        "id": 1734,
                        "name": "龙山县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 207,
                "name": "益阳",
                "sub": [
                    {
                        "id": 1735,
                        "name": "赫山区",
                        "sub": []
                    },
                    {
                        "id": 1736,
                        "name": "资阳区",
                        "sub": []
                    },
                    {
                        "id": 1737,
                        "name": "沅江市",
                        "sub": []
                    },
                    {
                        "id": 1738,
                        "name": "南县",
                        "sub": []
                    },
                    {
                        "id": 1739,
                        "name": "桃江县",
                        "sub": []
                    },
                    {
                        "id": 1740,
                        "name": "安化县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 208,
                "name": "永州",
                "sub": [
                    {
                        "id": 1741,
                        "name": "江华",
                        "sub": []
                    },
                    {
                        "id": 1742,
                        "name": "冷水滩区",
                        "sub": []
                    },
                    {
                        "id": 1743,
                        "name": "零陵区",
                        "sub": []
                    },
                    {
                        "id": 1744,
                        "name": "祁阳县",
                        "sub": []
                    },
                    {
                        "id": 1745,
                        "name": "东安县",
                        "sub": []
                    },
                    {
                        "id": 1746,
                        "name": "双牌县",
                        "sub": []
                    },
                    {
                        "id": 1747,
                        "name": "道县",
                        "sub": []
                    },
                    {
                        "id": 1748,
                        "name": "江永县",
                        "sub": []
                    },
                    {
                        "id": 1749,
                        "name": "宁远县",
                        "sub": []
                    },
                    {
                        "id": 1750,
                        "name": "蓝山县",
                        "sub": []
                    },
                    {
                        "id": 1751,
                        "name": "新田县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 209,
                "name": "岳阳",
                "sub": [
                    {
                        "id": 1752,
                        "name": "岳阳楼区",
                        "sub": []
                    },
                    {
                        "id": 1753,
                        "name": "君山区",
                        "sub": []
                    },
                    {
                        "id": 1754,
                        "name": "云溪区",
                        "sub": []
                    },
                    {
                        "id": 1755,
                        "name": "汨罗市",
                        "sub": []
                    },
                    {
                        "id": 1756,
                        "name": "临湘市",
                        "sub": []
                    },
                    {
                        "id": 1757,
                        "name": "岳阳县",
                        "sub": []
                    },
                    {
                        "id": 1758,
                        "name": "华容县",
                        "sub": []
                    },
                    {
                        "id": 1759,
                        "name": "湘阴县",
                        "sub": []
                    },
                    {
                        "id": 1760,
                        "name": "平江县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 210,
                "name": "株洲",
                "sub": [
                    {
                        "id": 1761,
                        "name": "天元区",
                        "sub": []
                    },
                    {
                        "id": 1762,
                        "name": "荷塘区",
                        "sub": []
                    },
                    {
                        "id": 1763,
                        "name": "芦淞区",
                        "sub": []
                    },
                    {
                        "id": 1764,
                        "name": "石峰区",
                        "sub": []
                    },
                    {
                        "id": 1765,
                        "name": "醴陵市",
                        "sub": []
                    },
                    {
                        "id": 1766,
                        "name": "株洲县",
                        "sub": []
                    },
                    {
                        "id": 1767,
                        "name": "攸县",
                        "sub": []
                    },
                    {
                        "id": 1768,
                        "name": "茶陵县",
                        "sub": []
                    },
                    {
                        "id": 1769,
                        "name": "炎陵县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 15,
        "name": "吉林",
        "sub": [
            {
                "id": 211,
                "name": "长春",
                "sub": [
                    {
                        "id": 1770,
                        "name": "朝阳区",
                        "sub": []
                    },
                    {
                        "id": 1771,
                        "name": "宽城区",
                        "sub": []
                    },
                    {
                        "id": 1772,
                        "name": "二道区",
                        "sub": []
                    },
                    {
                        "id": 1773,
                        "name": "南关区",
                        "sub": []
                    },
                    {
                        "id": 1774,
                        "name": "绿园区",
                        "sub": []
                    },
                    {
                        "id": 1775,
                        "name": "双阳区",
                        "sub": []
                    },
                    {
                        "id": 1776,
                        "name": "净月潭开发区",
                        "sub": []
                    },
                    {
                        "id": 1777,
                        "name": "高新技术开发区",
                        "sub": []
                    },
                    {
                        "id": 1778,
                        "name": "经济技术开发区",
                        "sub": []
                    },
                    {
                        "id": 1779,
                        "name": "汽车产业开发区",
                        "sub": []
                    },
                    {
                        "id": 1780,
                        "name": "德惠市",
                        "sub": []
                    },
                    {
                        "id": 1781,
                        "name": "九台市",
                        "sub": []
                    },
                    {
                        "id": 1782,
                        "name": "榆树市",
                        "sub": []
                    },
                    {
                        "id": 1783,
                        "name": "农安县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 212,
                "name": "吉林",
                "sub": [
                    {
                        "id": 1784,
                        "name": "船营区",
                        "sub": []
                    },
                    {
                        "id": 1785,
                        "name": "昌邑区",
                        "sub": []
                    },
                    {
                        "id": 1786,
                        "name": "龙潭区",
                        "sub": []
                    },
                    {
                        "id": 1787,
                        "name": "丰满区",
                        "sub": []
                    },
                    {
                        "id": 1788,
                        "name": "蛟河市",
                        "sub": []
                    },
                    {
                        "id": 1789,
                        "name": "桦甸市",
                        "sub": []
                    },
                    {
                        "id": 1790,
                        "name": "舒兰市",
                        "sub": []
                    },
                    {
                        "id": 1791,
                        "name": "磐石市",
                        "sub": []
                    },
                    {
                        "id": 1792,
                        "name": "永吉县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 213,
                "name": "白城",
                "sub": [
                    {
                        "id": 1793,
                        "name": "洮北区",
                        "sub": []
                    },
                    {
                        "id": 1794,
                        "name": "洮南市",
                        "sub": []
                    },
                    {
                        "id": 1795,
                        "name": "大安市",
                        "sub": []
                    },
                    {
                        "id": 1796,
                        "name": "镇赉县",
                        "sub": []
                    },
                    {
                        "id": 1797,
                        "name": "通榆县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 214,
                "name": "白山",
                "sub": [
                    {
                        "id": 1798,
                        "name": "江源区",
                        "sub": []
                    },
                    {
                        "id": 1799,
                        "name": "八道江区",
                        "sub": []
                    },
                    {
                        "id": 1800,
                        "name": "长白",
                        "sub": []
                    },
                    {
                        "id": 1801,
                        "name": "临江市",
                        "sub": []
                    },
                    {
                        "id": 1802,
                        "name": "抚松县",
                        "sub": []
                    },
                    {
                        "id": 1803,
                        "name": "靖宇县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 215,
                "name": "辽源",
                "sub": [
                    {
                        "id": 1804,
                        "name": "龙山区",
                        "sub": []
                    },
                    {
                        "id": 1805,
                        "name": "西安区",
                        "sub": []
                    },
                    {
                        "id": 1806,
                        "name": "东丰县",
                        "sub": []
                    },
                    {
                        "id": 1807,
                        "name": "东辽县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 216,
                "name": "四平",
                "sub": [
                    {
                        "id": 1808,
                        "name": "铁西区",
                        "sub": []
                    },
                    {
                        "id": 1809,
                        "name": "铁东区",
                        "sub": []
                    },
                    {
                        "id": 1810,
                        "name": "伊通",
                        "sub": []
                    },
                    {
                        "id": 1811,
                        "name": "公主岭市",
                        "sub": []
                    },
                    {
                        "id": 1812,
                        "name": "双辽市",
                        "sub": []
                    },
                    {
                        "id": 1813,
                        "name": "梨树县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 217,
                "name": "松原",
                "sub": [
                    {
                        "id": 1814,
                        "name": "前郭尔罗斯",
                        "sub": []
                    },
                    {
                        "id": 1815,
                        "name": "宁江区",
                        "sub": []
                    },
                    {
                        "id": 1816,
                        "name": "长岭县",
                        "sub": []
                    },
                    {
                        "id": 1817,
                        "name": "乾安县",
                        "sub": []
                    },
                    {
                        "id": 1818,
                        "name": "扶余县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 218,
                "name": "通化",
                "sub": [
                    {
                        "id": 1819,
                        "name": "东昌区",
                        "sub": []
                    },
                    {
                        "id": 1820,
                        "name": "二道江区",
                        "sub": []
                    },
                    {
                        "id": 1821,
                        "name": "梅河口市",
                        "sub": []
                    },
                    {
                        "id": 1822,
                        "name": "集安市",
                        "sub": []
                    },
                    {
                        "id": 1823,
                        "name": "通化县",
                        "sub": []
                    },
                    {
                        "id": 1824,
                        "name": "辉南县",
                        "sub": []
                    },
                    {
                        "id": 1825,
                        "name": "柳河县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 219,
                "name": "延边",
                "sub": [
                    {
                        "id": 1826,
                        "name": "延吉市",
                        "sub": []
                    },
                    {
                        "id": 1827,
                        "name": "图们市",
                        "sub": []
                    },
                    {
                        "id": 1828,
                        "name": "敦化市",
                        "sub": []
                    },
                    {
                        "id": 1829,
                        "name": "珲春市",
                        "sub": []
                    },
                    {
                        "id": 1830,
                        "name": "龙井市",
                        "sub": []
                    },
                    {
                        "id": 1831,
                        "name": "和龙市",
                        "sub": []
                    },
                    {
                        "id": 1832,
                        "name": "安图县",
                        "sub": []
                    },
                    {
                        "id": 1833,
                        "name": "汪清县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 16,
        "name": "江苏",
        "sub": [
            {
                "id": 220,
                "name": "南京",
                "sub": [
                    {
                        "id": 1834,
                        "name": "玄武区",
                        "sub": []
                    },
                    {
                        "id": 1835,
                        "name": "鼓楼区",
                        "sub": []
                    },
                    {
                        "id": 1836,
                        "name": "白下区",
                        "sub": []
                    },
                    {
                        "id": 1837,
                        "name": "建邺区",
                        "sub": []
                    },
                    {
                        "id": 1838,
                        "name": "秦淮区",
                        "sub": []
                    },
                    {
                        "id": 1839,
                        "name": "雨花台区",
                        "sub": []
                    },
                    {
                        "id": 1840,
                        "name": "下关区",
                        "sub": []
                    },
                    {
                        "id": 1841,
                        "name": "栖霞区",
                        "sub": []
                    },
                    {
                        "id": 1842,
                        "name": "浦口区",
                        "sub": []
                    },
                    {
                        "id": 1843,
                        "name": "江宁区",
                        "sub": []
                    },
                    {
                        "id": 1844,
                        "name": "六合区",
                        "sub": []
                    },
                    {
                        "id": 1845,
                        "name": "溧水县",
                        "sub": []
                    },
                    {
                        "id": 1846,
                        "name": "高淳县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 221,
                "name": "苏州",
                "sub": [
                    {
                        "id": 1847,
                        "name": "沧浪区",
                        "sub": []
                    },
                    {
                        "id": 1848,
                        "name": "金阊区",
                        "sub": []
                    },
                    {
                        "id": 1849,
                        "name": "平江区",
                        "sub": []
                    },
                    {
                        "id": 1850,
                        "name": "虎丘区",
                        "sub": []
                    },
                    {
                        "id": 1851,
                        "name": "吴中区",
                        "sub": []
                    },
                    {
                        "id": 1852,
                        "name": "相城区",
                        "sub": []
                    },
                    {
                        "id": 1853,
                        "name": "园区",
                        "sub": []
                    },
                    {
                        "id": 1854,
                        "name": "新区",
                        "sub": []
                    },
                    {
                        "id": 1855,
                        "name": "常熟市",
                        "sub": []
                    },
                    {
                        "id": 1856,
                        "name": "张家港市",
                        "sub": []
                    },
                    {
                        "id": 1857,
                        "name": "玉山镇",
                        "sub": []
                    },
                    {
                        "id": 1858,
                        "name": "巴城镇",
                        "sub": []
                    },
                    {
                        "id": 1859,
                        "name": "周市镇",
                        "sub": []
                    },
                    {
                        "id": 1860,
                        "name": "陆家镇",
                        "sub": []
                    },
                    {
                        "id": 1861,
                        "name": "花桥镇",
                        "sub": []
                    },
                    {
                        "id": 1862,
                        "name": "淀山湖镇",
                        "sub": []
                    },
                    {
                        "id": 1863,
                        "name": "张浦镇",
                        "sub": []
                    },
                    {
                        "id": 1864,
                        "name": "周庄镇",
                        "sub": []
                    },
                    {
                        "id": 1865,
                        "name": "千灯镇",
                        "sub": []
                    },
                    {
                        "id": 1866,
                        "name": "锦溪镇",
                        "sub": []
                    },
                    {
                        "id": 1867,
                        "name": "开发区",
                        "sub": []
                    },
                    {
                        "id": 1868,
                        "name": "吴江市",
                        "sub": []
                    },
                    {
                        "id": 1869,
                        "name": "太仓市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 222,
                "name": "无锡",
                "sub": [
                    {
                        "id": 1870,
                        "name": "崇安区",
                        "sub": []
                    },
                    {
                        "id": 1871,
                        "name": "北塘区",
                        "sub": []
                    },
                    {
                        "id": 1872,
                        "name": "南长区",
                        "sub": []
                    },
                    {
                        "id": 1873,
                        "name": "锡山区",
                        "sub": []
                    },
                    {
                        "id": 1874,
                        "name": "惠山区",
                        "sub": []
                    },
                    {
                        "id": 1875,
                        "name": "滨湖区",
                        "sub": []
                    },
                    {
                        "id": 1876,
                        "name": "新区",
                        "sub": []
                    },
                    {
                        "id": 1877,
                        "name": "江阴市",
                        "sub": []
                    },
                    {
                        "id": 1878,
                        "name": "宜兴市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 223,
                "name": "常州",
                "sub": [
                    {
                        "id": 1879,
                        "name": "天宁区",
                        "sub": []
                    },
                    {
                        "id": 1880,
                        "name": "钟楼区",
                        "sub": []
                    },
                    {
                        "id": 1881,
                        "name": "戚墅堰区",
                        "sub": []
                    },
                    {
                        "id": 1882,
                        "name": "郊区",
                        "sub": []
                    },
                    {
                        "id": 1883,
                        "name": "新北区",
                        "sub": []
                    },
                    {
                        "id": 1884,
                        "name": "武进区",
                        "sub": []
                    },
                    {
                        "id": 1885,
                        "name": "溧阳市",
                        "sub": []
                    },
                    {
                        "id": 1886,
                        "name": "金坛市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 224,
                "name": "淮安",
                "sub": [
                    {
                        "id": 1887,
                        "name": "清河区",
                        "sub": []
                    },
                    {
                        "id": 1888,
                        "name": "清浦区",
                        "sub": []
                    },
                    {
                        "id": 1889,
                        "name": "楚州区",
                        "sub": []
                    },
                    {
                        "id": 1890,
                        "name": "淮阴区",
                        "sub": []
                    },
                    {
                        "id": 1891,
                        "name": "涟水县",
                        "sub": []
                    },
                    {
                        "id": 1892,
                        "name": "洪泽县",
                        "sub": []
                    },
                    {
                        "id": 1893,
                        "name": "盱眙县",
                        "sub": []
                    },
                    {
                        "id": 1894,
                        "name": "金湖县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 225,
                "name": "连云港",
                "sub": [
                    {
                        "id": 1895,
                        "name": "新浦区",
                        "sub": []
                    },
                    {
                        "id": 1896,
                        "name": "连云区",
                        "sub": []
                    },
                    {
                        "id": 1897,
                        "name": "海州区",
                        "sub": []
                    },
                    {
                        "id": 1898,
                        "name": "赣榆县",
                        "sub": []
                    },
                    {
                        "id": 1899,
                        "name": "东海县",
                        "sub": []
                    },
                    {
                        "id": 1900,
                        "name": "灌云县",
                        "sub": []
                    },
                    {
                        "id": 1901,
                        "name": "灌南县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 226,
                "name": "南通",
                "sub": [
                    {
                        "id": 1902,
                        "name": "崇川区",
                        "sub": []
                    },
                    {
                        "id": 1903,
                        "name": "港闸区",
                        "sub": []
                    },
                    {
                        "id": 1904,
                        "name": "经济开发区",
                        "sub": []
                    },
                    {
                        "id": 1905,
                        "name": "启东市",
                        "sub": []
                    },
                    {
                        "id": 1906,
                        "name": "如皋市",
                        "sub": []
                    },
                    {
                        "id": 1907,
                        "name": "通州市",
                        "sub": []
                    },
                    {
                        "id": 1908,
                        "name": "海门市",
                        "sub": []
                    },
                    {
                        "id": 1909,
                        "name": "海安县",
                        "sub": []
                    },
                    {
                        "id": 1910,
                        "name": "如东县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 227,
                "name": "宿迁",
                "sub": [
                    {
                        "id": 1911,
                        "name": "宿城区",
                        "sub": []
                    },
                    {
                        "id": 1912,
                        "name": "宿豫区",
                        "sub": []
                    },
                    {
                        "id": 1913,
                        "name": "宿豫县",
                        "sub": []
                    },
                    {
                        "id": 1914,
                        "name": "沭阳县",
                        "sub": []
                    },
                    {
                        "id": 1915,
                        "name": "泗阳县",
                        "sub": []
                    },
                    {
                        "id": 1916,
                        "name": "泗洪县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 228,
                "name": "泰州",
                "sub": [
                    {
                        "id": 1917,
                        "name": "海陵区",
                        "sub": []
                    },
                    {
                        "id": 1918,
                        "name": "高港区",
                        "sub": []
                    },
                    {
                        "id": 1919,
                        "name": "兴化市",
                        "sub": []
                    },
                    {
                        "id": 1920,
                        "name": "靖江市",
                        "sub": []
                    },
                    {
                        "id": 1921,
                        "name": "泰兴市",
                        "sub": []
                    },
                    {
                        "id": 1922,
                        "name": "姜堰市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 229,
                "name": "徐州",
                "sub": [
                    {
                        "id": 1923,
                        "name": "云龙区",
                        "sub": []
                    },
                    {
                        "id": 1924,
                        "name": "鼓楼区",
                        "sub": []
                    },
                    {
                        "id": 1925,
                        "name": "九里区",
                        "sub": []
                    },
                    {
                        "id": 1926,
                        "name": "贾汪区",
                        "sub": []
                    },
                    {
                        "id": 1927,
                        "name": "泉山区",
                        "sub": []
                    },
                    {
                        "id": 1928,
                        "name": "新沂市",
                        "sub": []
                    },
                    {
                        "id": 1929,
                        "name": "邳州市",
                        "sub": []
                    },
                    {
                        "id": 1930,
                        "name": "丰县",
                        "sub": []
                    },
                    {
                        "id": 1931,
                        "name": "沛县",
                        "sub": []
                    },
                    {
                        "id": 1932,
                        "name": "铜山县",
                        "sub": []
                    },
                    {
                        "id": 1933,
                        "name": "睢宁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 230,
                "name": "盐城",
                "sub": [
                    {
                        "id": 1934,
                        "name": "城区",
                        "sub": []
                    },
                    {
                        "id": 1935,
                        "name": "亭湖区",
                        "sub": []
                    },
                    {
                        "id": 1936,
                        "name": "盐都区",
                        "sub": []
                    },
                    {
                        "id": 1937,
                        "name": "盐都县",
                        "sub": []
                    },
                    {
                        "id": 1938,
                        "name": "东台市",
                        "sub": []
                    },
                    {
                        "id": 1939,
                        "name": "大丰市",
                        "sub": []
                    },
                    {
                        "id": 1940,
                        "name": "响水县",
                        "sub": []
                    },
                    {
                        "id": 1941,
                        "name": "滨海县",
                        "sub": []
                    },
                    {
                        "id": 1942,
                        "name": "阜宁县",
                        "sub": []
                    },
                    {
                        "id": 1943,
                        "name": "射阳县",
                        "sub": []
                    },
                    {
                        "id": 1944,
                        "name": "建湖县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 231,
                "name": "扬州",
                "sub": [
                    {
                        "id": 1945,
                        "name": "广陵区",
                        "sub": []
                    },
                    {
                        "id": 1946,
                        "name": "维扬区",
                        "sub": []
                    },
                    {
                        "id": 1947,
                        "name": "邗江区",
                        "sub": []
                    },
                    {
                        "id": 1948,
                        "name": "仪征市",
                        "sub": []
                    },
                    {
                        "id": 1949,
                        "name": "高邮市",
                        "sub": []
                    },
                    {
                        "id": 1950,
                        "name": "江都市",
                        "sub": []
                    },
                    {
                        "id": 1951,
                        "name": "宝应县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 232,
                "name": "镇江",
                "sub": [
                    {
                        "id": 1952,
                        "name": "京口区",
                        "sub": []
                    },
                    {
                        "id": 1953,
                        "name": "润州区",
                        "sub": []
                    },
                    {
                        "id": 1954,
                        "name": "丹徒区",
                        "sub": []
                    },
                    {
                        "id": 1955,
                        "name": "丹阳市",
                        "sub": []
                    },
                    {
                        "id": 1956,
                        "name": "扬中市",
                        "sub": []
                    },
                    {
                        "id": 1957,
                        "name": "句容市",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 17,
        "name": "江西",
        "sub": [
            {
                "id": 233,
                "name": "南昌",
                "sub": [
                    {
                        "id": 1958,
                        "name": "东湖区",
                        "sub": []
                    },
                    {
                        "id": 1959,
                        "name": "西湖区",
                        "sub": []
                    },
                    {
                        "id": 1960,
                        "name": "青云谱区",
                        "sub": []
                    },
                    {
                        "id": 1961,
                        "name": "湾里区",
                        "sub": []
                    },
                    {
                        "id": 1962,
                        "name": "青山湖区",
                        "sub": []
                    },
                    {
                        "id": 1963,
                        "name": "红谷滩新区",
                        "sub": []
                    },
                    {
                        "id": 1964,
                        "name": "昌北区",
                        "sub": []
                    },
                    {
                        "id": 1965,
                        "name": "高新区",
                        "sub": []
                    },
                    {
                        "id": 1966,
                        "name": "南昌县",
                        "sub": []
                    },
                    {
                        "id": 1967,
                        "name": "新建县",
                        "sub": []
                    },
                    {
                        "id": 1968,
                        "name": "安义县",
                        "sub": []
                    },
                    {
                        "id": 1969,
                        "name": "进贤县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 234,
                "name": "抚州",
                "sub": [
                    {
                        "id": 1970,
                        "name": "临川区",
                        "sub": []
                    },
                    {
                        "id": 1971,
                        "name": "南城县",
                        "sub": []
                    },
                    {
                        "id": 1972,
                        "name": "黎川县",
                        "sub": []
                    },
                    {
                        "id": 1973,
                        "name": "南丰县",
                        "sub": []
                    },
                    {
                        "id": 1974,
                        "name": "崇仁县",
                        "sub": []
                    },
                    {
                        "id": 1975,
                        "name": "乐安县",
                        "sub": []
                    },
                    {
                        "id": 1976,
                        "name": "宜黄县",
                        "sub": []
                    },
                    {
                        "id": 1977,
                        "name": "金溪县",
                        "sub": []
                    },
                    {
                        "id": 1978,
                        "name": "资溪县",
                        "sub": []
                    },
                    {
                        "id": 1979,
                        "name": "东乡县",
                        "sub": []
                    },
                    {
                        "id": 1980,
                        "name": "广昌县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 235,
                "name": "赣州",
                "sub": [
                    {
                        "id": 1981,
                        "name": "章贡区",
                        "sub": []
                    },
                    {
                        "id": 1982,
                        "name": "于都县",
                        "sub": []
                    },
                    {
                        "id": 1983,
                        "name": "瑞金市",
                        "sub": []
                    },
                    {
                        "id": 1984,
                        "name": "南康市",
                        "sub": []
                    },
                    {
                        "id": 1985,
                        "name": "赣县",
                        "sub": []
                    },
                    {
                        "id": 1986,
                        "name": "信丰县",
                        "sub": []
                    },
                    {
                        "id": 1987,
                        "name": "大余县",
                        "sub": []
                    },
                    {
                        "id": 1988,
                        "name": "上犹县",
                        "sub": []
                    },
                    {
                        "id": 1989,
                        "name": "崇义县",
                        "sub": []
                    },
                    {
                        "id": 1990,
                        "name": "安远县",
                        "sub": []
                    },
                    {
                        "id": 1991,
                        "name": "龙南县",
                        "sub": []
                    },
                    {
                        "id": 1992,
                        "name": "定南县",
                        "sub": []
                    },
                    {
                        "id": 1993,
                        "name": "全南县",
                        "sub": []
                    },
                    {
                        "id": 1994,
                        "name": "宁都县",
                        "sub": []
                    },
                    {
                        "id": 1995,
                        "name": "兴国县",
                        "sub": []
                    },
                    {
                        "id": 1996,
                        "name": "会昌县",
                        "sub": []
                    },
                    {
                        "id": 1997,
                        "name": "寻乌县",
                        "sub": []
                    },
                    {
                        "id": 1998,
                        "name": "石城县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 236,
                "name": "吉安",
                "sub": [
                    {
                        "id": 1999,
                        "name": "安福县",
                        "sub": []
                    },
                    {
                        "id": 2000,
                        "name": "吉州区",
                        "sub": []
                    },
                    {
                        "id": 2001,
                        "name": "青原区",
                        "sub": []
                    },
                    {
                        "id": 2002,
                        "name": "井冈山市",
                        "sub": []
                    },
                    {
                        "id": 2003,
                        "name": "吉安县",
                        "sub": []
                    },
                    {
                        "id": 2004,
                        "name": "吉水县",
                        "sub": []
                    },
                    {
                        "id": 2005,
                        "name": "峡江县",
                        "sub": []
                    },
                    {
                        "id": 2006,
                        "name": "新干县",
                        "sub": []
                    },
                    {
                        "id": 2007,
                        "name": "永丰县",
                        "sub": []
                    },
                    {
                        "id": 2008,
                        "name": "泰和县",
                        "sub": []
                    },
                    {
                        "id": 2009,
                        "name": "遂川县",
                        "sub": []
                    },
                    {
                        "id": 2010,
                        "name": "万安县",
                        "sub": []
                    },
                    {
                        "id": 2011,
                        "name": "永新县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 237,
                "name": "景德镇",
                "sub": [
                    {
                        "id": 2012,
                        "name": "珠山区",
                        "sub": []
                    },
                    {
                        "id": 2013,
                        "name": "昌江区",
                        "sub": []
                    },
                    {
                        "id": 2014,
                        "name": "乐平市",
                        "sub": []
                    },
                    {
                        "id": 2015,
                        "name": "浮梁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 238,
                "name": "九江",
                "sub": [
                    {
                        "id": 2016,
                        "name": "浔阳区",
                        "sub": []
                    },
                    {
                        "id": 2017,
                        "name": "庐山区",
                        "sub": []
                    },
                    {
                        "id": 2018,
                        "name": "瑞昌市",
                        "sub": []
                    },
                    {
                        "id": 2019,
                        "name": "九江县",
                        "sub": []
                    },
                    {
                        "id": 2020,
                        "name": "武宁县",
                        "sub": []
                    },
                    {
                        "id": 2021,
                        "name": "修水县",
                        "sub": []
                    },
                    {
                        "id": 2022,
                        "name": "永修县",
                        "sub": []
                    },
                    {
                        "id": 2023,
                        "name": "德安县",
                        "sub": []
                    },
                    {
                        "id": 2024,
                        "name": "星子县",
                        "sub": []
                    },
                    {
                        "id": 2025,
                        "name": "都昌县",
                        "sub": []
                    },
                    {
                        "id": 2026,
                        "name": "湖口县",
                        "sub": []
                    },
                    {
                        "id": 2027,
                        "name": "彭泽县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 239,
                "name": "萍乡",
                "sub": [
                    {
                        "id": 2028,
                        "name": "安源区",
                        "sub": []
                    },
                    {
                        "id": 2029,
                        "name": "湘东区",
                        "sub": []
                    },
                    {
                        "id": 2030,
                        "name": "莲花县",
                        "sub": []
                    },
                    {
                        "id": 2031,
                        "name": "芦溪县",
                        "sub": []
                    },
                    {
                        "id": 2032,
                        "name": "上栗县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 240,
                "name": "上饶",
                "sub": [
                    {
                        "id": 2033,
                        "name": "信州区",
                        "sub": []
                    },
                    {
                        "id": 2034,
                        "name": "德兴市",
                        "sub": []
                    },
                    {
                        "id": 2035,
                        "name": "上饶县",
                        "sub": []
                    },
                    {
                        "id": 2036,
                        "name": "广丰县",
                        "sub": []
                    },
                    {
                        "id": 2037,
                        "name": "玉山县",
                        "sub": []
                    },
                    {
                        "id": 2038,
                        "name": "铅山县",
                        "sub": []
                    },
                    {
                        "id": 2039,
                        "name": "横峰县",
                        "sub": []
                    },
                    {
                        "id": 2040,
                        "name": "弋阳县",
                        "sub": []
                    },
                    {
                        "id": 2041,
                        "name": "余干县",
                        "sub": []
                    },
                    {
                        "id": 2042,
                        "name": "波阳县",
                        "sub": []
                    },
                    {
                        "id": 2043,
                        "name": "万年县",
                        "sub": []
                    },
                    {
                        "id": 2044,
                        "name": "婺源县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 241,
                "name": "新余",
                "sub": [
                    {
                        "id": 2045,
                        "name": "渝水区",
                        "sub": []
                    },
                    {
                        "id": 2046,
                        "name": "分宜县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 242,
                "name": "宜春",
                "sub": [
                    {
                        "id": 2047,
                        "name": "袁州区",
                        "sub": []
                    },
                    {
                        "id": 2048,
                        "name": "丰城市",
                        "sub": []
                    },
                    {
                        "id": 2049,
                        "name": "樟树市",
                        "sub": []
                    },
                    {
                        "id": 2050,
                        "name": "高安市",
                        "sub": []
                    },
                    {
                        "id": 2051,
                        "name": "奉新县",
                        "sub": []
                    },
                    {
                        "id": 2052,
                        "name": "万载县",
                        "sub": []
                    },
                    {
                        "id": 2053,
                        "name": "上高县",
                        "sub": []
                    },
                    {
                        "id": 2054,
                        "name": "宜丰县",
                        "sub": []
                    },
                    {
                        "id": 2055,
                        "name": "靖安县",
                        "sub": []
                    },
                    {
                        "id": 2056,
                        "name": "铜鼓县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 243,
                "name": "鹰潭",
                "sub": [
                    {
                        "id": 2057,
                        "name": "月湖区",
                        "sub": []
                    },
                    {
                        "id": 2058,
                        "name": "贵溪市",
                        "sub": []
                    },
                    {
                        "id": 2059,
                        "name": "余江县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 18,
        "name": "辽宁",
        "sub": [
            {
                "id": 244,
                "name": "沈阳",
                "sub": [
                    {
                        "id": 2060,
                        "name": "沈河区",
                        "sub": []
                    },
                    {
                        "id": 2061,
                        "name": "皇姑区",
                        "sub": []
                    },
                    {
                        "id": 2062,
                        "name": "和平区",
                        "sub": []
                    },
                    {
                        "id": 2063,
                        "name": "大东区",
                        "sub": []
                    },
                    {
                        "id": 2064,
                        "name": "铁西区",
                        "sub": []
                    },
                    {
                        "id": 2065,
                        "name": "苏家屯区",
                        "sub": []
                    },
                    {
                        "id": 2066,
                        "name": "东陵区",
                        "sub": []
                    },
                    {
                        "id": 2067,
                        "name": "沈北新区",
                        "sub": []
                    },
                    {
                        "id": 2068,
                        "name": "于洪区",
                        "sub": []
                    },
                    {
                        "id": 2069,
                        "name": "浑南新区",
                        "sub": []
                    },
                    {
                        "id": 2070,
                        "name": "新民市",
                        "sub": []
                    },
                    {
                        "id": 2071,
                        "name": "辽中县",
                        "sub": []
                    },
                    {
                        "id": 2072,
                        "name": "康平县",
                        "sub": []
                    },
                    {
                        "id": 2073,
                        "name": "法库县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 245,
                "name": "大连",
                "sub": [
                    {
                        "id": 2074,
                        "name": "西岗区",
                        "sub": []
                    },
                    {
                        "id": 2075,
                        "name": "中山区",
                        "sub": []
                    },
                    {
                        "id": 2076,
                        "name": "沙河口区",
                        "sub": []
                    },
                    {
                        "id": 2077,
                        "name": "甘井子区",
                        "sub": []
                    },
                    {
                        "id": 2078,
                        "name": "旅顺口区",
                        "sub": []
                    },
                    {
                        "id": 2079,
                        "name": "金州区",
                        "sub": []
                    },
                    {
                        "id": 2080,
                        "name": "开发区",
                        "sub": []
                    },
                    {
                        "id": 2081,
                        "name": "瓦房店市",
                        "sub": []
                    },
                    {
                        "id": 2082,
                        "name": "普兰店市",
                        "sub": []
                    },
                    {
                        "id": 2083,
                        "name": "庄河市",
                        "sub": []
                    },
                    {
                        "id": 2084,
                        "name": "长海县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 246,
                "name": "鞍山",
                "sub": [
                    {
                        "id": 2085,
                        "name": "铁东区",
                        "sub": []
                    },
                    {
                        "id": 2086,
                        "name": "铁西区",
                        "sub": []
                    },
                    {
                        "id": 2087,
                        "name": "立山区",
                        "sub": []
                    },
                    {
                        "id": 2088,
                        "name": "千山区",
                        "sub": []
                    },
                    {
                        "id": 2089,
                        "name": "岫岩",
                        "sub": []
                    },
                    {
                        "id": 2090,
                        "name": "海城市",
                        "sub": []
                    },
                    {
                        "id": 2091,
                        "name": "台安县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 247,
                "name": "本溪",
                "sub": [
                    {
                        "id": 2092,
                        "name": "本溪",
                        "sub": []
                    },
                    {
                        "id": 2093,
                        "name": "平山区",
                        "sub": []
                    },
                    {
                        "id": 2094,
                        "name": "明山区",
                        "sub": []
                    },
                    {
                        "id": 2095,
                        "name": "溪湖区",
                        "sub": []
                    },
                    {
                        "id": 2096,
                        "name": "南芬区",
                        "sub": []
                    },
                    {
                        "id": 2097,
                        "name": "桓仁",
                        "sub": []
                    }
                ]
            },
            {
                "id": 248,
                "name": "朝阳",
                "sub": [
                    {
                        "id": 2098,
                        "name": "双塔区",
                        "sub": []
                    },
                    {
                        "id": 2099,
                        "name": "龙城区",
                        "sub": []
                    },
                    {
                        "id": 2100,
                        "name": "喀喇沁左翼蒙古族自治县",
                        "sub": []
                    },
                    {
                        "id": 2101,
                        "name": "北票市",
                        "sub": []
                    },
                    {
                        "id": 2102,
                        "name": "凌源市",
                        "sub": []
                    },
                    {
                        "id": 2103,
                        "name": "朝阳县",
                        "sub": []
                    },
                    {
                        "id": 2104,
                        "name": "建平县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 249,
                "name": "丹东",
                "sub": [
                    {
                        "id": 2105,
                        "name": "振兴区",
                        "sub": []
                    },
                    {
                        "id": 2106,
                        "name": "元宝区",
                        "sub": []
                    },
                    {
                        "id": 2107,
                        "name": "振安区",
                        "sub": []
                    },
                    {
                        "id": 2108,
                        "name": "宽甸",
                        "sub": []
                    },
                    {
                        "id": 2109,
                        "name": "东港市",
                        "sub": []
                    },
                    {
                        "id": 2110,
                        "name": "凤城市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 250,
                "name": "抚顺",
                "sub": [
                    {
                        "id": 2111,
                        "name": "顺城区",
                        "sub": []
                    },
                    {
                        "id": 2112,
                        "name": "新抚区",
                        "sub": []
                    },
                    {
                        "id": 2113,
                        "name": "东洲区",
                        "sub": []
                    },
                    {
                        "id": 2114,
                        "name": "望花区",
                        "sub": []
                    },
                    {
                        "id": 2115,
                        "name": "清原",
                        "sub": []
                    },
                    {
                        "id": 2116,
                        "name": "新宾",
                        "sub": []
                    },
                    {
                        "id": 2117,
                        "name": "抚顺县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 251,
                "name": "阜新",
                "sub": [
                    {
                        "id": 2118,
                        "name": "阜新",
                        "sub": []
                    },
                    {
                        "id": 2119,
                        "name": "海州区",
                        "sub": []
                    },
                    {
                        "id": 2120,
                        "name": "新邱区",
                        "sub": []
                    },
                    {
                        "id": 2121,
                        "name": "太平区",
                        "sub": []
                    },
                    {
                        "id": 2122,
                        "name": "清河门区",
                        "sub": []
                    },
                    {
                        "id": 2123,
                        "name": "细河区",
                        "sub": []
                    },
                    {
                        "id": 2124,
                        "name": "彰武县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 252,
                "name": "葫芦岛",
                "sub": [
                    {
                        "id": 2125,
                        "name": "龙港区",
                        "sub": []
                    },
                    {
                        "id": 2126,
                        "name": "南票区",
                        "sub": []
                    },
                    {
                        "id": 2127,
                        "name": "连山区",
                        "sub": []
                    },
                    {
                        "id": 2128,
                        "name": "兴城市",
                        "sub": []
                    },
                    {
                        "id": 2129,
                        "name": "绥中县",
                        "sub": []
                    },
                    {
                        "id": 2130,
                        "name": "建昌县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 253,
                "name": "锦州",
                "sub": [
                    {
                        "id": 2131,
                        "name": "太和区",
                        "sub": []
                    },
                    {
                        "id": 2132,
                        "name": "古塔区",
                        "sub": []
                    },
                    {
                        "id": 2133,
                        "name": "凌河区",
                        "sub": []
                    },
                    {
                        "id": 2134,
                        "name": "凌海市",
                        "sub": []
                    },
                    {
                        "id": 2135,
                        "name": "北镇市",
                        "sub": []
                    },
                    {
                        "id": 2136,
                        "name": "黑山县",
                        "sub": []
                    },
                    {
                        "id": 2137,
                        "name": "义县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 254,
                "name": "辽阳",
                "sub": [
                    {
                        "id": 2138,
                        "name": "白塔区",
                        "sub": []
                    },
                    {
                        "id": 2139,
                        "name": "文圣区",
                        "sub": []
                    },
                    {
                        "id": 2140,
                        "name": "宏伟区",
                        "sub": []
                    },
                    {
                        "id": 2141,
                        "name": "太子河区",
                        "sub": []
                    },
                    {
                        "id": 2142,
                        "name": "弓长岭区",
                        "sub": []
                    },
                    {
                        "id": 2143,
                        "name": "灯塔市",
                        "sub": []
                    },
                    {
                        "id": 2144,
                        "name": "辽阳县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 255,
                "name": "盘锦",
                "sub": [
                    {
                        "id": 2145,
                        "name": "双台子区",
                        "sub": []
                    },
                    {
                        "id": 2146,
                        "name": "兴隆台区",
                        "sub": []
                    },
                    {
                        "id": 2147,
                        "name": "大洼县",
                        "sub": []
                    },
                    {
                        "id": 2148,
                        "name": "盘山县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 256,
                "name": "铁岭",
                "sub": [
                    {
                        "id": 2149,
                        "name": "银州区",
                        "sub": []
                    },
                    {
                        "id": 2150,
                        "name": "清河区",
                        "sub": []
                    },
                    {
                        "id": 2151,
                        "name": "调兵山市",
                        "sub": []
                    },
                    {
                        "id": 2152,
                        "name": "开原市",
                        "sub": []
                    },
                    {
                        "id": 2153,
                        "name": "铁岭县",
                        "sub": []
                    },
                    {
                        "id": 2154,
                        "name": "西丰县",
                        "sub": []
                    },
                    {
                        "id": 2155,
                        "name": "昌图县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 257,
                "name": "营口",
                "sub": [
                    {
                        "id": 2156,
                        "name": "站前区",
                        "sub": []
                    },
                    {
                        "id": 2157,
                        "name": "西市区",
                        "sub": []
                    },
                    {
                        "id": 2158,
                        "name": "鲅鱼圈区",
                        "sub": []
                    },
                    {
                        "id": 2159,
                        "name": "老边区",
                        "sub": []
                    },
                    {
                        "id": 2160,
                        "name": "盖州市",
                        "sub": []
                    },
                    {
                        "id": 2161,
                        "name": "大石桥市",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 19,
        "name": "内蒙古",
        "sub": [
            {
                "id": 258,
                "name": "呼和浩特",
                "sub": [
                    {
                        "id": 2162,
                        "name": "回民区",
                        "sub": []
                    },
                    {
                        "id": 2163,
                        "name": "玉泉区",
                        "sub": []
                    },
                    {
                        "id": 2164,
                        "name": "新城区",
                        "sub": []
                    },
                    {
                        "id": 2165,
                        "name": "赛罕区",
                        "sub": []
                    },
                    {
                        "id": 2166,
                        "name": "清水河县",
                        "sub": []
                    },
                    {
                        "id": 2167,
                        "name": "土默特左旗",
                        "sub": []
                    },
                    {
                        "id": 2168,
                        "name": "托克托县",
                        "sub": []
                    },
                    {
                        "id": 2169,
                        "name": "和林格尔县",
                        "sub": []
                    },
                    {
                        "id": 2170,
                        "name": "武川县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 259,
                "name": "阿拉善盟",
                "sub": [
                    {
                        "id": 2171,
                        "name": "阿拉善左旗",
                        "sub": []
                    },
                    {
                        "id": 2172,
                        "name": "阿拉善右旗",
                        "sub": []
                    },
                    {
                        "id": 2173,
                        "name": "额济纳旗",
                        "sub": []
                    }
                ]
            },
            {
                "id": 260,
                "name": "巴彦淖尔盟",
                "sub": [
                    {
                        "id": 2174,
                        "name": "临河区",
                        "sub": []
                    },
                    {
                        "id": 2175,
                        "name": "五原县",
                        "sub": []
                    },
                    {
                        "id": 2176,
                        "name": "磴口县",
                        "sub": []
                    },
                    {
                        "id": 2177,
                        "name": "乌拉特前旗",
                        "sub": []
                    },
                    {
                        "id": 2178,
                        "name": "乌拉特中旗",
                        "sub": []
                    },
                    {
                        "id": 2179,
                        "name": "乌拉特后旗",
                        "sub": []
                    },
                    {
                        "id": 2180,
                        "name": "杭锦后旗",
                        "sub": []
                    }
                ]
            },
            {
                "id": 261,
                "name": "包头",
                "sub": [
                    {
                        "id": 2181,
                        "name": "昆都仑区",
                        "sub": []
                    },
                    {
                        "id": 2182,
                        "name": "青山区",
                        "sub": []
                    },
                    {
                        "id": 2183,
                        "name": "东河区",
                        "sub": []
                    },
                    {
                        "id": 2184,
                        "name": "九原区",
                        "sub": []
                    },
                    {
                        "id": 2185,
                        "name": "石拐区",
                        "sub": []
                    },
                    {
                        "id": 2186,
                        "name": "白云矿区",
                        "sub": []
                    },
                    {
                        "id": 2187,
                        "name": "土默特右旗",
                        "sub": []
                    },
                    {
                        "id": 2188,
                        "name": "固阳县",
                        "sub": []
                    },
                    {
                        "id": 2189,
                        "name": "达尔罕茂明安联合旗",
                        "sub": []
                    }
                ]
            },
            {
                "id": 262,
                "name": "赤峰",
                "sub": [
                    {
                        "id": 2190,
                        "name": "红山区",
                        "sub": []
                    },
                    {
                        "id": 2191,
                        "name": "元宝山区",
                        "sub": []
                    },
                    {
                        "id": 2192,
                        "name": "松山区",
                        "sub": []
                    },
                    {
                        "id": 2193,
                        "name": "阿鲁科尔沁旗",
                        "sub": []
                    },
                    {
                        "id": 2194,
                        "name": "巴林左旗",
                        "sub": []
                    },
                    {
                        "id": 2195,
                        "name": "巴林右旗",
                        "sub": []
                    },
                    {
                        "id": 2196,
                        "name": "林西县",
                        "sub": []
                    },
                    {
                        "id": 2197,
                        "name": "克什克腾旗",
                        "sub": []
                    },
                    {
                        "id": 2198,
                        "name": "翁牛特旗",
                        "sub": []
                    },
                    {
                        "id": 2199,
                        "name": "喀喇沁旗",
                        "sub": []
                    },
                    {
                        "id": 2200,
                        "name": "宁城县",
                        "sub": []
                    },
                    {
                        "id": 2201,
                        "name": "敖汉旗",
                        "sub": []
                    }
                ]
            },
            {
                "id": 263,
                "name": "鄂尔多斯",
                "sub": [
                    {
                        "id": 2202,
                        "name": "东胜区",
                        "sub": []
                    },
                    {
                        "id": 2203,
                        "name": "达拉特旗",
                        "sub": []
                    },
                    {
                        "id": 2204,
                        "name": "准格尔旗",
                        "sub": []
                    },
                    {
                        "id": 2205,
                        "name": "鄂托克前旗",
                        "sub": []
                    },
                    {
                        "id": 2206,
                        "name": "鄂托克旗",
                        "sub": []
                    },
                    {
                        "id": 2207,
                        "name": "杭锦旗",
                        "sub": []
                    },
                    {
                        "id": 2208,
                        "name": "乌审旗",
                        "sub": []
                    },
                    {
                        "id": 2209,
                        "name": "伊金霍洛旗",
                        "sub": []
                    }
                ]
            },
            {
                "id": 264,
                "name": "呼伦贝尔",
                "sub": [
                    {
                        "id": 2210,
                        "name": "海拉尔区",
                        "sub": []
                    },
                    {
                        "id": 2211,
                        "name": "莫力达瓦",
                        "sub": []
                    },
                    {
                        "id": 2212,
                        "name": "满洲里市",
                        "sub": []
                    },
                    {
                        "id": 2213,
                        "name": "牙克石市",
                        "sub": []
                    },
                    {
                        "id": 2214,
                        "name": "扎兰屯市",
                        "sub": []
                    },
                    {
                        "id": 2215,
                        "name": "额尔古纳市",
                        "sub": []
                    },
                    {
                        "id": 2216,
                        "name": "根河市",
                        "sub": []
                    },
                    {
                        "id": 2217,
                        "name": "阿荣旗",
                        "sub": []
                    },
                    {
                        "id": 2218,
                        "name": "鄂伦春自治旗",
                        "sub": []
                    },
                    {
                        "id": 2219,
                        "name": "鄂温克族自治旗",
                        "sub": []
                    },
                    {
                        "id": 2220,
                        "name": "陈巴尔虎旗",
                        "sub": []
                    },
                    {
                        "id": 2221,
                        "name": "新巴尔虎左旗",
                        "sub": []
                    },
                    {
                        "id": 2222,
                        "name": "新巴尔虎右旗",
                        "sub": []
                    }
                ]
            },
            {
                "id": 265,
                "name": "通辽",
                "sub": [
                    {
                        "id": 2223,
                        "name": "科尔沁区",
                        "sub": []
                    },
                    {
                        "id": 2224,
                        "name": "霍林郭勒市",
                        "sub": []
                    },
                    {
                        "id": 2225,
                        "name": "科尔沁左翼中旗",
                        "sub": []
                    },
                    {
                        "id": 2226,
                        "name": "科尔沁左翼后旗",
                        "sub": []
                    },
                    {
                        "id": 2227,
                        "name": "开鲁县",
                        "sub": []
                    },
                    {
                        "id": 2228,
                        "name": "库伦旗",
                        "sub": []
                    },
                    {
                        "id": 2229,
                        "name": "奈曼旗",
                        "sub": []
                    },
                    {
                        "id": 2230,
                        "name": "扎鲁特旗",
                        "sub": []
                    }
                ]
            },
            {
                "id": 266,
                "name": "乌海",
                "sub": [
                    {
                        "id": 2231,
                        "name": "海勃湾区",
                        "sub": []
                    },
                    {
                        "id": 2232,
                        "name": "乌达区",
                        "sub": []
                    },
                    {
                        "id": 2233,
                        "name": "海南区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 267,
                "name": "乌兰察布市",
                "sub": [
                    {
                        "id": 2234,
                        "name": "化德县",
                        "sub": []
                    },
                    {
                        "id": 2235,
                        "name": "集宁区",
                        "sub": []
                    },
                    {
                        "id": 2236,
                        "name": "丰镇市",
                        "sub": []
                    },
                    {
                        "id": 2237,
                        "name": "卓资县",
                        "sub": []
                    },
                    {
                        "id": 2238,
                        "name": "商都县",
                        "sub": []
                    },
                    {
                        "id": 2239,
                        "name": "兴和县",
                        "sub": []
                    },
                    {
                        "id": 2240,
                        "name": "凉城县",
                        "sub": []
                    },
                    {
                        "id": 2241,
                        "name": "察哈尔右翼前旗",
                        "sub": []
                    },
                    {
                        "id": 2242,
                        "name": "察哈尔右翼中旗",
                        "sub": []
                    },
                    {
                        "id": 2243,
                        "name": "察哈尔右翼后旗",
                        "sub": []
                    },
                    {
                        "id": 2244,
                        "name": "四子王旗",
                        "sub": []
                    }
                ]
            },
            {
                "id": 268,
                "name": "锡林郭勒盟",
                "sub": [
                    {
                        "id": 2245,
                        "name": "二连浩特市",
                        "sub": []
                    },
                    {
                        "id": 2246,
                        "name": "锡林浩特市",
                        "sub": []
                    },
                    {
                        "id": 2247,
                        "name": "阿巴嘎旗",
                        "sub": []
                    },
                    {
                        "id": 2248,
                        "name": "苏尼特左旗",
                        "sub": []
                    },
                    {
                        "id": 2249,
                        "name": "苏尼特右旗",
                        "sub": []
                    },
                    {
                        "id": 2250,
                        "name": "东乌珠穆沁旗",
                        "sub": []
                    },
                    {
                        "id": 2251,
                        "name": "西乌珠穆沁旗",
                        "sub": []
                    },
                    {
                        "id": 2252,
                        "name": "太仆寺旗",
                        "sub": []
                    },
                    {
                        "id": 2253,
                        "name": "镶黄旗",
                        "sub": []
                    },
                    {
                        "id": 2254,
                        "name": "正镶白旗",
                        "sub": []
                    },
                    {
                        "id": 2255,
                        "name": "正蓝旗",
                        "sub": []
                    },
                    {
                        "id": 2256,
                        "name": "多伦县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 269,
                "name": "兴安盟",
                "sub": [
                    {
                        "id": 2257,
                        "name": "乌兰浩特市",
                        "sub": []
                    },
                    {
                        "id": 2258,
                        "name": "阿尔山市",
                        "sub": []
                    },
                    {
                        "id": 2259,
                        "name": "科尔沁右翼前旗",
                        "sub": []
                    },
                    {
                        "id": 2260,
                        "name": "科尔沁右翼中旗",
                        "sub": []
                    },
                    {
                        "id": 2261,
                        "name": "扎赉特旗",
                        "sub": []
                    },
                    {
                        "id": 2262,
                        "name": "突泉县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 20,
        "name": "宁夏",
        "sub": [
            {
                "id": 270,
                "name": "银川",
                "sub": [
                    {
                        "id": 2263,
                        "name": "西夏区",
                        "sub": []
                    },
                    {
                        "id": 2264,
                        "name": "金凤区",
                        "sub": []
                    },
                    {
                        "id": 2265,
                        "name": "兴庆区",
                        "sub": []
                    },
                    {
                        "id": 2266,
                        "name": "灵武市",
                        "sub": []
                    },
                    {
                        "id": 2267,
                        "name": "永宁县",
                        "sub": []
                    },
                    {
                        "id": 2268,
                        "name": "贺兰县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 271,
                "name": "固原",
                "sub": [
                    {
                        "id": 2269,
                        "name": "原州区",
                        "sub": []
                    },
                    {
                        "id": 2270,
                        "name": "海原县",
                        "sub": []
                    },
                    {
                        "id": 2271,
                        "name": "西吉县",
                        "sub": []
                    },
                    {
                        "id": 2272,
                        "name": "隆德县",
                        "sub": []
                    },
                    {
                        "id": 2273,
                        "name": "泾源县",
                        "sub": []
                    },
                    {
                        "id": 2274,
                        "name": "彭阳县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 272,
                "name": "石嘴山",
                "sub": [
                    {
                        "id": 2275,
                        "name": "惠农县",
                        "sub": []
                    },
                    {
                        "id": 2276,
                        "name": "大武口区",
                        "sub": []
                    },
                    {
                        "id": 2277,
                        "name": "惠农区",
                        "sub": []
                    },
                    {
                        "id": 2278,
                        "name": "陶乐县",
                        "sub": []
                    },
                    {
                        "id": 2279,
                        "name": "平罗县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 273,
                "name": "吴忠",
                "sub": [
                    {
                        "id": 2280,
                        "name": "利通区",
                        "sub": []
                    },
                    {
                        "id": 2281,
                        "name": "中卫县",
                        "sub": []
                    },
                    {
                        "id": 2282,
                        "name": "青铜峡市",
                        "sub": []
                    },
                    {
                        "id": 2283,
                        "name": "中宁县",
                        "sub": []
                    },
                    {
                        "id": 2284,
                        "name": "盐池县",
                        "sub": []
                    },
                    {
                        "id": 2285,
                        "name": "同心县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 274,
                "name": "中卫",
                "sub": [
                    {
                        "id": 2286,
                        "name": "沙坡头区",
                        "sub": []
                    },
                    {
                        "id": 2287,
                        "name": "海原县",
                        "sub": []
                    },
                    {
                        "id": 2288,
                        "name": "中宁县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 21,
        "name": "青海",
        "sub": [
            {
                "id": 275,
                "name": "西宁",
                "sub": [
                    {
                        "id": 2289,
                        "name": "城中区",
                        "sub": []
                    },
                    {
                        "id": 2290,
                        "name": "城东区",
                        "sub": []
                    },
                    {
                        "id": 2291,
                        "name": "城西区",
                        "sub": []
                    },
                    {
                        "id": 2292,
                        "name": "城北区",
                        "sub": []
                    },
                    {
                        "id": 2293,
                        "name": "湟中县",
                        "sub": []
                    },
                    {
                        "id": 2294,
                        "name": "湟源县",
                        "sub": []
                    },
                    {
                        "id": 2295,
                        "name": "大通",
                        "sub": []
                    }
                ]
            },
            {
                "id": 276,
                "name": "果洛",
                "sub": [
                    {
                        "id": 2296,
                        "name": "玛沁县",
                        "sub": []
                    },
                    {
                        "id": 2297,
                        "name": "班玛县",
                        "sub": []
                    },
                    {
                        "id": 2298,
                        "name": "甘德县",
                        "sub": []
                    },
                    {
                        "id": 2299,
                        "name": "达日县",
                        "sub": []
                    },
                    {
                        "id": 2300,
                        "name": "久治县",
                        "sub": []
                    },
                    {
                        "id": 2301,
                        "name": "玛多县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 277,
                "name": "海北",
                "sub": [
                    {
                        "id": 2302,
                        "name": "海晏县",
                        "sub": []
                    },
                    {
                        "id": 2303,
                        "name": "祁连县",
                        "sub": []
                    },
                    {
                        "id": 2304,
                        "name": "刚察县",
                        "sub": []
                    },
                    {
                        "id": 2305,
                        "name": "门源",
                        "sub": []
                    }
                ]
            },
            {
                "id": 278,
                "name": "海东",
                "sub": [
                    {
                        "id": 2306,
                        "name": "平安县",
                        "sub": []
                    },
                    {
                        "id": 2307,
                        "name": "乐都县",
                        "sub": []
                    },
                    {
                        "id": 2308,
                        "name": "民和",
                        "sub": []
                    },
                    {
                        "id": 2309,
                        "name": "互助",
                        "sub": []
                    },
                    {
                        "id": 2310,
                        "name": "化隆",
                        "sub": []
                    },
                    {
                        "id": 2311,
                        "name": "循化",
                        "sub": []
                    }
                ]
            },
            {
                "id": 279,
                "name": "海南",
                "sub": [
                    {
                        "id": 2312,
                        "name": "共和县",
                        "sub": []
                    },
                    {
                        "id": 2313,
                        "name": "同德县",
                        "sub": []
                    },
                    {
                        "id": 2314,
                        "name": "贵德县",
                        "sub": []
                    },
                    {
                        "id": 2315,
                        "name": "兴海县",
                        "sub": []
                    },
                    {
                        "id": 2316,
                        "name": "贵南县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 280,
                "name": "海西",
                "sub": [
                    {
                        "id": 2317,
                        "name": "德令哈市",
                        "sub": []
                    },
                    {
                        "id": 2318,
                        "name": "格尔木市",
                        "sub": []
                    },
                    {
                        "id": 2319,
                        "name": "乌兰县",
                        "sub": []
                    },
                    {
                        "id": 2320,
                        "name": "都兰县",
                        "sub": []
                    },
                    {
                        "id": 2321,
                        "name": "天峻县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 281,
                "name": "黄南",
                "sub": [
                    {
                        "id": 2322,
                        "name": "同仁县",
                        "sub": []
                    },
                    {
                        "id": 2323,
                        "name": "尖扎县",
                        "sub": []
                    },
                    {
                        "id": 2324,
                        "name": "泽库县",
                        "sub": []
                    },
                    {
                        "id": 2325,
                        "name": "河南蒙古族自治县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 282,
                "name": "玉树",
                "sub": [
                    {
                        "id": 2326,
                        "name": "玉树县",
                        "sub": []
                    },
                    {
                        "id": 2327,
                        "name": "杂多县",
                        "sub": []
                    },
                    {
                        "id": 2328,
                        "name": "称多县",
                        "sub": []
                    },
                    {
                        "id": 2329,
                        "name": "治多县",
                        "sub": []
                    },
                    {
                        "id": 2330,
                        "name": "囊谦县",
                        "sub": []
                    },
                    {
                        "id": 2331,
                        "name": "曲麻莱县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 22,
        "name": "山东",
        "sub": [
            {
                "id": 283,
                "name": "济南",
                "sub": [
                    {
                        "id": 2332,
                        "name": "市中区",
                        "sub": []
                    },
                    {
                        "id": 2333,
                        "name": "历下区",
                        "sub": []
                    },
                    {
                        "id": 2334,
                        "name": "天桥区",
                        "sub": []
                    },
                    {
                        "id": 2335,
                        "name": "槐荫区",
                        "sub": []
                    },
                    {
                        "id": 2336,
                        "name": "历城区",
                        "sub": []
                    },
                    {
                        "id": 2337,
                        "name": "长清区",
                        "sub": []
                    },
                    {
                        "id": 2338,
                        "name": "章丘市",
                        "sub": []
                    },
                    {
                        "id": 2339,
                        "name": "平阴县",
                        "sub": []
                    },
                    {
                        "id": 2340,
                        "name": "济阳县",
                        "sub": []
                    },
                    {
                        "id": 2341,
                        "name": "商河县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 284,
                "name": "青岛",
                "sub": [
                    {
                        "id": 2342,
                        "name": "市南区",
                        "sub": []
                    },
                    {
                        "id": 2343,
                        "name": "市北区",
                        "sub": []
                    },
                    {
                        "id": 2344,
                        "name": "城阳区",
                        "sub": []
                    },
                    {
                        "id": 2345,
                        "name": "四方区",
                        "sub": []
                    },
                    {
                        "id": 2346,
                        "name": "李沧区",
                        "sub": []
                    },
                    {
                        "id": 2347,
                        "name": "黄岛区",
                        "sub": []
                    },
                    {
                        "id": 2348,
                        "name": "崂山区",
                        "sub": []
                    },
                    {
                        "id": 2349,
                        "name": "胶州市",
                        "sub": []
                    },
                    {
                        "id": 2350,
                        "name": "即墨市",
                        "sub": []
                    },
                    {
                        "id": 2351,
                        "name": "平度市",
                        "sub": []
                    },
                    {
                        "id": 2352,
                        "name": "胶南市",
                        "sub": []
                    },
                    {
                        "id": 2353,
                        "name": "莱西市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 285,
                "name": "滨州",
                "sub": [
                    {
                        "id": 2354,
                        "name": "滨城区",
                        "sub": []
                    },
                    {
                        "id": 2355,
                        "name": "惠民县",
                        "sub": []
                    },
                    {
                        "id": 2356,
                        "name": "阳信县",
                        "sub": []
                    },
                    {
                        "id": 2357,
                        "name": "无棣县",
                        "sub": []
                    },
                    {
                        "id": 2358,
                        "name": "沾化县",
                        "sub": []
                    },
                    {
                        "id": 2359,
                        "name": "博兴县",
                        "sub": []
                    },
                    {
                        "id": 2360,
                        "name": "邹平县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 286,
                "name": "德州",
                "sub": [
                    {
                        "id": 2361,
                        "name": "德城区",
                        "sub": []
                    },
                    {
                        "id": 2362,
                        "name": "陵县",
                        "sub": []
                    },
                    {
                        "id": 2363,
                        "name": "乐陵市",
                        "sub": []
                    },
                    {
                        "id": 2364,
                        "name": "禹城市",
                        "sub": []
                    },
                    {
                        "id": 2365,
                        "name": "宁津县",
                        "sub": []
                    },
                    {
                        "id": 2366,
                        "name": "庆云县",
                        "sub": []
                    },
                    {
                        "id": 2367,
                        "name": "临邑县",
                        "sub": []
                    },
                    {
                        "id": 2368,
                        "name": "齐河县",
                        "sub": []
                    },
                    {
                        "id": 2369,
                        "name": "平原县",
                        "sub": []
                    },
                    {
                        "id": 2370,
                        "name": "夏津县",
                        "sub": []
                    },
                    {
                        "id": 2371,
                        "name": "武城县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 287,
                "name": "东营",
                "sub": [
                    {
                        "id": 2372,
                        "name": "东营区",
                        "sub": []
                    },
                    {
                        "id": 2373,
                        "name": "河口区",
                        "sub": []
                    },
                    {
                        "id": 2374,
                        "name": "垦利县",
                        "sub": []
                    },
                    {
                        "id": 2375,
                        "name": "利津县",
                        "sub": []
                    },
                    {
                        "id": 2376,
                        "name": "广饶县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 288,
                "name": "菏泽",
                "sub": [
                    {
                        "id": 2377,
                        "name": "牡丹区",
                        "sub": []
                    },
                    {
                        "id": 2378,
                        "name": "曹县",
                        "sub": []
                    },
                    {
                        "id": 2379,
                        "name": "单县",
                        "sub": []
                    },
                    {
                        "id": 2380,
                        "name": "成武县",
                        "sub": []
                    },
                    {
                        "id": 2381,
                        "name": "巨野县",
                        "sub": []
                    },
                    {
                        "id": 2382,
                        "name": "郓城县",
                        "sub": []
                    },
                    {
                        "id": 2383,
                        "name": "鄄城县",
                        "sub": []
                    },
                    {
                        "id": 2384,
                        "name": "定陶县",
                        "sub": []
                    },
                    {
                        "id": 2385,
                        "name": "东明县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 289,
                "name": "济宁",
                "sub": [
                    {
                        "id": 2386,
                        "name": "市中区",
                        "sub": []
                    },
                    {
                        "id": 2387,
                        "name": "任城区",
                        "sub": []
                    },
                    {
                        "id": 2388,
                        "name": "曲阜市",
                        "sub": []
                    },
                    {
                        "id": 2389,
                        "name": "兖州市",
                        "sub": []
                    },
                    {
                        "id": 2390,
                        "name": "邹城市",
                        "sub": []
                    },
                    {
                        "id": 2391,
                        "name": "微山县",
                        "sub": []
                    },
                    {
                        "id": 2392,
                        "name": "鱼台县",
                        "sub": []
                    },
                    {
                        "id": 2393,
                        "name": "金乡县",
                        "sub": []
                    },
                    {
                        "id": 2394,
                        "name": "嘉祥县",
                        "sub": []
                    },
                    {
                        "id": 2395,
                        "name": "汶上县",
                        "sub": []
                    },
                    {
                        "id": 2396,
                        "name": "泗水县",
                        "sub": []
                    },
                    {
                        "id": 2397,
                        "name": "梁山县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 290,
                "name": "莱芜",
                "sub": [
                    {
                        "id": 2398,
                        "name": "莱城区",
                        "sub": []
                    },
                    {
                        "id": 2399,
                        "name": "钢城区",
                        "sub": []
                    }
                ]
            },
            {
                "id": 291,
                "name": "聊城",
                "sub": [
                    {
                        "id": 2400,
                        "name": "东昌府区",
                        "sub": []
                    },
                    {
                        "id": 2401,
                        "name": "临清市",
                        "sub": []
                    },
                    {
                        "id": 2402,
                        "name": "阳谷县",
                        "sub": []
                    },
                    {
                        "id": 2403,
                        "name": "莘县",
                        "sub": []
                    },
                    {
                        "id": 2404,
                        "name": "茌平县",
                        "sub": []
                    },
                    {
                        "id": 2405,
                        "name": "东阿县",
                        "sub": []
                    },
                    {
                        "id": 2406,
                        "name": "冠县",
                        "sub": []
                    },
                    {
                        "id": 2407,
                        "name": "高唐县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 292,
                "name": "临沂",
                "sub": [
                    {
                        "id": 2408,
                        "name": "兰山区",
                        "sub": []
                    },
                    {
                        "id": 2409,
                        "name": "罗庄区",
                        "sub": []
                    },
                    {
                        "id": 2410,
                        "name": "河东区",
                        "sub": []
                    },
                    {
                        "id": 2411,
                        "name": "沂南县",
                        "sub": []
                    },
                    {
                        "id": 2412,
                        "name": "郯城县",
                        "sub": []
                    },
                    {
                        "id": 2413,
                        "name": "沂水县",
                        "sub": []
                    },
                    {
                        "id": 2414,
                        "name": "苍山县",
                        "sub": []
                    },
                    {
                        "id": 2415,
                        "name": "费县",
                        "sub": []
                    },
                    {
                        "id": 2416,
                        "name": "平邑县",
                        "sub": []
                    },
                    {
                        "id": 2417,
                        "name": "莒南县",
                        "sub": []
                    },
                    {
                        "id": 2418,
                        "name": "蒙阴县",
                        "sub": []
                    },
                    {
                        "id": 2419,
                        "name": "临沭县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 293,
                "name": "日照",
                "sub": [
                    {
                        "id": 2420,
                        "name": "东港区",
                        "sub": []
                    },
                    {
                        "id": 2421,
                        "name": "岚山区",
                        "sub": []
                    },
                    {
                        "id": 2422,
                        "name": "五莲县",
                        "sub": []
                    },
                    {
                        "id": 2423,
                        "name": "莒县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 294,
                "name": "泰安",
                "sub": [
                    {
                        "id": 2424,
                        "name": "泰山区",
                        "sub": []
                    },
                    {
                        "id": 2425,
                        "name": "岱岳区",
                        "sub": []
                    },
                    {
                        "id": 2426,
                        "name": "新泰市",
                        "sub": []
                    },
                    {
                        "id": 2427,
                        "name": "肥城市",
                        "sub": []
                    },
                    {
                        "id": 2428,
                        "name": "宁阳县",
                        "sub": []
                    },
                    {
                        "id": 2429,
                        "name": "东平县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 295,
                "name": "威海",
                "sub": [
                    {
                        "id": 2430,
                        "name": "荣成市",
                        "sub": []
                    },
                    {
                        "id": 2431,
                        "name": "乳山市",
                        "sub": []
                    },
                    {
                        "id": 2432,
                        "name": "环翠区",
                        "sub": []
                    },
                    {
                        "id": 2433,
                        "name": "文登市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 296,
                "name": "潍坊",
                "sub": [
                    {
                        "id": 2434,
                        "name": "潍城区",
                        "sub": []
                    },
                    {
                        "id": 2435,
                        "name": "寒亭区",
                        "sub": []
                    },
                    {
                        "id": 2436,
                        "name": "坊子区",
                        "sub": []
                    },
                    {
                        "id": 2437,
                        "name": "奎文区",
                        "sub": []
                    },
                    {
                        "id": 2438,
                        "name": "青州市",
                        "sub": []
                    },
                    {
                        "id": 2439,
                        "name": "诸城市",
                        "sub": []
                    },
                    {
                        "id": 2440,
                        "name": "寿光市",
                        "sub": []
                    },
                    {
                        "id": 2441,
                        "name": "安丘市",
                        "sub": []
                    },
                    {
                        "id": 2442,
                        "name": "高密市",
                        "sub": []
                    },
                    {
                        "id": 2443,
                        "name": "昌邑市",
                        "sub": []
                    },
                    {
                        "id": 2444,
                        "name": "临朐县",
                        "sub": []
                    },
                    {
                        "id": 2445,
                        "name": "昌乐县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 297,
                "name": "烟台",
                "sub": [
                    {
                        "id": 2446,
                        "name": "芝罘区",
                        "sub": []
                    },
                    {
                        "id": 2447,
                        "name": "福山区",
                        "sub": []
                    },
                    {
                        "id": 2448,
                        "name": "牟平区",
                        "sub": []
                    },
                    {
                        "id": 2449,
                        "name": "莱山区",
                        "sub": []
                    },
                    {
                        "id": 2450,
                        "name": "开发区",
                        "sub": []
                    },
                    {
                        "id": 2451,
                        "name": "龙口市",
                        "sub": []
                    },
                    {
                        "id": 2452,
                        "name": "莱阳市",
                        "sub": []
                    },
                    {
                        "id": 2453,
                        "name": "莱州市",
                        "sub": []
                    },
                    {
                        "id": 2454,
                        "name": "蓬莱市",
                        "sub": []
                    },
                    {
                        "id": 2455,
                        "name": "招远市",
                        "sub": []
                    },
                    {
                        "id": 2456,
                        "name": "栖霞市",
                        "sub": []
                    },
                    {
                        "id": 2457,
                        "name": "海阳市",
                        "sub": []
                    },
                    {
                        "id": 2458,
                        "name": "长岛县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 298,
                "name": "枣庄",
                "sub": [
                    {
                        "id": 2459,
                        "name": "市中区",
                        "sub": []
                    },
                    {
                        "id": 2460,
                        "name": "山亭区",
                        "sub": []
                    },
                    {
                        "id": 2461,
                        "name": "峄城区",
                        "sub": []
                    },
                    {
                        "id": 2462,
                        "name": "台儿庄区",
                        "sub": []
                    },
                    {
                        "id": 2463,
                        "name": "薛城区",
                        "sub": []
                    },
                    {
                        "id": 2464,
                        "name": "滕州市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 299,
                "name": "淄博",
                "sub": [
                    {
                        "id": 2465,
                        "name": "张店区",
                        "sub": []
                    },
                    {
                        "id": 2466,
                        "name": "临淄区",
                        "sub": []
                    },
                    {
                        "id": 2467,
                        "name": "淄川区",
                        "sub": []
                    },
                    {
                        "id": 2468,
                        "name": "博山区",
                        "sub": []
                    },
                    {
                        "id": 2469,
                        "name": "周村区",
                        "sub": []
                    },
                    {
                        "id": 2470,
                        "name": "桓台县",
                        "sub": []
                    },
                    {
                        "id": 2471,
                        "name": "高青县",
                        "sub": []
                    },
                    {
                        "id": 2472,
                        "name": "沂源县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 23,
        "name": "山西",
        "sub": [
            {
                "id": 300,
                "name": "太原",
                "sub": [
                    {
                        "id": 2473,
                        "name": "杏花岭区",
                        "sub": []
                    },
                    {
                        "id": 2474,
                        "name": "小店区",
                        "sub": []
                    },
                    {
                        "id": 2475,
                        "name": "迎泽区",
                        "sub": []
                    },
                    {
                        "id": 2476,
                        "name": "尖草坪区",
                        "sub": []
                    },
                    {
                        "id": 2477,
                        "name": "万柏林区",
                        "sub": []
                    },
                    {
                        "id": 2478,
                        "name": "晋源区",
                        "sub": []
                    },
                    {
                        "id": 2479,
                        "name": "高新开发区",
                        "sub": []
                    },
                    {
                        "id": 2480,
                        "name": "民营经济开发区",
                        "sub": []
                    },
                    {
                        "id": 2481,
                        "name": "经济技术开发区",
                        "sub": []
                    },
                    {
                        "id": 2482,
                        "name": "清徐县",
                        "sub": []
                    },
                    {
                        "id": 2483,
                        "name": "阳曲县",
                        "sub": []
                    },
                    {
                        "id": 2484,
                        "name": "娄烦县",
                        "sub": []
                    },
                    {
                        "id": 2485,
                        "name": "古交市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 301,
                "name": "长治",
                "sub": [
                    {
                        "id": 2486,
                        "name": "城区",
                        "sub": []
                    },
                    {
                        "id": 2487,
                        "name": "郊区",
                        "sub": []
                    },
                    {
                        "id": 2488,
                        "name": "沁县",
                        "sub": []
                    },
                    {
                        "id": 2489,
                        "name": "潞城市",
                        "sub": []
                    },
                    {
                        "id": 2490,
                        "name": "长治县",
                        "sub": []
                    },
                    {
                        "id": 2491,
                        "name": "襄垣县",
                        "sub": []
                    },
                    {
                        "id": 2492,
                        "name": "屯留县",
                        "sub": []
                    },
                    {
                        "id": 2493,
                        "name": "平顺县",
                        "sub": []
                    },
                    {
                        "id": 2494,
                        "name": "黎城县",
                        "sub": []
                    },
                    {
                        "id": 2495,
                        "name": "壶关县",
                        "sub": []
                    },
                    {
                        "id": 2496,
                        "name": "长子县",
                        "sub": []
                    },
                    {
                        "id": 2497,
                        "name": "武乡县",
                        "sub": []
                    },
                    {
                        "id": 2498,
                        "name": "沁源县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 302,
                "name": "大同",
                "sub": [
                    {
                        "id": 2499,
                        "name": "城区",
                        "sub": []
                    },
                    {
                        "id": 2500,
                        "name": "矿区",
                        "sub": []
                    },
                    {
                        "id": 2501,
                        "name": "南郊区",
                        "sub": []
                    },
                    {
                        "id": 2502,
                        "name": "新荣区",
                        "sub": []
                    },
                    {
                        "id": 2503,
                        "name": "阳高县",
                        "sub": []
                    },
                    {
                        "id": 2504,
                        "name": "天镇县",
                        "sub": []
                    },
                    {
                        "id": 2505,
                        "name": "广灵县",
                        "sub": []
                    },
                    {
                        "id": 2506,
                        "name": "灵丘县",
                        "sub": []
                    },
                    {
                        "id": 2507,
                        "name": "浑源县",
                        "sub": []
                    },
                    {
                        "id": 2508,
                        "name": "左云县",
                        "sub": []
                    },
                    {
                        "id": 2509,
                        "name": "大同县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 303,
                "name": "晋城",
                "sub": [
                    {
                        "id": 2510,
                        "name": "城区",
                        "sub": []
                    },
                    {
                        "id": 2511,
                        "name": "高平市",
                        "sub": []
                    },
                    {
                        "id": 2512,
                        "name": "沁水县",
                        "sub": []
                    },
                    {
                        "id": 2513,
                        "name": "阳城县",
                        "sub": []
                    },
                    {
                        "id": 2514,
                        "name": "陵川县",
                        "sub": []
                    },
                    {
                        "id": 2515,
                        "name": "泽州县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 304,
                "name": "晋中",
                "sub": [
                    {
                        "id": 2516,
                        "name": "榆次区",
                        "sub": []
                    },
                    {
                        "id": 2517,
                        "name": "介休市",
                        "sub": []
                    },
                    {
                        "id": 2518,
                        "name": "榆社县",
                        "sub": []
                    },
                    {
                        "id": 2519,
                        "name": "左权县",
                        "sub": []
                    },
                    {
                        "id": 2520,
                        "name": "和顺县",
                        "sub": []
                    },
                    {
                        "id": 2521,
                        "name": "昔阳县",
                        "sub": []
                    },
                    {
                        "id": 2522,
                        "name": "寿阳县",
                        "sub": []
                    },
                    {
                        "id": 2523,
                        "name": "太谷县",
                        "sub": []
                    },
                    {
                        "id": 2524,
                        "name": "祁县",
                        "sub": []
                    },
                    {
                        "id": 2525,
                        "name": "平遥县",
                        "sub": []
                    },
                    {
                        "id": 2526,
                        "name": "灵石县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 305,
                "name": "临汾",
                "sub": [
                    {
                        "id": 2527,
                        "name": "尧都区",
                        "sub": []
                    },
                    {
                        "id": 2528,
                        "name": "侯马市",
                        "sub": []
                    },
                    {
                        "id": 2529,
                        "name": "霍州市",
                        "sub": []
                    },
                    {
                        "id": 2530,
                        "name": "曲沃县",
                        "sub": []
                    },
                    {
                        "id": 2531,
                        "name": "翼城县",
                        "sub": []
                    },
                    {
                        "id": 2532,
                        "name": "襄汾县",
                        "sub": []
                    },
                    {
                        "id": 2533,
                        "name": "洪洞县",
                        "sub": []
                    },
                    {
                        "id": 2534,
                        "name": "吉县",
                        "sub": []
                    },
                    {
                        "id": 2535,
                        "name": "安泽县",
                        "sub": []
                    },
                    {
                        "id": 2536,
                        "name": "浮山县",
                        "sub": []
                    },
                    {
                        "id": 2537,
                        "name": "古县",
                        "sub": []
                    },
                    {
                        "id": 2538,
                        "name": "乡宁县",
                        "sub": []
                    },
                    {
                        "id": 2539,
                        "name": "大宁县",
                        "sub": []
                    },
                    {
                        "id": 2540,
                        "name": "隰县",
                        "sub": []
                    },
                    {
                        "id": 2541,
                        "name": "永和县",
                        "sub": []
                    },
                    {
                        "id": 2542,
                        "name": "蒲县",
                        "sub": []
                    },
                    {
                        "id": 2543,
                        "name": "汾西县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 306,
                "name": "吕梁",
                "sub": [
                    {
                        "id": 2544,
                        "name": "离石市",
                        "sub": []
                    },
                    {
                        "id": 2545,
                        "name": "离石区",
                        "sub": []
                    },
                    {
                        "id": 2546,
                        "name": "孝义市",
                        "sub": []
                    },
                    {
                        "id": 2547,
                        "name": "汾阳市",
                        "sub": []
                    },
                    {
                        "id": 2548,
                        "name": "文水县",
                        "sub": []
                    },
                    {
                        "id": 2549,
                        "name": "交城县",
                        "sub": []
                    },
                    {
                        "id": 2550,
                        "name": "兴县",
                        "sub": []
                    },
                    {
                        "id": 2551,
                        "name": "临县",
                        "sub": []
                    },
                    {
                        "id": 2552,
                        "name": "柳林县",
                        "sub": []
                    },
                    {
                        "id": 2553,
                        "name": "石楼县",
                        "sub": []
                    },
                    {
                        "id": 2554,
                        "name": "岚县",
                        "sub": []
                    },
                    {
                        "id": 2555,
                        "name": "方山县",
                        "sub": []
                    },
                    {
                        "id": 2556,
                        "name": "中阳县",
                        "sub": []
                    },
                    {
                        "id": 2557,
                        "name": "交口县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 307,
                "name": "朔州",
                "sub": [
                    {
                        "id": 2558,
                        "name": "朔城区",
                        "sub": []
                    },
                    {
                        "id": 2559,
                        "name": "平鲁区",
                        "sub": []
                    },
                    {
                        "id": 2560,
                        "name": "山阴县",
                        "sub": []
                    },
                    {
                        "id": 2561,
                        "name": "应县",
                        "sub": []
                    },
                    {
                        "id": 2562,
                        "name": "右玉县",
                        "sub": []
                    },
                    {
                        "id": 2563,
                        "name": "怀仁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 308,
                "name": "忻州",
                "sub": [
                    {
                        "id": 2564,
                        "name": "忻府区",
                        "sub": []
                    },
                    {
                        "id": 2565,
                        "name": "原平市",
                        "sub": []
                    },
                    {
                        "id": 2566,
                        "name": "定襄县",
                        "sub": []
                    },
                    {
                        "id": 2567,
                        "name": "五台县",
                        "sub": []
                    },
                    {
                        "id": 2568,
                        "name": "代县",
                        "sub": []
                    },
                    {
                        "id": 2569,
                        "name": "繁峙县",
                        "sub": []
                    },
                    {
                        "id": 2570,
                        "name": "宁武县",
                        "sub": []
                    },
                    {
                        "id": 2571,
                        "name": "静乐县",
                        "sub": []
                    },
                    {
                        "id": 2572,
                        "name": "神池县",
                        "sub": []
                    },
                    {
                        "id": 2573,
                        "name": "五寨县",
                        "sub": []
                    },
                    {
                        "id": 2574,
                        "name": "岢岚县",
                        "sub": []
                    },
                    {
                        "id": 2575,
                        "name": "河曲县",
                        "sub": []
                    },
                    {
                        "id": 2576,
                        "name": "保德县",
                        "sub": []
                    },
                    {
                        "id": 2577,
                        "name": "偏关县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 309,
                "name": "阳泉",
                "sub": [
                    {
                        "id": 2578,
                        "name": "城区",
                        "sub": []
                    },
                    {
                        "id": 2579,
                        "name": "矿区",
                        "sub": []
                    },
                    {
                        "id": 2580,
                        "name": "郊区",
                        "sub": []
                    },
                    {
                        "id": 2581,
                        "name": "平定县",
                        "sub": []
                    },
                    {
                        "id": 2582,
                        "name": "盂县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 310,
                "name": "运城",
                "sub": [
                    {
                        "id": 2583,
                        "name": "盐湖区",
                        "sub": []
                    },
                    {
                        "id": 2584,
                        "name": "永济市",
                        "sub": []
                    },
                    {
                        "id": 2585,
                        "name": "河津市",
                        "sub": []
                    },
                    {
                        "id": 2586,
                        "name": "临猗县",
                        "sub": []
                    },
                    {
                        "id": 2587,
                        "name": "万荣县",
                        "sub": []
                    },
                    {
                        "id": 2588,
                        "name": "闻喜县",
                        "sub": []
                    },
                    {
                        "id": 2589,
                        "name": "稷山县",
                        "sub": []
                    },
                    {
                        "id": 2590,
                        "name": "新绛县",
                        "sub": []
                    },
                    {
                        "id": 2591,
                        "name": "绛县",
                        "sub": []
                    },
                    {
                        "id": 2592,
                        "name": "垣曲县",
                        "sub": []
                    },
                    {
                        "id": 2593,
                        "name": "夏县",
                        "sub": []
                    },
                    {
                        "id": 2594,
                        "name": "平陆县",
                        "sub": []
                    },
                    {
                        "id": 2595,
                        "name": "芮城县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 24,
        "name": "陕西",
        "sub": [
            {
                "id": 311,
                "name": "西安",
                "sub": [
                    {
                        "id": 2596,
                        "name": "莲湖区",
                        "sub": []
                    },
                    {
                        "id": 2597,
                        "name": "新城区",
                        "sub": []
                    },
                    {
                        "id": 2598,
                        "name": "碑林区",
                        "sub": []
                    },
                    {
                        "id": 2599,
                        "name": "雁塔区",
                        "sub": []
                    },
                    {
                        "id": 2600,
                        "name": "灞桥区",
                        "sub": []
                    },
                    {
                        "id": 2601,
                        "name": "未央区",
                        "sub": []
                    },
                    {
                        "id": 2602,
                        "name": "阎良区",
                        "sub": []
                    },
                    {
                        "id": 2603,
                        "name": "临潼区",
                        "sub": []
                    },
                    {
                        "id": 2604,
                        "name": "长安区",
                        "sub": []
                    },
                    {
                        "id": 2605,
                        "name": "蓝田县",
                        "sub": []
                    },
                    {
                        "id": 2606,
                        "name": "周至县",
                        "sub": []
                    },
                    {
                        "id": 2607,
                        "name": "户县",
                        "sub": []
                    },
                    {
                        "id": 2608,
                        "name": "高陵县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 312,
                "name": "安康",
                "sub": [
                    {
                        "id": 2609,
                        "name": "汉滨区",
                        "sub": []
                    },
                    {
                        "id": 2610,
                        "name": "汉阴县",
                        "sub": []
                    },
                    {
                        "id": 2611,
                        "name": "石泉县",
                        "sub": []
                    },
                    {
                        "id": 2612,
                        "name": "宁陕县",
                        "sub": []
                    },
                    {
                        "id": 2613,
                        "name": "紫阳县",
                        "sub": []
                    },
                    {
                        "id": 2614,
                        "name": "岚皋县",
                        "sub": []
                    },
                    {
                        "id": 2615,
                        "name": "平利县",
                        "sub": []
                    },
                    {
                        "id": 2616,
                        "name": "镇坪县",
                        "sub": []
                    },
                    {
                        "id": 2617,
                        "name": "旬阳县",
                        "sub": []
                    },
                    {
                        "id": 2618,
                        "name": "白河县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 313,
                "name": "宝鸡",
                "sub": [
                    {
                        "id": 2619,
                        "name": "陈仓区",
                        "sub": []
                    },
                    {
                        "id": 2620,
                        "name": "渭滨区",
                        "sub": []
                    },
                    {
                        "id": 2621,
                        "name": "金台区",
                        "sub": []
                    },
                    {
                        "id": 2622,
                        "name": "凤翔县",
                        "sub": []
                    },
                    {
                        "id": 2623,
                        "name": "岐山县",
                        "sub": []
                    },
                    {
                        "id": 2624,
                        "name": "扶风县",
                        "sub": []
                    },
                    {
                        "id": 2625,
                        "name": "眉县",
                        "sub": []
                    },
                    {
                        "id": 2626,
                        "name": "陇县",
                        "sub": []
                    },
                    {
                        "id": 2627,
                        "name": "千阳县",
                        "sub": []
                    },
                    {
                        "id": 2628,
                        "name": "麟游县",
                        "sub": []
                    },
                    {
                        "id": 2629,
                        "name": "凤县",
                        "sub": []
                    },
                    {
                        "id": 2630,
                        "name": "太白县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 314,
                "name": "汉中",
                "sub": [
                    {
                        "id": 2631,
                        "name": "汉台区",
                        "sub": []
                    },
                    {
                        "id": 2632,
                        "name": "南郑县",
                        "sub": []
                    },
                    {
                        "id": 2633,
                        "name": "城固县",
                        "sub": []
                    },
                    {
                        "id": 2634,
                        "name": "洋县",
                        "sub": []
                    },
                    {
                        "id": 2635,
                        "name": "西乡县",
                        "sub": []
                    },
                    {
                        "id": 2636,
                        "name": "勉县",
                        "sub": []
                    },
                    {
                        "id": 2637,
                        "name": "宁强县",
                        "sub": []
                    },
                    {
                        "id": 2638,
                        "name": "略阳县",
                        "sub": []
                    },
                    {
                        "id": 2639,
                        "name": "镇巴县",
                        "sub": []
                    },
                    {
                        "id": 2640,
                        "name": "留坝县",
                        "sub": []
                    },
                    {
                        "id": 2641,
                        "name": "佛坪县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 315,
                "name": "商洛",
                "sub": [
                    {
                        "id": 2642,
                        "name": "商州区",
                        "sub": []
                    },
                    {
                        "id": 2643,
                        "name": "洛南县",
                        "sub": []
                    },
                    {
                        "id": 2644,
                        "name": "丹凤县",
                        "sub": []
                    },
                    {
                        "id": 2645,
                        "name": "商南县",
                        "sub": []
                    },
                    {
                        "id": 2646,
                        "name": "山阳县",
                        "sub": []
                    },
                    {
                        "id": 2647,
                        "name": "镇安县",
                        "sub": []
                    },
                    {
                        "id": 2648,
                        "name": "柞水县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 316,
                "name": "铜川",
                "sub": [
                    {
                        "id": 2649,
                        "name": "耀州区",
                        "sub": []
                    },
                    {
                        "id": 2650,
                        "name": "王益区",
                        "sub": []
                    },
                    {
                        "id": 2651,
                        "name": "印台区",
                        "sub": []
                    },
                    {
                        "id": 2652,
                        "name": "宜君县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 317,
                "name": "渭南",
                "sub": [
                    {
                        "id": 2653,
                        "name": "临渭区",
                        "sub": []
                    },
                    {
                        "id": 2654,
                        "name": "韩城市",
                        "sub": []
                    },
                    {
                        "id": 2655,
                        "name": "华阴市",
                        "sub": []
                    },
                    {
                        "id": 2656,
                        "name": "华县",
                        "sub": []
                    },
                    {
                        "id": 2657,
                        "name": "潼关县",
                        "sub": []
                    },
                    {
                        "id": 2658,
                        "name": "大荔县",
                        "sub": []
                    },
                    {
                        "id": 2659,
                        "name": "合阳县",
                        "sub": []
                    },
                    {
                        "id": 2660,
                        "name": "澄城县",
                        "sub": []
                    },
                    {
                        "id": 2661,
                        "name": "蒲城县",
                        "sub": []
                    },
                    {
                        "id": 2662,
                        "name": "白水县",
                        "sub": []
                    },
                    {
                        "id": 2663,
                        "name": "富平县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 318,
                "name": "咸阳",
                "sub": [
                    {
                        "id": 2664,
                        "name": "秦都区",
                        "sub": []
                    },
                    {
                        "id": 2665,
                        "name": "渭城区",
                        "sub": []
                    },
                    {
                        "id": 2666,
                        "name": "杨陵区",
                        "sub": []
                    },
                    {
                        "id": 2667,
                        "name": "兴平市",
                        "sub": []
                    },
                    {
                        "id": 2668,
                        "name": "三原县",
                        "sub": []
                    },
                    {
                        "id": 2669,
                        "name": "泾阳县",
                        "sub": []
                    },
                    {
                        "id": 2670,
                        "name": "乾县",
                        "sub": []
                    },
                    {
                        "id": 2671,
                        "name": "礼泉县",
                        "sub": []
                    },
                    {
                        "id": 2672,
                        "name": "永寿县",
                        "sub": []
                    },
                    {
                        "id": 2673,
                        "name": "彬县",
                        "sub": []
                    },
                    {
                        "id": 2674,
                        "name": "长武县",
                        "sub": []
                    },
                    {
                        "id": 2675,
                        "name": "旬邑县",
                        "sub": []
                    },
                    {
                        "id": 2676,
                        "name": "淳化县",
                        "sub": []
                    },
                    {
                        "id": 2677,
                        "name": "武功县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 319,
                "name": "延安",
                "sub": [
                    {
                        "id": 2678,
                        "name": "吴起县",
                        "sub": []
                    },
                    {
                        "id": 2679,
                        "name": "宝塔区",
                        "sub": []
                    },
                    {
                        "id": 2680,
                        "name": "延长县",
                        "sub": []
                    },
                    {
                        "id": 2681,
                        "name": "延川县",
                        "sub": []
                    },
                    {
                        "id": 2682,
                        "name": "子长县",
                        "sub": []
                    },
                    {
                        "id": 2683,
                        "name": "安塞县",
                        "sub": []
                    },
                    {
                        "id": 2684,
                        "name": "志丹县",
                        "sub": []
                    },
                    {
                        "id": 2685,
                        "name": "甘泉县",
                        "sub": []
                    },
                    {
                        "id": 2686,
                        "name": "富县",
                        "sub": []
                    },
                    {
                        "id": 2687,
                        "name": "洛川县",
                        "sub": []
                    },
                    {
                        "id": 2688,
                        "name": "宜川县",
                        "sub": []
                    },
                    {
                        "id": 2689,
                        "name": "黄龙县",
                        "sub": []
                    },
                    {
                        "id": 2690,
                        "name": "黄陵县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 320,
                "name": "榆林",
                "sub": [
                    {
                        "id": 2691,
                        "name": "榆阳区",
                        "sub": []
                    },
                    {
                        "id": 2692,
                        "name": "神木县",
                        "sub": []
                    },
                    {
                        "id": 2693,
                        "name": "府谷县",
                        "sub": []
                    },
                    {
                        "id": 2694,
                        "name": "横山县",
                        "sub": []
                    },
                    {
                        "id": 2695,
                        "name": "靖边县",
                        "sub": []
                    },
                    {
                        "id": 2696,
                        "name": "定边县",
                        "sub": []
                    },
                    {
                        "id": 2697,
                        "name": "绥德县",
                        "sub": []
                    },
                    {
                        "id": 2698,
                        "name": "米脂县",
                        "sub": []
                    },
                    {
                        "id": 2699,
                        "name": "佳县",
                        "sub": []
                    },
                    {
                        "id": 2700,
                        "name": "吴堡县",
                        "sub": []
                    },
                    {
                        "id": 2701,
                        "name": "清涧县",
                        "sub": []
                    },
                    {
                        "id": 2702,
                        "name": "子洲县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 25,
        "name": "上海",
        "sub": [
            {
                "id": 321,
                "name": "上海",
                "sub": [
                    {
                        "id": 2703,
                        "name": "长宁区",
                        "sub": []
                    },
                    {
                        "id": 2704,
                        "name": "闸北区",
                        "sub": []
                    },
                    {
                        "id": 2705,
                        "name": "闵行区",
                        "sub": []
                    },
                    {
                        "id": 2706,
                        "name": "徐汇区",
                        "sub": []
                    },
                    {
                        "id": 2707,
                        "name": "浦东新区",
                        "sub": []
                    },
                    {
                        "id": 2708,
                        "name": "杨浦区",
                        "sub": []
                    },
                    {
                        "id": 2709,
                        "name": "普陀区",
                        "sub": []
                    },
                    {
                        "id": 2710,
                        "name": "静安区",
                        "sub": []
                    },
                    {
                        "id": 2711,
                        "name": "卢湾区",
                        "sub": []
                    },
                    {
                        "id": 2712,
                        "name": "虹口区",
                        "sub": []
                    },
                    {
                        "id": 2713,
                        "name": "黄浦区",
                        "sub": []
                    },
                    {
                        "id": 2714,
                        "name": "南汇区",
                        "sub": []
                    },
                    {
                        "id": 2715,
                        "name": "松江区",
                        "sub": []
                    },
                    {
                        "id": 2716,
                        "name": "嘉定区",
                        "sub": []
                    },
                    {
                        "id": 2717,
                        "name": "宝山区",
                        "sub": []
                    },
                    {
                        "id": 2718,
                        "name": "青浦区",
                        "sub": []
                    },
                    {
                        "id": 2719,
                        "name": "金山区",
                        "sub": []
                    },
                    {
                        "id": 2720,
                        "name": "奉贤区",
                        "sub": []
                    },
                    {
                        "id": 2721,
                        "name": "崇明县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 26,
        "name": "四川",
        "sub": [
            {
                "id": 322,
                "name": "成都",
                "sub": [
                    {
                        "id": 2722,
                        "name": "青羊区",
                        "sub": []
                    },
                    {
                        "id": 2723,
                        "name": "锦江区",
                        "sub": []
                    },
                    {
                        "id": 2724,
                        "name": "金牛区",
                        "sub": []
                    },
                    {
                        "id": 2725,
                        "name": "武侯区",
                        "sub": []
                    },
                    {
                        "id": 2726,
                        "name": "成华区",
                        "sub": []
                    },
                    {
                        "id": 2727,
                        "name": "龙泉驿区",
                        "sub": []
                    },
                    {
                        "id": 2728,
                        "name": "青白江区",
                        "sub": []
                    },
                    {
                        "id": 2729,
                        "name": "新都区",
                        "sub": []
                    },
                    {
                        "id": 2730,
                        "name": "温江区",
                        "sub": []
                    },
                    {
                        "id": 2731,
                        "name": "高新区",
                        "sub": []
                    },
                    {
                        "id": 2732,
                        "name": "高新西区",
                        "sub": []
                    },
                    {
                        "id": 2733,
                        "name": "都江堰市",
                        "sub": []
                    },
                    {
                        "id": 2734,
                        "name": "彭州市",
                        "sub": []
                    },
                    {
                        "id": 2735,
                        "name": "邛崃市",
                        "sub": []
                    },
                    {
                        "id": 2736,
                        "name": "崇州市",
                        "sub": []
                    },
                    {
                        "id": 2737,
                        "name": "金堂县",
                        "sub": []
                    },
                    {
                        "id": 2738,
                        "name": "双流县",
                        "sub": []
                    },
                    {
                        "id": 2739,
                        "name": "郫县",
                        "sub": []
                    },
                    {
                        "id": 2740,
                        "name": "大邑县",
                        "sub": []
                    },
                    {
                        "id": 2741,
                        "name": "蒲江县",
                        "sub": []
                    },
                    {
                        "id": 2742,
                        "name": "新津县",
                        "sub": []
                    },
                    {
                        "id": 2743,
                        "name": "都江堰市",
                        "sub": []
                    },
                    {
                        "id": 2744,
                        "name": "彭州市",
                        "sub": []
                    },
                    {
                        "id": 2745,
                        "name": "邛崃市",
                        "sub": []
                    },
                    {
                        "id": 2746,
                        "name": "崇州市",
                        "sub": []
                    },
                    {
                        "id": 2747,
                        "name": "金堂县",
                        "sub": []
                    },
                    {
                        "id": 2748,
                        "name": "双流县",
                        "sub": []
                    },
                    {
                        "id": 2749,
                        "name": "郫县",
                        "sub": []
                    },
                    {
                        "id": 2750,
                        "name": "大邑县",
                        "sub": []
                    },
                    {
                        "id": 2751,
                        "name": "蒲江县",
                        "sub": []
                    },
                    {
                        "id": 2752,
                        "name": "新津县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 323,
                "name": "绵阳",
                "sub": [
                    {
                        "id": 2753,
                        "name": "涪城区",
                        "sub": []
                    },
                    {
                        "id": 2754,
                        "name": "游仙区",
                        "sub": []
                    },
                    {
                        "id": 2755,
                        "name": "江油市",
                        "sub": []
                    },
                    {
                        "id": 2756,
                        "name": "盐亭县",
                        "sub": []
                    },
                    {
                        "id": 2757,
                        "name": "三台县",
                        "sub": []
                    },
                    {
                        "id": 2758,
                        "name": "平武县",
                        "sub": []
                    },
                    {
                        "id": 2759,
                        "name": "安县",
                        "sub": []
                    },
                    {
                        "id": 2760,
                        "name": "梓潼县",
                        "sub": []
                    },
                    {
                        "id": 2761,
                        "name": "北川县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 324,
                "name": "阿坝",
                "sub": [
                    {
                        "id": 2762,
                        "name": "马尔康县",
                        "sub": []
                    },
                    {
                        "id": 2763,
                        "name": "汶川县",
                        "sub": []
                    },
                    {
                        "id": 2764,
                        "name": "理县",
                        "sub": []
                    },
                    {
                        "id": 2765,
                        "name": "茂县",
                        "sub": []
                    },
                    {
                        "id": 2766,
                        "name": "松潘县",
                        "sub": []
                    },
                    {
                        "id": 2767,
                        "name": "九寨沟县",
                        "sub": []
                    },
                    {
                        "id": 2768,
                        "name": "金川县",
                        "sub": []
                    },
                    {
                        "id": 2769,
                        "name": "小金县",
                        "sub": []
                    },
                    {
                        "id": 2770,
                        "name": "黑水县",
                        "sub": []
                    },
                    {
                        "id": 2771,
                        "name": "壤塘县",
                        "sub": []
                    },
                    {
                        "id": 2772,
                        "name": "阿坝县",
                        "sub": []
                    },
                    {
                        "id": 2773,
                        "name": "若尔盖县",
                        "sub": []
                    },
                    {
                        "id": 2774,
                        "name": "红原县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 325,
                "name": "巴中",
                "sub": [
                    {
                        "id": 2775,
                        "name": "巴州区",
                        "sub": []
                    },
                    {
                        "id": 2776,
                        "name": "通江县",
                        "sub": []
                    },
                    {
                        "id": 2777,
                        "name": "南江县",
                        "sub": []
                    },
                    {
                        "id": 2778,
                        "name": "平昌县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 326,
                "name": "达州",
                "sub": [
                    {
                        "id": 2779,
                        "name": "通川区",
                        "sub": []
                    },
                    {
                        "id": 2780,
                        "name": "万源市",
                        "sub": []
                    },
                    {
                        "id": 2781,
                        "name": "达县",
                        "sub": []
                    },
                    {
                        "id": 2782,
                        "name": "宣汉县",
                        "sub": []
                    },
                    {
                        "id": 2783,
                        "name": "开江县",
                        "sub": []
                    },
                    {
                        "id": 2784,
                        "name": "大竹县",
                        "sub": []
                    },
                    {
                        "id": 2785,
                        "name": "渠县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 327,
                "name": "德阳",
                "sub": [
                    {
                        "id": 2786,
                        "name": "旌阳区",
                        "sub": []
                    },
                    {
                        "id": 2787,
                        "name": "广汉市",
                        "sub": []
                    },
                    {
                        "id": 2788,
                        "name": "什邡市",
                        "sub": []
                    },
                    {
                        "id": 2789,
                        "name": "绵竹市",
                        "sub": []
                    },
                    {
                        "id": 2790,
                        "name": "罗江县",
                        "sub": []
                    },
                    {
                        "id": 2791,
                        "name": "中江县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 328,
                "name": "甘孜",
                "sub": [
                    {
                        "id": 2792,
                        "name": "康定县",
                        "sub": []
                    },
                    {
                        "id": 2793,
                        "name": "丹巴县",
                        "sub": []
                    },
                    {
                        "id": 2794,
                        "name": "泸定县",
                        "sub": []
                    },
                    {
                        "id": 2795,
                        "name": "炉霍县",
                        "sub": []
                    },
                    {
                        "id": 2796,
                        "name": "九龙县",
                        "sub": []
                    },
                    {
                        "id": 2797,
                        "name": "甘孜县",
                        "sub": []
                    },
                    {
                        "id": 2798,
                        "name": "雅江县",
                        "sub": []
                    },
                    {
                        "id": 2799,
                        "name": "新龙县",
                        "sub": []
                    },
                    {
                        "id": 2800,
                        "name": "道孚县",
                        "sub": []
                    },
                    {
                        "id": 2801,
                        "name": "白玉县",
                        "sub": []
                    },
                    {
                        "id": 2802,
                        "name": "理塘县",
                        "sub": []
                    },
                    {
                        "id": 2803,
                        "name": "德格县",
                        "sub": []
                    },
                    {
                        "id": 2804,
                        "name": "乡城县",
                        "sub": []
                    },
                    {
                        "id": 2805,
                        "name": "石渠县",
                        "sub": []
                    },
                    {
                        "id": 2806,
                        "name": "稻城县",
                        "sub": []
                    },
                    {
                        "id": 2807,
                        "name": "色达县",
                        "sub": []
                    },
                    {
                        "id": 2808,
                        "name": "巴塘县",
                        "sub": []
                    },
                    {
                        "id": 2809,
                        "name": "得荣县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 329,
                "name": "广安",
                "sub": [
                    {
                        "id": 2810,
                        "name": "广安区",
                        "sub": []
                    },
                    {
                        "id": 2811,
                        "name": "华蓥市",
                        "sub": []
                    },
                    {
                        "id": 2812,
                        "name": "岳池县",
                        "sub": []
                    },
                    {
                        "id": 2813,
                        "name": "武胜县",
                        "sub": []
                    },
                    {
                        "id": 2814,
                        "name": "邻水县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 330,
                "name": "广元",
                "sub": [
                    {
                        "id": 2815,
                        "name": "利州区",
                        "sub": []
                    },
                    {
                        "id": 2816,
                        "name": "元坝区",
                        "sub": []
                    },
                    {
                        "id": 2817,
                        "name": "朝天区",
                        "sub": []
                    },
                    {
                        "id": 2818,
                        "name": "旺苍县",
                        "sub": []
                    },
                    {
                        "id": 2819,
                        "name": "青川县",
                        "sub": []
                    },
                    {
                        "id": 2820,
                        "name": "剑阁县",
                        "sub": []
                    },
                    {
                        "id": 2821,
                        "name": "苍溪县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 331,
                "name": "乐山",
                "sub": [
                    {
                        "id": 2822,
                        "name": "峨眉山市",
                        "sub": []
                    },
                    {
                        "id": 2823,
                        "name": "乐山市",
                        "sub": []
                    },
                    {
                        "id": 2824,
                        "name": "犍为县",
                        "sub": []
                    },
                    {
                        "id": 2825,
                        "name": "井研县",
                        "sub": []
                    },
                    {
                        "id": 2826,
                        "name": "夹江县",
                        "sub": []
                    },
                    {
                        "id": 2827,
                        "name": "沐川县",
                        "sub": []
                    },
                    {
                        "id": 2828,
                        "name": "峨边",
                        "sub": []
                    },
                    {
                        "id": 2829,
                        "name": "马边",
                        "sub": []
                    }
                ]
            },
            {
                "id": 332,
                "name": "凉山",
                "sub": [
                    {
                        "id": 2830,
                        "name": "西昌市",
                        "sub": []
                    },
                    {
                        "id": 2831,
                        "name": "盐源县",
                        "sub": []
                    },
                    {
                        "id": 2832,
                        "name": "德昌县",
                        "sub": []
                    },
                    {
                        "id": 2833,
                        "name": "会理县",
                        "sub": []
                    },
                    {
                        "id": 2834,
                        "name": "会东县",
                        "sub": []
                    },
                    {
                        "id": 2835,
                        "name": "宁南县",
                        "sub": []
                    },
                    {
                        "id": 2836,
                        "name": "普格县",
                        "sub": []
                    },
                    {
                        "id": 2837,
                        "name": "布拖县",
                        "sub": []
                    },
                    {
                        "id": 2838,
                        "name": "金阳县",
                        "sub": []
                    },
                    {
                        "id": 2839,
                        "name": "昭觉县",
                        "sub": []
                    },
                    {
                        "id": 2840,
                        "name": "喜德县",
                        "sub": []
                    },
                    {
                        "id": 2841,
                        "name": "冕宁县",
                        "sub": []
                    },
                    {
                        "id": 2842,
                        "name": "越西县",
                        "sub": []
                    },
                    {
                        "id": 2843,
                        "name": "甘洛县",
                        "sub": []
                    },
                    {
                        "id": 2844,
                        "name": "美姑县",
                        "sub": []
                    },
                    {
                        "id": 2845,
                        "name": "雷波县",
                        "sub": []
                    },
                    {
                        "id": 2846,
                        "name": "木里",
                        "sub": []
                    }
                ]
            },
            {
                "id": 333,
                "name": "眉山",
                "sub": [
                    {
                        "id": 2847,
                        "name": "东坡区",
                        "sub": []
                    },
                    {
                        "id": 2848,
                        "name": "仁寿县",
                        "sub": []
                    },
                    {
                        "id": 2849,
                        "name": "彭山县",
                        "sub": []
                    },
                    {
                        "id": 2850,
                        "name": "洪雅县",
                        "sub": []
                    },
                    {
                        "id": 2851,
                        "name": "丹棱县",
                        "sub": []
                    },
                    {
                        "id": 2852,
                        "name": "青神县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 334,
                "name": "南充",
                "sub": [
                    {
                        "id": 2853,
                        "name": "阆中市",
                        "sub": []
                    },
                    {
                        "id": 2854,
                        "name": "南部县",
                        "sub": []
                    },
                    {
                        "id": 2855,
                        "name": "营山县",
                        "sub": []
                    },
                    {
                        "id": 2856,
                        "name": "蓬安县",
                        "sub": []
                    },
                    {
                        "id": 2857,
                        "name": "仪陇县",
                        "sub": []
                    },
                    {
                        "id": 2858,
                        "name": "顺庆区",
                        "sub": []
                    },
                    {
                        "id": 2859,
                        "name": "高坪区",
                        "sub": []
                    },
                    {
                        "id": 2860,
                        "name": "嘉陵区",
                        "sub": []
                    },
                    {
                        "id": 2861,
                        "name": "西充县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 335,
                "name": "内江",
                "sub": [
                    {
                        "id": 2862,
                        "name": "市中区",
                        "sub": []
                    },
                    {
                        "id": 2863,
                        "name": "东兴区",
                        "sub": []
                    },
                    {
                        "id": 2864,
                        "name": "威远县",
                        "sub": []
                    },
                    {
                        "id": 2865,
                        "name": "资中县",
                        "sub": []
                    },
                    {
                        "id": 2866,
                        "name": "隆昌县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 336,
                "name": "攀枝花",
                "sub": [
                    {
                        "id": 2867,
                        "name": "东  区",
                        "sub": []
                    },
                    {
                        "id": 2868,
                        "name": "西  区",
                        "sub": []
                    },
                    {
                        "id": 2869,
                        "name": "仁和区",
                        "sub": []
                    },
                    {
                        "id": 2870,
                        "name": "米易县",
                        "sub": []
                    },
                    {
                        "id": 2871,
                        "name": "盐边县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 337,
                "name": "遂宁",
                "sub": [
                    {
                        "id": 2872,
                        "name": "船山区",
                        "sub": []
                    },
                    {
                        "id": 2873,
                        "name": "安居区",
                        "sub": []
                    },
                    {
                        "id": 2874,
                        "name": "蓬溪县",
                        "sub": []
                    },
                    {
                        "id": 2875,
                        "name": "射洪县",
                        "sub": []
                    },
                    {
                        "id": 2876,
                        "name": "大英县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 338,
                "name": "雅安",
                "sub": [
                    {
                        "id": 2877,
                        "name": "雨城区",
                        "sub": []
                    },
                    {
                        "id": 2878,
                        "name": "名山县",
                        "sub": []
                    },
                    {
                        "id": 2879,
                        "name": "荥经县",
                        "sub": []
                    },
                    {
                        "id": 2880,
                        "name": "汉源县",
                        "sub": []
                    },
                    {
                        "id": 2881,
                        "name": "石棉县",
                        "sub": []
                    },
                    {
                        "id": 2882,
                        "name": "天全县",
                        "sub": []
                    },
                    {
                        "id": 2883,
                        "name": "芦山县",
                        "sub": []
                    },
                    {
                        "id": 2884,
                        "name": "宝兴县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 339,
                "name": "宜宾",
                "sub": [
                    {
                        "id": 2885,
                        "name": "翠屏区",
                        "sub": []
                    },
                    {
                        "id": 2886,
                        "name": "宜宾县",
                        "sub": []
                    },
                    {
                        "id": 2887,
                        "name": "南溪县",
                        "sub": []
                    },
                    {
                        "id": 2888,
                        "name": "江安县",
                        "sub": []
                    },
                    {
                        "id": 2889,
                        "name": "长宁县",
                        "sub": []
                    },
                    {
                        "id": 2890,
                        "name": "高县",
                        "sub": []
                    },
                    {
                        "id": 2891,
                        "name": "珙县",
                        "sub": []
                    },
                    {
                        "id": 2892,
                        "name": "筠连县",
                        "sub": []
                    },
                    {
                        "id": 2893,
                        "name": "兴文县",
                        "sub": []
                    },
                    {
                        "id": 2894,
                        "name": "屏山县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 340,
                "name": "资阳",
                "sub": [
                    {
                        "id": 2895,
                        "name": "雁江区",
                        "sub": []
                    },
                    {
                        "id": 2896,
                        "name": "简阳市",
                        "sub": []
                    },
                    {
                        "id": 2897,
                        "name": "安岳县",
                        "sub": []
                    },
                    {
                        "id": 2898,
                        "name": "乐至县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 341,
                "name": "自贡",
                "sub": [
                    {
                        "id": 2899,
                        "name": "大安区",
                        "sub": []
                    },
                    {
                        "id": 2900,
                        "name": "自流井区",
                        "sub": []
                    },
                    {
                        "id": 2901,
                        "name": "贡井区",
                        "sub": []
                    },
                    {
                        "id": 2902,
                        "name": "沿滩区",
                        "sub": []
                    },
                    {
                        "id": 2903,
                        "name": "荣县",
                        "sub": []
                    },
                    {
                        "id": 2904,
                        "name": "富顺县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 342,
                "name": "泸州",
                "sub": [
                    {
                        "id": 2905,
                        "name": "江阳区",
                        "sub": []
                    },
                    {
                        "id": 2906,
                        "name": "纳溪区",
                        "sub": []
                    },
                    {
                        "id": 2907,
                        "name": "龙马潭区",
                        "sub": []
                    },
                    {
                        "id": 2908,
                        "name": "泸县",
                        "sub": []
                    },
                    {
                        "id": 2909,
                        "name": "合江县",
                        "sub": []
                    },
                    {
                        "id": 2910,
                        "name": "叙永县",
                        "sub": []
                    },
                    {
                        "id": 2911,
                        "name": "古蔺县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 27,
        "name": "天津",
        "sub": [
            {
                "id": 343,
                "name": "天津",
                "sub": [
                    {
                        "id": 2912,
                        "name": "和平区",
                        "sub": []
                    },
                    {
                        "id": 2913,
                        "name": "河西区",
                        "sub": []
                    },
                    {
                        "id": 2914,
                        "name": "南开区",
                        "sub": []
                    },
                    {
                        "id": 2915,
                        "name": "河北区",
                        "sub": []
                    },
                    {
                        "id": 2916,
                        "name": "河东区",
                        "sub": []
                    },
                    {
                        "id": 2917,
                        "name": "红桥区",
                        "sub": []
                    },
                    {
                        "id": 2918,
                        "name": "东丽区",
                        "sub": []
                    },
                    {
                        "id": 2919,
                        "name": "津南区",
                        "sub": []
                    },
                    {
                        "id": 2920,
                        "name": "西青区",
                        "sub": []
                    },
                    {
                        "id": 2921,
                        "name": "北辰区",
                        "sub": []
                    },
                    {
                        "id": 2922,
                        "name": "塘沽区",
                        "sub": []
                    },
                    {
                        "id": 2923,
                        "name": "汉沽区",
                        "sub": []
                    },
                    {
                        "id": 2924,
                        "name": "大港区",
                        "sub": []
                    },
                    {
                        "id": 2925,
                        "name": "武清区",
                        "sub": []
                    },
                    {
                        "id": 2926,
                        "name": "宝坻区",
                        "sub": []
                    },
                    {
                        "id": 2927,
                        "name": "经济开发区",
                        "sub": []
                    },
                    {
                        "id": 2928,
                        "name": "宁河县",
                        "sub": []
                    },
                    {
                        "id": 2929,
                        "name": "静海县",
                        "sub": []
                    },
                    {
                        "id": 2930,
                        "name": "蓟县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 28,
        "name": "西藏",
        "sub": [
            {
                "id": 344,
                "name": "拉萨",
                "sub": [
                    {
                        "id": 2931,
                        "name": "城关区",
                        "sub": []
                    },
                    {
                        "id": 2932,
                        "name": "林周县",
                        "sub": []
                    },
                    {
                        "id": 2933,
                        "name": "当雄县",
                        "sub": []
                    },
                    {
                        "id": 2934,
                        "name": "尼木县",
                        "sub": []
                    },
                    {
                        "id": 2935,
                        "name": "曲水县",
                        "sub": []
                    },
                    {
                        "id": 2936,
                        "name": "堆龙德庆县",
                        "sub": []
                    },
                    {
                        "id": 2937,
                        "name": "达孜县",
                        "sub": []
                    },
                    {
                        "id": 2938,
                        "name": "墨竹工卡县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 345,
                "name": "阿里",
                "sub": [
                    {
                        "id": 2939,
                        "name": "噶尔县",
                        "sub": []
                    },
                    {
                        "id": 2940,
                        "name": "普兰县",
                        "sub": []
                    },
                    {
                        "id": 2941,
                        "name": "札达县",
                        "sub": []
                    },
                    {
                        "id": 2942,
                        "name": "日土县",
                        "sub": []
                    },
                    {
                        "id": 2943,
                        "name": "革吉县",
                        "sub": []
                    },
                    {
                        "id": 2944,
                        "name": "改则县",
                        "sub": []
                    },
                    {
                        "id": 2945,
                        "name": "措勤县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 346,
                "name": "昌都",
                "sub": [
                    {
                        "id": 2946,
                        "name": "昌都县",
                        "sub": []
                    },
                    {
                        "id": 2947,
                        "name": "江达县",
                        "sub": []
                    },
                    {
                        "id": 2948,
                        "name": "贡觉县",
                        "sub": []
                    },
                    {
                        "id": 2949,
                        "name": "类乌齐县",
                        "sub": []
                    },
                    {
                        "id": 2950,
                        "name": "丁青县",
                        "sub": []
                    },
                    {
                        "id": 2951,
                        "name": "察雅县",
                        "sub": []
                    },
                    {
                        "id": 2952,
                        "name": "八宿县",
                        "sub": []
                    },
                    {
                        "id": 2953,
                        "name": "左贡县",
                        "sub": []
                    },
                    {
                        "id": 2954,
                        "name": "芒康县",
                        "sub": []
                    },
                    {
                        "id": 2955,
                        "name": "洛隆县",
                        "sub": []
                    },
                    {
                        "id": 2956,
                        "name": "边坝县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 347,
                "name": "林芝",
                "sub": [
                    {
                        "id": 2957,
                        "name": "林芝县",
                        "sub": []
                    },
                    {
                        "id": 2958,
                        "name": "工布江达县",
                        "sub": []
                    },
                    {
                        "id": 2959,
                        "name": "米林县",
                        "sub": []
                    },
                    {
                        "id": 2960,
                        "name": "墨脱县",
                        "sub": []
                    },
                    {
                        "id": 2961,
                        "name": "波密县",
                        "sub": []
                    },
                    {
                        "id": 2962,
                        "name": "察隅县",
                        "sub": []
                    },
                    {
                        "id": 2963,
                        "name": "朗县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 348,
                "name": "那曲",
                "sub": [
                    {
                        "id": 2964,
                        "name": "那曲县",
                        "sub": []
                    },
                    {
                        "id": 2965,
                        "name": "嘉黎县",
                        "sub": []
                    },
                    {
                        "id": 2966,
                        "name": "比如县",
                        "sub": []
                    },
                    {
                        "id": 2967,
                        "name": "聂荣县",
                        "sub": []
                    },
                    {
                        "id": 2968,
                        "name": "安多县",
                        "sub": []
                    },
                    {
                        "id": 2969,
                        "name": "申扎县",
                        "sub": []
                    },
                    {
                        "id": 2970,
                        "name": "索县",
                        "sub": []
                    },
                    {
                        "id": 2971,
                        "name": "班戈县",
                        "sub": []
                    },
                    {
                        "id": 2972,
                        "name": "巴青县",
                        "sub": []
                    },
                    {
                        "id": 2973,
                        "name": "尼玛县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 349,
                "name": "日喀则",
                "sub": [
                    {
                        "id": 2974,
                        "name": "日喀则市",
                        "sub": []
                    },
                    {
                        "id": 2975,
                        "name": "南木林县",
                        "sub": []
                    },
                    {
                        "id": 2976,
                        "name": "江孜县",
                        "sub": []
                    },
                    {
                        "id": 2977,
                        "name": "定日县",
                        "sub": []
                    },
                    {
                        "id": 2978,
                        "name": "萨迦县",
                        "sub": []
                    },
                    {
                        "id": 2979,
                        "name": "拉孜县",
                        "sub": []
                    },
                    {
                        "id": 2980,
                        "name": "昂仁县",
                        "sub": []
                    },
                    {
                        "id": 2981,
                        "name": "谢通门县",
                        "sub": []
                    },
                    {
                        "id": 2982,
                        "name": "白朗县",
                        "sub": []
                    },
                    {
                        "id": 2983,
                        "name": "仁布县",
                        "sub": []
                    },
                    {
                        "id": 2984,
                        "name": "康马县",
                        "sub": []
                    },
                    {
                        "id": 2985,
                        "name": "定结县",
                        "sub": []
                    },
                    {
                        "id": 2986,
                        "name": "仲巴县",
                        "sub": []
                    },
                    {
                        "id": 2987,
                        "name": "亚东县",
                        "sub": []
                    },
                    {
                        "id": 2988,
                        "name": "吉隆县",
                        "sub": []
                    },
                    {
                        "id": 2989,
                        "name": "聂拉木县",
                        "sub": []
                    },
                    {
                        "id": 2990,
                        "name": "萨嘎县",
                        "sub": []
                    },
                    {
                        "id": 2991,
                        "name": "岗巴县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 350,
                "name": "山南",
                "sub": [
                    {
                        "id": 2992,
                        "name": "乃东县",
                        "sub": []
                    },
                    {
                        "id": 2993,
                        "name": "扎囊县",
                        "sub": []
                    },
                    {
                        "id": 2994,
                        "name": "贡嘎县",
                        "sub": []
                    },
                    {
                        "id": 2995,
                        "name": "桑日县",
                        "sub": []
                    },
                    {
                        "id": 2996,
                        "name": "琼结县",
                        "sub": []
                    },
                    {
                        "id": 2997,
                        "name": "曲松县",
                        "sub": []
                    },
                    {
                        "id": 2998,
                        "name": "措美县",
                        "sub": []
                    },
                    {
                        "id": 2999,
                        "name": "洛扎县",
                        "sub": []
                    },
                    {
                        "id": 3000,
                        "name": "加查县",
                        "sub": []
                    },
                    {
                        "id": 3001,
                        "name": "隆子县",
                        "sub": []
                    },
                    {
                        "id": 3002,
                        "name": "错那县",
                        "sub": []
                    },
                    {
                        "id": 3003,
                        "name": "浪卡子县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 29,
        "name": "新疆",
        "sub": [
            {
                "id": 351,
                "name": "乌鲁木齐",
                "sub": [
                    {
                        "id": 3004,
                        "name": "天山区",
                        "sub": []
                    },
                    {
                        "id": 3005,
                        "name": "沙依巴克区",
                        "sub": []
                    },
                    {
                        "id": 3006,
                        "name": "新市区",
                        "sub": []
                    },
                    {
                        "id": 3007,
                        "name": "水磨沟区",
                        "sub": []
                    },
                    {
                        "id": 3008,
                        "name": "头屯河区",
                        "sub": []
                    },
                    {
                        "id": 3009,
                        "name": "达坂城区",
                        "sub": []
                    },
                    {
                        "id": 3010,
                        "name": "米东区",
                        "sub": []
                    },
                    {
                        "id": 3011,
                        "name": "乌鲁木齐县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 352,
                "name": "阿克苏",
                "sub": [
                    {
                        "id": 3012,
                        "name": "阿克苏市",
                        "sub": []
                    },
                    {
                        "id": 3013,
                        "name": "温宿县",
                        "sub": []
                    },
                    {
                        "id": 3014,
                        "name": "库车县",
                        "sub": []
                    },
                    {
                        "id": 3015,
                        "name": "沙雅县",
                        "sub": []
                    },
                    {
                        "id": 3016,
                        "name": "新和县",
                        "sub": []
                    },
                    {
                        "id": 3017,
                        "name": "拜城县",
                        "sub": []
                    },
                    {
                        "id": 3018,
                        "name": "乌什县",
                        "sub": []
                    },
                    {
                        "id": 3019,
                        "name": "阿瓦提县",
                        "sub": []
                    },
                    {
                        "id": 3020,
                        "name": "柯坪县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 353,
                "name": "阿拉尔",
                "sub": [
                    {
                        "id": 3021,
                        "name": "阿拉尔市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 354,
                "name": "巴音郭楞",
                "sub": [
                    {
                        "id": 3022,
                        "name": "库尔勒市",
                        "sub": []
                    },
                    {
                        "id": 3023,
                        "name": "轮台县",
                        "sub": []
                    },
                    {
                        "id": 3024,
                        "name": "尉犁县",
                        "sub": []
                    },
                    {
                        "id": 3025,
                        "name": "若羌县",
                        "sub": []
                    },
                    {
                        "id": 3026,
                        "name": "且末县",
                        "sub": []
                    },
                    {
                        "id": 3027,
                        "name": "焉耆",
                        "sub": []
                    },
                    {
                        "id": 3028,
                        "name": "和静县",
                        "sub": []
                    },
                    {
                        "id": 3029,
                        "name": "和硕县",
                        "sub": []
                    },
                    {
                        "id": 3030,
                        "name": "博湖县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 355,
                "name": "博尔塔拉",
                "sub": [
                    {
                        "id": 3031,
                        "name": "博乐市",
                        "sub": []
                    },
                    {
                        "id": 3032,
                        "name": "精河县",
                        "sub": []
                    },
                    {
                        "id": 3033,
                        "name": "温泉县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 356,
                "name": "昌吉",
                "sub": [
                    {
                        "id": 3034,
                        "name": "呼图壁县",
                        "sub": []
                    },
                    {
                        "id": 3035,
                        "name": "米泉市",
                        "sub": []
                    },
                    {
                        "id": 3036,
                        "name": "昌吉市",
                        "sub": []
                    },
                    {
                        "id": 3037,
                        "name": "阜康市",
                        "sub": []
                    },
                    {
                        "id": 3038,
                        "name": "玛纳斯县",
                        "sub": []
                    },
                    {
                        "id": 3039,
                        "name": "奇台县",
                        "sub": []
                    },
                    {
                        "id": 3040,
                        "name": "吉木萨尔县",
                        "sub": []
                    },
                    {
                        "id": 3041,
                        "name": "木垒",
                        "sub": []
                    }
                ]
            },
            {
                "id": 357,
                "name": "哈密",
                "sub": [
                    {
                        "id": 3042,
                        "name": "哈密市",
                        "sub": []
                    },
                    {
                        "id": 3043,
                        "name": "伊吾县",
                        "sub": []
                    },
                    {
                        "id": 3044,
                        "name": "巴里坤",
                        "sub": []
                    }
                ]
            },
            {
                "id": 358,
                "name": "和田",
                "sub": [
                    {
                        "id": 3045,
                        "name": "和田市",
                        "sub": []
                    },
                    {
                        "id": 3046,
                        "name": "和田县",
                        "sub": []
                    },
                    {
                        "id": 3047,
                        "name": "墨玉县",
                        "sub": []
                    },
                    {
                        "id": 3048,
                        "name": "皮山县",
                        "sub": []
                    },
                    {
                        "id": 3049,
                        "name": "洛浦县",
                        "sub": []
                    },
                    {
                        "id": 3050,
                        "name": "策勒县",
                        "sub": []
                    },
                    {
                        "id": 3051,
                        "name": "于田县",
                        "sub": []
                    },
                    {
                        "id": 3052,
                        "name": "民丰县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 359,
                "name": "喀什",
                "sub": [
                    {
                        "id": 3053,
                        "name": "喀什市",
                        "sub": []
                    },
                    {
                        "id": 3054,
                        "name": "疏附县",
                        "sub": []
                    },
                    {
                        "id": 3055,
                        "name": "疏勒县",
                        "sub": []
                    },
                    {
                        "id": 3056,
                        "name": "英吉沙县",
                        "sub": []
                    },
                    {
                        "id": 3057,
                        "name": "泽普县",
                        "sub": []
                    },
                    {
                        "id": 3058,
                        "name": "莎车县",
                        "sub": []
                    },
                    {
                        "id": 3059,
                        "name": "叶城县",
                        "sub": []
                    },
                    {
                        "id": 3060,
                        "name": "麦盖提县",
                        "sub": []
                    },
                    {
                        "id": 3061,
                        "name": "岳普湖县",
                        "sub": []
                    },
                    {
                        "id": 3062,
                        "name": "伽师县",
                        "sub": []
                    },
                    {
                        "id": 3063,
                        "name": "巴楚县",
                        "sub": []
                    },
                    {
                        "id": 3064,
                        "name": "塔什库尔干",
                        "sub": []
                    }
                ]
            },
            {
                "id": 360,
                "name": "克拉玛依",
                "sub": [
                    {
                        "id": 3065,
                        "name": "克拉玛依市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 361,
                "name": "克孜勒苏",
                "sub": [
                    {
                        "id": 3066,
                        "name": "阿图什市",
                        "sub": []
                    },
                    {
                        "id": 3067,
                        "name": "阿克陶县",
                        "sub": []
                    },
                    {
                        "id": 3068,
                        "name": "阿合奇县",
                        "sub": []
                    },
                    {
                        "id": 3069,
                        "name": "乌恰县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 362,
                "name": "石河子",
                "sub": [
                    {
                        "id": 3070,
                        "name": "石河子市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 363,
                "name": "图木舒克",
                "sub": [
                    {
                        "id": 3071,
                        "name": "图木舒克市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 364,
                "name": "吐鲁番",
                "sub": [
                    {
                        "id": 3072,
                        "name": "吐鲁番市",
                        "sub": []
                    },
                    {
                        "id": 3073,
                        "name": "鄯善县",
                        "sub": []
                    },
                    {
                        "id": 3074,
                        "name": "托克逊县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 365,
                "name": "五家渠",
                "sub": [
                    {
                        "id": 3075,
                        "name": "五家渠市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 366,
                "name": "伊犁",
                "sub": [
                    {
                        "id": 3076,
                        "name": "阿勒泰市",
                        "sub": []
                    },
                    {
                        "id": 3077,
                        "name": "布克赛尔",
                        "sub": []
                    },
                    {
                        "id": 3078,
                        "name": "伊宁市",
                        "sub": []
                    },
                    {
                        "id": 3079,
                        "name": "布尔津县",
                        "sub": []
                    },
                    {
                        "id": 3080,
                        "name": "奎屯市",
                        "sub": []
                    },
                    {
                        "id": 3081,
                        "name": "乌苏市",
                        "sub": []
                    },
                    {
                        "id": 3082,
                        "name": "额敏县",
                        "sub": []
                    },
                    {
                        "id": 3083,
                        "name": "富蕴县",
                        "sub": []
                    },
                    {
                        "id": 3084,
                        "name": "伊宁县",
                        "sub": []
                    },
                    {
                        "id": 3085,
                        "name": "福海县",
                        "sub": []
                    },
                    {
                        "id": 3086,
                        "name": "霍城县",
                        "sub": []
                    },
                    {
                        "id": 3087,
                        "name": "沙湾县",
                        "sub": []
                    },
                    {
                        "id": 3088,
                        "name": "巩留县",
                        "sub": []
                    },
                    {
                        "id": 3089,
                        "name": "哈巴河县",
                        "sub": []
                    },
                    {
                        "id": 3090,
                        "name": "托里县",
                        "sub": []
                    },
                    {
                        "id": 3091,
                        "name": "青河县",
                        "sub": []
                    },
                    {
                        "id": 3092,
                        "name": "新源县",
                        "sub": []
                    },
                    {
                        "id": 3093,
                        "name": "裕民县",
                        "sub": []
                    },
                    {
                        "id": 3094,
                        "name": "和布克赛尔",
                        "sub": []
                    },
                    {
                        "id": 3095,
                        "name": "吉木乃县",
                        "sub": []
                    },
                    {
                        "id": 3096,
                        "name": "昭苏县",
                        "sub": []
                    },
                    {
                        "id": 3097,
                        "name": "特克斯县",
                        "sub": []
                    },
                    {
                        "id": 3098,
                        "name": "尼勒克县",
                        "sub": []
                    },
                    {
                        "id": 3099,
                        "name": "察布查尔",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 30,
        "name": "云南",
        "sub": [
            {
                "id": 367,
                "name": "昆明",
                "sub": [
                    {
                        "id": 3100,
                        "name": "盘龙区",
                        "sub": []
                    },
                    {
                        "id": 3101,
                        "name": "五华区",
                        "sub": []
                    },
                    {
                        "id": 3102,
                        "name": "官渡区",
                        "sub": []
                    },
                    {
                        "id": 3103,
                        "name": "西山区",
                        "sub": []
                    },
                    {
                        "id": 3104,
                        "name": "东川区",
                        "sub": []
                    },
                    {
                        "id": 3105,
                        "name": "安宁市",
                        "sub": []
                    },
                    {
                        "id": 3106,
                        "name": "呈贡县",
                        "sub": []
                    },
                    {
                        "id": 3107,
                        "name": "晋宁县",
                        "sub": []
                    },
                    {
                        "id": 3108,
                        "name": "富民县",
                        "sub": []
                    },
                    {
                        "id": 3109,
                        "name": "宜良县",
                        "sub": []
                    },
                    {
                        "id": 3110,
                        "name": "嵩明县",
                        "sub": []
                    },
                    {
                        "id": 3111,
                        "name": "石林县",
                        "sub": []
                    },
                    {
                        "id": 3112,
                        "name": "禄劝",
                        "sub": []
                    },
                    {
                        "id": 3113,
                        "name": "寻甸",
                        "sub": []
                    }
                ]
            },
            {
                "id": 368,
                "name": "怒江",
                "sub": [
                    {
                        "id": 3114,
                        "name": "兰坪",
                        "sub": []
                    },
                    {
                        "id": 3115,
                        "name": "泸水县",
                        "sub": []
                    },
                    {
                        "id": 3116,
                        "name": "福贡县",
                        "sub": []
                    },
                    {
                        "id": 3117,
                        "name": "贡山",
                        "sub": []
                    }
                ]
            },
            {
                "id": 369,
                "name": "普洱",
                "sub": [
                    {
                        "id": 3118,
                        "name": "宁洱",
                        "sub": []
                    },
                    {
                        "id": 3119,
                        "name": "思茅区",
                        "sub": []
                    },
                    {
                        "id": 3120,
                        "name": "墨江",
                        "sub": []
                    },
                    {
                        "id": 3121,
                        "name": "景东",
                        "sub": []
                    },
                    {
                        "id": 3122,
                        "name": "景谷",
                        "sub": []
                    },
                    {
                        "id": 3123,
                        "name": "镇沅",
                        "sub": []
                    },
                    {
                        "id": 3124,
                        "name": "江城",
                        "sub": []
                    },
                    {
                        "id": 3125,
                        "name": "孟连",
                        "sub": []
                    },
                    {
                        "id": 3126,
                        "name": "澜沧",
                        "sub": []
                    },
                    {
                        "id": 3127,
                        "name": "西盟",
                        "sub": []
                    }
                ]
            },
            {
                "id": 370,
                "name": "丽江",
                "sub": [
                    {
                        "id": 3128,
                        "name": "古城区",
                        "sub": []
                    },
                    {
                        "id": 3129,
                        "name": "宁蒗",
                        "sub": []
                    },
                    {
                        "id": 3130,
                        "name": "玉龙",
                        "sub": []
                    },
                    {
                        "id": 3131,
                        "name": "永胜县",
                        "sub": []
                    },
                    {
                        "id": 3132,
                        "name": "华坪县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 371,
                "name": "保山",
                "sub": [
                    {
                        "id": 3133,
                        "name": "隆阳区",
                        "sub": []
                    },
                    {
                        "id": 3134,
                        "name": "施甸县",
                        "sub": []
                    },
                    {
                        "id": 3135,
                        "name": "腾冲县",
                        "sub": []
                    },
                    {
                        "id": 3136,
                        "name": "龙陵县",
                        "sub": []
                    },
                    {
                        "id": 3137,
                        "name": "昌宁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 372,
                "name": "楚雄",
                "sub": [
                    {
                        "id": 3138,
                        "name": "楚雄市",
                        "sub": []
                    },
                    {
                        "id": 3139,
                        "name": "双柏县",
                        "sub": []
                    },
                    {
                        "id": 3140,
                        "name": "牟定县",
                        "sub": []
                    },
                    {
                        "id": 3141,
                        "name": "南华县",
                        "sub": []
                    },
                    {
                        "id": 3142,
                        "name": "姚安县",
                        "sub": []
                    },
                    {
                        "id": 3143,
                        "name": "大姚县",
                        "sub": []
                    },
                    {
                        "id": 3144,
                        "name": "永仁县",
                        "sub": []
                    },
                    {
                        "id": 3145,
                        "name": "元谋县",
                        "sub": []
                    },
                    {
                        "id": 3146,
                        "name": "武定县",
                        "sub": []
                    },
                    {
                        "id": 3147,
                        "name": "禄丰县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 373,
                "name": "大理",
                "sub": [
                    {
                        "id": 3148,
                        "name": "大理市",
                        "sub": []
                    },
                    {
                        "id": 3149,
                        "name": "祥云县",
                        "sub": []
                    },
                    {
                        "id": 3150,
                        "name": "宾川县",
                        "sub": []
                    },
                    {
                        "id": 3151,
                        "name": "弥渡县",
                        "sub": []
                    },
                    {
                        "id": 3152,
                        "name": "永平县",
                        "sub": []
                    },
                    {
                        "id": 3153,
                        "name": "云龙县",
                        "sub": []
                    },
                    {
                        "id": 3154,
                        "name": "洱源县",
                        "sub": []
                    },
                    {
                        "id": 3155,
                        "name": "剑川县",
                        "sub": []
                    },
                    {
                        "id": 3156,
                        "name": "鹤庆县",
                        "sub": []
                    },
                    {
                        "id": 3157,
                        "name": "漾濞",
                        "sub": []
                    },
                    {
                        "id": 3158,
                        "name": "南涧",
                        "sub": []
                    },
                    {
                        "id": 3159,
                        "name": "巍山",
                        "sub": []
                    }
                ]
            },
            {
                "id": 374,
                "name": "德宏",
                "sub": [
                    {
                        "id": 3160,
                        "name": "潞西市",
                        "sub": []
                    },
                    {
                        "id": 3161,
                        "name": "瑞丽市",
                        "sub": []
                    },
                    {
                        "id": 3162,
                        "name": "梁河县",
                        "sub": []
                    },
                    {
                        "id": 3163,
                        "name": "盈江县",
                        "sub": []
                    },
                    {
                        "id": 3164,
                        "name": "陇川县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 375,
                "name": "迪庆",
                "sub": [
                    {
                        "id": 3165,
                        "name": "香格里拉县",
                        "sub": []
                    },
                    {
                        "id": 3166,
                        "name": "德钦县",
                        "sub": []
                    },
                    {
                        "id": 3167,
                        "name": "维西",
                        "sub": []
                    }
                ]
            },
            {
                "id": 376,
                "name": "红河",
                "sub": [
                    {
                        "id": 3168,
                        "name": "泸西县",
                        "sub": []
                    },
                    {
                        "id": 3169,
                        "name": "蒙自县",
                        "sub": []
                    },
                    {
                        "id": 3170,
                        "name": "个旧市",
                        "sub": []
                    },
                    {
                        "id": 3171,
                        "name": "开远市",
                        "sub": []
                    },
                    {
                        "id": 3172,
                        "name": "绿春县",
                        "sub": []
                    },
                    {
                        "id": 3173,
                        "name": "建水县",
                        "sub": []
                    },
                    {
                        "id": 3174,
                        "name": "石屏县",
                        "sub": []
                    },
                    {
                        "id": 3175,
                        "name": "弥勒县",
                        "sub": []
                    },
                    {
                        "id": 3176,
                        "name": "元阳县",
                        "sub": []
                    },
                    {
                        "id": 3177,
                        "name": "红河县",
                        "sub": []
                    },
                    {
                        "id": 3178,
                        "name": "金平",
                        "sub": []
                    },
                    {
                        "id": 3179,
                        "name": "河口",
                        "sub": []
                    },
                    {
                        "id": 3180,
                        "name": "屏边",
                        "sub": []
                    }
                ]
            },
            {
                "id": 377,
                "name": "临沧",
                "sub": [
                    {
                        "id": 3181,
                        "name": "临翔区",
                        "sub": []
                    },
                    {
                        "id": 3182,
                        "name": "凤庆县",
                        "sub": []
                    },
                    {
                        "id": 3183,
                        "name": "云县",
                        "sub": []
                    },
                    {
                        "id": 3184,
                        "name": "永德县",
                        "sub": []
                    },
                    {
                        "id": 3185,
                        "name": "镇康县",
                        "sub": []
                    },
                    {
                        "id": 3186,
                        "name": "双江",
                        "sub": []
                    },
                    {
                        "id": 3187,
                        "name": "耿马",
                        "sub": []
                    },
                    {
                        "id": 3188,
                        "name": "沧源",
                        "sub": []
                    }
                ]
            },
            {
                "id": 378,
                "name": "曲靖",
                "sub": [
                    {
                        "id": 3189,
                        "name": "麒麟区",
                        "sub": []
                    },
                    {
                        "id": 3190,
                        "name": "宣威市",
                        "sub": []
                    },
                    {
                        "id": 3191,
                        "name": "马龙县",
                        "sub": []
                    },
                    {
                        "id": 3192,
                        "name": "陆良县",
                        "sub": []
                    },
                    {
                        "id": 3193,
                        "name": "师宗县",
                        "sub": []
                    },
                    {
                        "id": 3194,
                        "name": "罗平县",
                        "sub": []
                    },
                    {
                        "id": 3195,
                        "name": "富源县",
                        "sub": []
                    },
                    {
                        "id": 3196,
                        "name": "会泽县",
                        "sub": []
                    },
                    {
                        "id": 3197,
                        "name": "沾益县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 379,
                "name": "文山",
                "sub": [
                    {
                        "id": 3198,
                        "name": "文山县",
                        "sub": []
                    },
                    {
                        "id": 3199,
                        "name": "砚山县",
                        "sub": []
                    },
                    {
                        "id": 3200,
                        "name": "西畴县",
                        "sub": []
                    },
                    {
                        "id": 3201,
                        "name": "麻栗坡县",
                        "sub": []
                    },
                    {
                        "id": 3202,
                        "name": "马关县",
                        "sub": []
                    },
                    {
                        "id": 3203,
                        "name": "丘北县",
                        "sub": []
                    },
                    {
                        "id": 3204,
                        "name": "广南县",
                        "sub": []
                    },
                    {
                        "id": 3205,
                        "name": "富宁县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 380,
                "name": "西双版纳",
                "sub": [
                    {
                        "id": 3206,
                        "name": "景洪市",
                        "sub": []
                    },
                    {
                        "id": 3207,
                        "name": "勐海县",
                        "sub": []
                    },
                    {
                        "id": 3208,
                        "name": "勐腊县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 381,
                "name": "玉溪",
                "sub": [
                    {
                        "id": 3209,
                        "name": "红塔区",
                        "sub": []
                    },
                    {
                        "id": 3210,
                        "name": "江川县",
                        "sub": []
                    },
                    {
                        "id": 3211,
                        "name": "澄江县",
                        "sub": []
                    },
                    {
                        "id": 3212,
                        "name": "通海县",
                        "sub": []
                    },
                    {
                        "id": 3213,
                        "name": "华宁县",
                        "sub": []
                    },
                    {
                        "id": 3214,
                        "name": "易门县",
                        "sub": []
                    },
                    {
                        "id": 3215,
                        "name": "峨山",
                        "sub": []
                    },
                    {
                        "id": 3216,
                        "name": "新平",
                        "sub": []
                    },
                    {
                        "id": 3217,
                        "name": "元江",
                        "sub": []
                    }
                ]
            },
            {
                "id": 382,
                "name": "昭通",
                "sub": [
                    {
                        "id": 3218,
                        "name": "昭阳区",
                        "sub": []
                    },
                    {
                        "id": 3219,
                        "name": "鲁甸县",
                        "sub": []
                    },
                    {
                        "id": 3220,
                        "name": "巧家县",
                        "sub": []
                    },
                    {
                        "id": 3221,
                        "name": "盐津县",
                        "sub": []
                    },
                    {
                        "id": 3222,
                        "name": "大关县",
                        "sub": []
                    },
                    {
                        "id": 3223,
                        "name": "永善县",
                        "sub": []
                    },
                    {
                        "id": 3224,
                        "name": "绥江县",
                        "sub": []
                    },
                    {
                        "id": 3225,
                        "name": "镇雄县",
                        "sub": []
                    },
                    {
                        "id": 3226,
                        "name": "彝良县",
                        "sub": []
                    },
                    {
                        "id": 3227,
                        "name": "威信县",
                        "sub": []
                    },
                    {
                        "id": 3228,
                        "name": "水富县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 31,
        "name": "浙江",
        "sub": [
            {
                "id": 383,
                "name": "杭州",
                "sub": [
                    {
                        "id": 3229,
                        "name": "西湖区",
                        "sub": []
                    },
                    {
                        "id": 3230,
                        "name": "上城区",
                        "sub": []
                    },
                    {
                        "id": 3231,
                        "name": "下城区",
                        "sub": []
                    },
                    {
                        "id": 3232,
                        "name": "拱墅区",
                        "sub": []
                    },
                    {
                        "id": 3233,
                        "name": "滨江区",
                        "sub": []
                    },
                    {
                        "id": 3234,
                        "name": "江干区",
                        "sub": []
                    },
                    {
                        "id": 3235,
                        "name": "萧山区",
                        "sub": []
                    },
                    {
                        "id": 3236,
                        "name": "余杭区",
                        "sub": []
                    },
                    {
                        "id": 3237,
                        "name": "市郊",
                        "sub": []
                    },
                    {
                        "id": 3238,
                        "name": "建德市",
                        "sub": []
                    },
                    {
                        "id": 3239,
                        "name": "富阳市",
                        "sub": []
                    },
                    {
                        "id": 3240,
                        "name": "临安市",
                        "sub": []
                    },
                    {
                        "id": 3241,
                        "name": "桐庐县",
                        "sub": []
                    },
                    {
                        "id": 3242,
                        "name": "淳安县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 384,
                "name": "湖州",
                "sub": [
                    {
                        "id": 3243,
                        "name": "吴兴区",
                        "sub": []
                    },
                    {
                        "id": 3244,
                        "name": "南浔区",
                        "sub": []
                    },
                    {
                        "id": 3245,
                        "name": "德清县",
                        "sub": []
                    },
                    {
                        "id": 3246,
                        "name": "长兴县",
                        "sub": []
                    },
                    {
                        "id": 3247,
                        "name": "安吉县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 385,
                "name": "嘉兴",
                "sub": [
                    {
                        "id": 3248,
                        "name": "南湖区",
                        "sub": []
                    },
                    {
                        "id": 3249,
                        "name": "秀洲区",
                        "sub": []
                    },
                    {
                        "id": 3250,
                        "name": "海宁市",
                        "sub": []
                    },
                    {
                        "id": 3251,
                        "name": "嘉善县",
                        "sub": []
                    },
                    {
                        "id": 3252,
                        "name": "平湖市",
                        "sub": []
                    },
                    {
                        "id": 3253,
                        "name": "桐乡市",
                        "sub": []
                    },
                    {
                        "id": 3254,
                        "name": "海盐县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 386,
                "name": "金华",
                "sub": [
                    {
                        "id": 3255,
                        "name": "婺城区",
                        "sub": []
                    },
                    {
                        "id": 3256,
                        "name": "金东区",
                        "sub": []
                    },
                    {
                        "id": 3257,
                        "name": "兰溪市",
                        "sub": []
                    },
                    {
                        "id": 3258,
                        "name": "市区",
                        "sub": []
                    },
                    {
                        "id": 3259,
                        "name": "佛堂镇",
                        "sub": []
                    },
                    {
                        "id": 3260,
                        "name": "上溪镇",
                        "sub": []
                    },
                    {
                        "id": 3261,
                        "name": "义亭镇",
                        "sub": []
                    },
                    {
                        "id": 3262,
                        "name": "大陈镇",
                        "sub": []
                    },
                    {
                        "id": 3263,
                        "name": "苏溪镇",
                        "sub": []
                    },
                    {
                        "id": 3264,
                        "name": "赤岸镇",
                        "sub": []
                    },
                    {
                        "id": 3265,
                        "name": "东阳市",
                        "sub": []
                    },
                    {
                        "id": 3266,
                        "name": "永康市",
                        "sub": []
                    },
                    {
                        "id": 3267,
                        "name": "武义县",
                        "sub": []
                    },
                    {
                        "id": 3268,
                        "name": "浦江县",
                        "sub": []
                    },
                    {
                        "id": 3269,
                        "name": "磐安县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 387,
                "name": "丽水",
                "sub": [
                    {
                        "id": 3270,
                        "name": "莲都区",
                        "sub": []
                    },
                    {
                        "id": 3271,
                        "name": "龙泉市",
                        "sub": []
                    },
                    {
                        "id": 3272,
                        "name": "青田县",
                        "sub": []
                    },
                    {
                        "id": 3273,
                        "name": "缙云县",
                        "sub": []
                    },
                    {
                        "id": 3274,
                        "name": "遂昌县",
                        "sub": []
                    },
                    {
                        "id": 3275,
                        "name": "松阳县",
                        "sub": []
                    },
                    {
                        "id": 3276,
                        "name": "云和县",
                        "sub": []
                    },
                    {
                        "id": 3277,
                        "name": "庆元县",
                        "sub": []
                    },
                    {
                        "id": 3278,
                        "name": "景宁",
                        "sub": []
                    }
                ]
            },
            {
                "id": 388,
                "name": "宁波",
                "sub": [
                    {
                        "id": 3279,
                        "name": "海曙区",
                        "sub": []
                    },
                    {
                        "id": 3280,
                        "name": "江东区",
                        "sub": []
                    },
                    {
                        "id": 3281,
                        "name": "江北区",
                        "sub": []
                    },
                    {
                        "id": 3282,
                        "name": "镇海区",
                        "sub": []
                    },
                    {
                        "id": 3283,
                        "name": "北仑区",
                        "sub": []
                    },
                    {
                        "id": 3284,
                        "name": "鄞州区",
                        "sub": []
                    },
                    {
                        "id": 3285,
                        "name": "余姚市",
                        "sub": []
                    },
                    {
                        "id": 3286,
                        "name": "慈溪市",
                        "sub": []
                    },
                    {
                        "id": 3287,
                        "name": "奉化市",
                        "sub": []
                    },
                    {
                        "id": 3288,
                        "name": "象山县",
                        "sub": []
                    },
                    {
                        "id": 3289,
                        "name": "宁海县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 389,
                "name": "绍兴",
                "sub": [
                    {
                        "id": 3290,
                        "name": "越城区",
                        "sub": []
                    },
                    {
                        "id": 3291,
                        "name": "上虞市",
                        "sub": []
                    },
                    {
                        "id": 3292,
                        "name": "嵊州市",
                        "sub": []
                    },
                    {
                        "id": 3293,
                        "name": "绍兴县",
                        "sub": []
                    },
                    {
                        "id": 3294,
                        "name": "新昌县",
                        "sub": []
                    },
                    {
                        "id": 3295,
                        "name": "诸暨市",
                        "sub": []
                    }
                ]
            },
            {
                "id": 390,
                "name": "台州",
                "sub": [
                    {
                        "id": 3296,
                        "name": "椒江区",
                        "sub": []
                    },
                    {
                        "id": 3297,
                        "name": "黄岩区",
                        "sub": []
                    },
                    {
                        "id": 3298,
                        "name": "路桥区",
                        "sub": []
                    },
                    {
                        "id": 3299,
                        "name": "温岭市",
                        "sub": []
                    },
                    {
                        "id": 3300,
                        "name": "临海市",
                        "sub": []
                    },
                    {
                        "id": 3301,
                        "name": "玉环县",
                        "sub": []
                    },
                    {
                        "id": 3302,
                        "name": "三门县",
                        "sub": []
                    },
                    {
                        "id": 3303,
                        "name": "天台县",
                        "sub": []
                    },
                    {
                        "id": 3304,
                        "name": "仙居县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 391,
                "name": "温州",
                "sub": [
                    {
                        "id": 3305,
                        "name": "鹿城区",
                        "sub": []
                    },
                    {
                        "id": 3306,
                        "name": "龙湾区",
                        "sub": []
                    },
                    {
                        "id": 3307,
                        "name": "瓯海区",
                        "sub": []
                    },
                    {
                        "id": 3308,
                        "name": "瑞安市",
                        "sub": []
                    },
                    {
                        "id": 3309,
                        "name": "乐清市",
                        "sub": []
                    },
                    {
                        "id": 3310,
                        "name": "洞头县",
                        "sub": []
                    },
                    {
                        "id": 3311,
                        "name": "永嘉县",
                        "sub": []
                    },
                    {
                        "id": 3312,
                        "name": "平阳县",
                        "sub": []
                    },
                    {
                        "id": 3313,
                        "name": "苍南县",
                        "sub": []
                    },
                    {
                        "id": 3314,
                        "name": "文成县",
                        "sub": []
                    },
                    {
                        "id": 3315,
                        "name": "泰顺县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 392,
                "name": "舟山",
                "sub": [
                    {
                        "id": 3316,
                        "name": "定海区",
                        "sub": []
                    },
                    {
                        "id": 3317,
                        "name": "普陀区",
                        "sub": []
                    },
                    {
                        "id": 3318,
                        "name": "岱山县",
                        "sub": []
                    },
                    {
                        "id": 3319,
                        "name": "嵊泗县",
                        "sub": []
                    }
                ]
            },
            {
                "id": 393,
                "name": "衢州",
                "sub": [
                    {
                        "id": 3320,
                        "name": "衢州市",
                        "sub": []
                    },
                    {
                        "id": 3321,
                        "name": "江山市",
                        "sub": []
                    },
                    {
                        "id": 3322,
                        "name": "常山县",
                        "sub": []
                    },
                    {
                        "id": 3323,
                        "name": "开化县",
                        "sub": []
                    },
                    {
                        "id": 3324,
                        "name": "龙游县",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 32,
        "name": "重庆",
        "sub": [
            {
                "id": 394,
                "name": "重庆",
                "sub": [
                    {
                        "id": 3325,
                        "name": "合川区",
                        "sub": []
                    },
                    {
                        "id": 3326,
                        "name": "江津区",
                        "sub": []
                    },
                    {
                        "id": 3327,
                        "name": "南川区",
                        "sub": []
                    },
                    {
                        "id": 3328,
                        "name": "永川区",
                        "sub": []
                    },
                    {
                        "id": 3329,
                        "name": "南岸区",
                        "sub": []
                    },
                    {
                        "id": 3330,
                        "name": "渝北区",
                        "sub": []
                    },
                    {
                        "id": 3331,
                        "name": "万盛区",
                        "sub": []
                    },
                    {
                        "id": 3332,
                        "name": "大渡口区",
                        "sub": []
                    },
                    {
                        "id": 3333,
                        "name": "万州区",
                        "sub": []
                    },
                    {
                        "id": 3334,
                        "name": "北碚区",
                        "sub": []
                    },
                    {
                        "id": 3335,
                        "name": "沙坪坝区",
                        "sub": []
                    },
                    {
                        "id": 3336,
                        "name": "巴南区",
                        "sub": []
                    },
                    {
                        "id": 3337,
                        "name": "涪陵区",
                        "sub": []
                    },
                    {
                        "id": 3338,
                        "name": "江北区",
                        "sub": []
                    },
                    {
                        "id": 3339,
                        "name": "九龙坡区",
                        "sub": []
                    },
                    {
                        "id": 3340,
                        "name": "渝中区",
                        "sub": []
                    },
                    {
                        "id": 3341,
                        "name": "黔江开发区",
                        "sub": []
                    },
                    {
                        "id": 3342,
                        "name": "长寿区",
                        "sub": []
                    },
                    {
                        "id": 3343,
                        "name": "双桥区",
                        "sub": []
                    },
                    {
                        "id": 3344,
                        "name": "綦江县",
                        "sub": []
                    },
                    {
                        "id": 3345,
                        "name": "潼南县",
                        "sub": []
                    },
                    {
                        "id": 3346,
                        "name": "铜梁县",
                        "sub": []
                    },
                    {
                        "id": 3347,
                        "name": "大足县",
                        "sub": []
                    },
                    {
                        "id": 3348,
                        "name": "荣昌县",
                        "sub": []
                    },
                    {
                        "id": 3349,
                        "name": "璧山县",
                        "sub": []
                    },
                    {
                        "id": 3350,
                        "name": "垫江县",
                        "sub": []
                    },
                    {
                        "id": 3351,
                        "name": "武隆县",
                        "sub": []
                    },
                    {
                        "id": 3352,
                        "name": "丰都县",
                        "sub": []
                    },
                    {
                        "id": 3353,
                        "name": "城口县",
                        "sub": []
                    },
                    {
                        "id": 3354,
                        "name": "梁平县",
                        "sub": []
                    },
                    {
                        "id": 3355,
                        "name": "开县",
                        "sub": []
                    },
                    {
                        "id": 3356,
                        "name": "巫溪县",
                        "sub": []
                    },
                    {
                        "id": 3357,
                        "name": "巫山县",
                        "sub": []
                    },
                    {
                        "id": 3358,
                        "name": "奉节县",
                        "sub": []
                    },
                    {
                        "id": 3359,
                        "name": "云阳县",
                        "sub": []
                    },
                    {
                        "id": 3360,
                        "name": "忠县",
                        "sub": []
                    },
                    {
                        "id": 3361,
                        "name": "石柱",
                        "sub": []
                    },
                    {
                        "id": 3362,
                        "name": "彭水",
                        "sub": []
                    },
                    {
                        "id": 3363,
                        "name": "酉阳",
                        "sub": []
                    },
                    {
                        "id": 3364,
                        "name": "秀山",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 33,
        "name": "香港",
        "sub": [
            {
                "id": 395,
                "name": "香港",
                "sub": [
                    {
                        "id": 3365,
                        "name": "沙田区",
                        "sub": []
                    },
                    {
                        "id": 3366,
                        "name": "东区",
                        "sub": []
                    },
                    {
                        "id": 3367,
                        "name": "观塘区",
                        "sub": []
                    },
                    {
                        "id": 3368,
                        "name": "黄大仙区",
                        "sub": []
                    },
                    {
                        "id": 3369,
                        "name": "九龙城区",
                        "sub": []
                    },
                    {
                        "id": 3370,
                        "name": "屯门区",
                        "sub": []
                    },
                    {
                        "id": 3371,
                        "name": "葵青区",
                        "sub": []
                    },
                    {
                        "id": 3372,
                        "name": "元朗区",
                        "sub": []
                    },
                    {
                        "id": 3373,
                        "name": "深水埗区",
                        "sub": []
                    },
                    {
                        "id": 3374,
                        "name": "西贡区",
                        "sub": []
                    },
                    {
                        "id": 3375,
                        "name": "大埔区",
                        "sub": []
                    },
                    {
                        "id": 3376,
                        "name": "湾仔区",
                        "sub": []
                    },
                    {
                        "id": 3377,
                        "name": "油尖旺区",
                        "sub": []
                    },
                    {
                        "id": 3378,
                        "name": "北区",
                        "sub": []
                    },
                    {
                        "id": 3379,
                        "name": "南区",
                        "sub": []
                    },
                    {
                        "id": 3380,
                        "name": "荃湾区",
                        "sub": []
                    },
                    {
                        "id": 3381,
                        "name": "中西区",
                        "sub": []
                    },
                    {
                        "id": 3382,
                        "name": "离岛区",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 34,
        "name": "澳门",
        "sub": [
            {
                "id": 396,
                "name": "澳门",
                "sub": [
                    {
                        "id": 3383,
                        "name": "澳门",
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "id": 35,
        "name": "台湾",
        "sub": [
            {
                "id": 397,
                "name": "台湾",
                "sub": [
                    {
                        "id": 3384,
                        "name": "台北",
                        "sub": []
                    },
                    {
                        "id": 3385,
                        "name": "高雄",
                        "sub": []
                    },
                    {
                        "id": 3386,
                        "name": "基隆",
                        "sub": []
                    },
                    {
                        "id": 3387,
                        "name": "台中",
                        "sub": []
                    },
                    {
                        "id": 3388,
                        "name": "台南",
                        "sub": []
                    },
                    {
                        "id": 3389,
                        "name": "新竹",
                        "sub": []
                    },
                    {
                        "id": 3390,
                        "name": "嘉义",
                        "sub": []
                    },
                    {
                        "id": 3391,
                        "name": "宜兰县",
                        "sub": []
                    },
                    {
                        "id": 3392,
                        "name": "桃园县",
                        "sub": []
                    },
                    {
                        "id": 3393,
                        "name": "苗栗县",
                        "sub": []
                    },
                    {
                        "id": 3394,
                        "name": "彰化县",
                        "sub": []
                    },
                    {
                        "id": 3395,
                        "name": "南投县",
                        "sub": []
                    },
                    {
                        "id": 3396,
                        "name": "云林县",
                        "sub": []
                    },
                    {
                        "id": 3397,
                        "name": "屏东县",
                        "sub": []
                    },
                    {
                        "id": 3398,
                        "name": "台东县",
                        "sub": []
                    },
                    {
                        "id": 3399,
                        "name": "花莲县",
                        "sub": []
                    },
                    {
                        "id": 3400,
                        "name": "澎湖县",
                        "sub": []
                    }
                ]
            }
        ]
    }
]

}(Zepto);
// jshint ignore: end

/* jshint unused:false*/

+ function($) {
    "use strict";
    var format = function(data) {
        var result = [];
        for(var i=0;i<data.length;i++) {
            var d = data[i];
            if(d.name === "请选择") continue;
            result.push(d.name);
        }
        if(result.length) return result;
        return [""];
    };

    var sub = function(data) {
        if(!data.sub) return [""];
        return format(data.sub);
    };

    var getCities = function(d) {
        for(var i=0;i< raw.length;i++) {
            if(raw[i].name === d) return sub(raw[i]);
        }
        return [""];
    };

    var getDistricts = function(p, c) {
        for(var i=0;i< raw.length;i++) {
            if(raw[i].name === p) {
                for(var j=0;j< raw[i].sub.length;j++) {
                    if(raw[i].sub[j].name === c) {
                        return sub(raw[i].sub[j]);
                    }
                }
            }
        }
        return [""];
    };

    var raw = $.smConfig.rawCitiesData;

    // 返回所有一级城市
    var provinces = raw.map(function(d) {
        return d.name;
    });
    
    var initCities = sub(raw[0]);
    var initDistricts = [""];

    var currentProvince = provinces[0];
    var currentCity = initCities[0];
    var currentDistrict = initDistricts[0];

    var t;
    var defaults = {

        cssClass: "city-picker",
        rotateEffect: false,  //为了性能

        onChange: function (picker, values, displayValues) {
            var newProvince = picker.cols[0].value;
            var newCity;
            if(newProvince !== currentProvince) {
                // 如果Province变化，节流以提高reRender性能
                clearTimeout(t);

                t = setTimeout(function(){
                    var newCities = getCities(newProvince);
                    newCity = newCities[0];
                    var newDistricts = getDistricts(newProvince, newCity);
                    picker.cols[1].replaceValues(newCities);
                    picker.cols[2].replaceValues(newDistricts);
                    currentProvince = newProvince;
                    currentCity = newCity;
                    picker.updateValue();
                }, 200);
                return;
            }
            newCity = picker.cols[1].value;
            if(newCity !== currentCity) {
                picker.cols[2].replaceValues(getDistricts(newProvince, newCity));
                currentCity = newCity;
                picker.updateValue();
            }
        },

        cols: [
        {
            textAlign: 'center',
            values: provinces,
            cssClass: "col-province"
        },
        {
            textAlign: 'center',
            values: initCities,
            cssClass: "col-city"
        },
        {
            textAlign: 'center',
            values: initDistricts,
            cssClass: "col-district"
        }
        ]
    };

    $.fn.cityPicker = function(params) {
        return this.each(function() {
            if(!this) return;
            var p = $.extend(defaults, params);
            //计算value
            if (p.value) {
                $(this).val(p.value.join(' '));
            } else {
                var val = $(this).val();
                val && (p.value = val.split(' '));
            }

            if (p.value) {
                //p.value = val.split(" ");
                if(p.value[0]) {
                    currentProvince = p.value[0];
                    p.cols[1].values = getCities(p.value[0]);
                }
                if(p.value[1]) {
                    currentCity = p.value[1];
                    p.cols[2].values = getDistricts(p.value[0], p.value[1]);
                } else {
                    p.cols[2].values = getDistricts(p.value[0], p.cols[1].values[0]);
                }
                !p.value[2] && (p.value[2] = '');
                currentDistrict = p.value[2];
            }
            $(this).picker(p);
        });
    };

}(Zepto);
